{
    "scrape_settings": {
        "subreddit": "relationship_advice",
        "category": "hot",
        "n_results_or_keywords": "100",
        "time_filter": null
    },
    "data": [
        {
            "author": "u/eganist",
            "created_utc": "12-02-2021 03:24:44",
            "distinguished": null,
            "edited": "12-02-2021 03:27:52",
            "id": "r6w9uh",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Moderator Announcement",
            "locked": true,
            "name": "t3_r6w9uh",
            "nsfw": false,
            "num_comments": 1,
            "permalink": "/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/",
            "score": 2531,
            "selftext": "#On the first topic: \n\nThe subreddit is a place for people to ask for advice on what to do next. I know it sounds dumb, but questions like \"Is this normal?\", \"Am I wrong\", \"Am I an asshole\", \"Is this fair\" or basically any questions asking about whether *something that happened in the past* was okay... these aren't requesting advice on what to do next, so they're not appropriate for the subreddit. \n\nInstead, posts should ask questions like \n\n* \"what should I do next?\" or \n\n* \"how do I do this?\" or \n\n* \"how can I fix this?\" etc.\n\nIf you have a question around something you *think* you want to do but aren't sure if it's a good idea, instead of asking (for instance) \"is this a good idea\" or \"would I be the asshole,\" try to encourage depth, like \"I'm thinking about doing this. What do you think I should do here?\" That way you'll get better answers than just a 'yes' or 'no.' Or at the very least, people might tell you why you should do the thing you already have in mind.\n\nWe're currently automatically removing variations of the following (these phrases aren't all exact):\n\n> \"Is this normal?\", \"Am I wrong\", \"Is it wrong\", \"Am I the asshole\", \"Am I in the wrong\", \"Would I be an asshole\", \"Would I be the asshole\", \"AITA\", \"WIBTA\", \"Should I have done\", \"Who's right here\", \"Was I wrong\", \"Should I have to\", \"Am I overreacting\", \"am I justified\", \"is  reasonable\", \"Am I at fault\", \"Was it irresponsible for\", \"am I out of line\", \"is this a big deal\", \"Isn't that fucked up?\", \"Am I the bad one\", \"Am I being too sensitive\", \"Is it weird\", \"Am I right\"\n\nSo hopefully this gives you an idea of what shouldn't be posted here. If your question is a yes/no question about something that happened in the past (like those are), change your question.\n\n---\n\n#On the second topic: \n\nif you have a question about any sexual situations involving minors (anyone under 18 for the purposes of this subreddit; it doesn't matter what your local laws say), even concerns around potential grooming, please don't post them here. \n\nIf you're a minor and have questions involving sexual topics, consider reaching out to either your parents or sex education/family life resources in your school on these topics, or if you're not comfortable, consider a resource such as:\n\n* [Scarleteen](https://www.scarleteen.com/article/relationships)\n\nIf you're a minor or know of a minor with sexual or potentially sexual interactions with an adult, instead of submitting here, please speak with a teacher, therapist, counselor, social worker, or other mandatory reporter or appropriate adult with your concerns and absolutely make use of the following resources:\n\n* [Darkness to Light: a child sex abuse prevention resource.](https://www.d2l.org/get-help/reporting/)\n\n* [A confidential hotline to a trained advisor who can help you navigate this](https://www.childhelp.org/childhelp-hotline/)\n\n* [International Resources](https://www.ecpat.org/resources)\n\nIt's safe to say that no one here on this subreddit is professionally, legally, or ethically qualified to give advice on these topics, so we're deferring to expert resources and hotlines like the ones above. \n\n## When reporting these, feel free to report these posts with the sexualization of minors option in the report list, as it's being enforced under that Reddit content rule. \n\n---\n\nWe owe a deeper rules reminder soon, but the above should cover the most pressing issues.",
            "spoiler": false,
            "stickied": true,
            "title": "[meta] \"Am I overreacting?\" \"Am I the asshole?\" \"Is this okay?\" don't ask these moral judgment (yes/no questions about the past) questions here. Likewise, absolutely no questions around sexual situations involving anyone under 18. See this thread for what to do instead for both of these.",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/"
        },
        {
            "author": "u/PornoResearch",
            "created_utc": "03-15-2022 18:04:37",
            "distinguished": null,
            "edited": false,
            "id": "tettnq",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": true,
            "name": "t3_tettnq",
            "nsfw": false,
            "num_comments": 0,
            "permalink": "/r/relationship_advice/comments/tettnq/recruiting_adult_women_who_use_pornography_to/",
            "score": 132,
            "selftext": "If you are a woman 18 years and older and you used pornography at least once in the last 6 months, we would like to invite you to complete an online survey about your pornography use. It should take approximately 15-20 minutes to complete. Your participation is voluntary and anonymous. \n\nThe online survey is part of research conducted by Katerina Litsou, PhD researcher at the **School of Psychology, University of Southampton**. \n\nTo participate use this link: [https://southampton.qualtrics.com/jfe/form/SV\\_cZI01RWwXjv88AK](https://southampton.qualtrics.com/jfe/form/SV_cZI01RWwXjv88AK) \n\nAfter completing the survey, you will have the option to enter your email on a separate survey for a chance to win one of five £25 Amazon vouchers.\n\n**The study has been approved by the University of Southampton Ethics Committee.**\n\nIf you have further questions, please contact me: [**a-m.litsou@soton.ac.uk**](mailto:a-m.litsou@soton.ac.uk)",
            "spoiler": false,
            "stickied": true,
            "title": "Recruiting adult women, who use pornography, to complete an online anonymous survey",
            "upvote_ratio": 0.6,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tettnq/recruiting_adult_women_who_use_pornography_to/"
        },
        {
            "author": "u/throwawayaway7439",
            "created_utc": "03-22-2022 12:40:48",
            "distinguished": null,
            "edited": "03-22-2022 12:54:37",
            "id": "tk109w",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk109w",
            "nsfw": false,
            "num_comments": 223,
            "permalink": "/r/relationship_advice/comments/tk109w/my_wife_29_of_four_months_called_the_cops_on_me/",
            "score": 952,
            "selftext": "The texts in questions: https://imgur.com/a/KgjPehl/\n\nContext: The morning of she ripped the blanket off of me while I was half asleep to get my attention and started arguing with me. I got up and grabbed her wrist to get my blanket back. We exchanged nasty words and we both went to work that day. I was upset because she had done this to me several times during our four months together of ripping the blanket off of me to get my attention. She tried calling me 34x that afternoon while I was at the hospital. It was very frustrating for me.\n\nLater that night, my wife confronted me again, I told her I’d like to sleep in separate bedrooms, she then spat on me, I grabbed her hand to ask her to leave our house mainly becausei was worried if she would escalate confrontation further, my mom tried to calm her down with a bear hug, she then ran away, & called the cops one hour later. The police arrested me and my mom for battery. Case was completely dismissed though largely due to the text messages that my wife sent me earlier on that day & it played a major role into why charges were never even filed to begin with.\n\nMy wife is going around town acting all innocent, and hasn’t revealed these texts to anyone. I think these messages show an erratic, confrontational, threatening, and even unhinged individual. Her public image is one of a shy, meek girl so it’s hard for people to believe my ex-wife could raise her voice even above a whisper. She deleted these off my phone after we were taken away, but I recovered them through my MacBook Air.\n\nWe currently separated.",
            "spoiler": false,
            "stickied": false,
            "title": "My wife (29) of four months called the cops on me (29) & my mom, we both got arrested for battery, the case was dismissed largely due to the texts she sent me beforehand, but some family friends want us to reconcile...",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk109w/my_wife_29_of_four_months_called_the_cops_on_me/"
        },
        {
            "author": "u/Glum_Bee_77868",
            "created_utc": "03-22-2022 13:28:06",
            "distinguished": null,
            "edited": false,
            "id": "tk1v7p",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk1v7p",
            "nsfw": false,
            "num_comments": 156,
            "permalink": "/r/relationship_advice/comments/tk1v7p/my_husband_texted_me_that_he_saw_the_most/",
            "score": 139,
            "selftext": "My husband(35M) on his way to work stopped at a coffee shop and texted me(25F) this message: \"Wow, I've just seen the most beautiful girl. She is so stunning\". I was freaked out. When he got home I was mad(we are married only for 1.5 year). I said that I don't like to hear what he had texted me. He said \"Did you really think that you are the most beautiful woman in the planet, what?\" I said: \"Of course I DIDN'T THINK THAT, but why are you saying this to your wife?\" He just described me her look\"angel sweet model girl\", then I realized that she looked like his ex-girlfriend, the same type. I am good-looking, but I am not like her. Damn, I just don't know what to say! He told me that girl in the coffee shop is his \"ideal\". Do you think is it fine to say this? Now when he tries to touch me I am getting mad and I want to cry because I know that I am not like her, and maybe wishes to be with that woman. Please give me some advice!!!",
            "spoiler": false,
            "stickied": false,
            "title": "my husband texted me that he saw the most beautiful woman in his life and it wasn't me",
            "upvote_ratio": 0.92,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk1v7p/my_husband_texted_me_that_he_saw_the_most/"
        },
        {
            "author": "u/theeamazonian",
            "created_utc": "03-22-2022 09:48:54",
            "distinguished": null,
            "edited": "03-22-2022 10:03:21",
            "id": "tjyiw0",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjyiw0",
            "nsfw": false,
            "num_comments": 154,
            "permalink": "/r/relationship_advice/comments/tjyiw0/just_found_out_that_my_bf_had_a_fling_with_his/",
            "score": 193,
            "selftext": "My boyfriend (26M) and I (26F) have been dating for a while. He often enjoys hanging around his brother (27M), they seem to be really close. They hang out every weekend and my boyfriend often goes over to his house.\n\nRecently his brothers fiancée (27F) reached out to me in hopes of us being close friends. At first I was all for it! However during our first night out together, she told me that her and my boyfriend had sex about six years ago. I was in shock! She proceeded to say that it was only a short fling and a few months later she starting dating his brother. \n\nThe brother was aware about the fling before they became serious. I’m just upset at the fact that I am just now made aware of this. The situation is super awkward for me honestly. They all see each other often and spend time together because his brother and fiancée live together, and my BF often visits. \n\nI asked my BF about it and he was devastated that she told me. He said that he had a feeling that the conversation was going to pop up when she and I  started hanging out. He said that he just wants the past to be in the past because his brother is in love, and he wants to move on from it especially since they weren’t seriously involved. \n\nShould I not be upset?! \nHow can we be friends and I’m not comfortable with the situation?!\n\n***My BF and I have been talking for 2 years in total and dating for the last 7 months.",
            "spoiler": false,
            "stickied": false,
            "title": "Just found out that my BF had a fling with his brothers fiancée",
            "upvote_ratio": 0.92,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjyiw0/just_found_out_that_my_bf_had_a_fling_with_his/"
        },
        {
            "author": "u/SARAThrowaway34",
            "created_utc": "03-22-2022 03:05:31",
            "distinguished": null,
            "edited": false,
            "id": "tjsa2m",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjsa2m",
            "nsfw": false,
            "num_comments": 35,
            "permalink": "/r/relationship_advice/comments/tjsa2m/update_i_28f_spent_5_years_thinking_my_exbest/",
            "score": 671,
            "selftext": "[Original Post](https://old.reddit.com/r/relationship_advice/comments/tcz6q2/i_28f_have_spent_the_last_five_years_believing_my/) for those of you who didn’t see my post when I first learned all the fucked up shit my ex-BF “Paul” did.\n\n**TL;DR** My psycho ex was jealous of my friendship with a guy from work and he framed him for trying to rape me.\n\nNow on to the update.\n\nFirst off I want to thank everyone who messaged me to check up on me or to share their own stories with me. I truly appreciate each and every one of you.\n\nI would like to start this off by first saying I haven’t gone back to the wine, though I did super desperately want to yesterday. I haven’t really been much if a drinker since that night 5 years ago and last week when I learned the disgusting truth about Paul.\n\nTo those if you hoping I would file a police report, I did. I spoke with my therapist at length the Monday following my post and she was shocked but extremely helpful in helping me process everything, and she spent some time last what should have been the end of our video appointment looking up the statute of limitation laws in my state (there are none for sex crimes!) and while she warned me that my report might just be added to a pile of other charges Paul could possibly have against him given that he was assigned court mandated AA. All the same, I filed the report with screenshots of his messages to me printed and attached. I’m not sure what to expect from that and at the end of the day I hope he has an absolute shit life if it goes nowhere.\n\nNow, as for Mark.\n\nMy therapist was insistent that I at the very least write him something, whether it be a letter to mail him or a message on Facebook (he never reached out to me after I unblocked him but given what he thought I thought of him I think it’s understandable.) she, like many of you, pointed out that while he knew he was innocent, the thought of someone believing him capable of something monstrous like that could have weighed on him for all this time and even if his reception of my message wasn’t ideal, he deserved at least the closure that this knew turn of events could provide. \n\nI took a few days writing and rewriting a message in notepad (I didn’t want to accidentally hit send before I had the wording right) and each time I sat down to write it I felt like I came up short even though the message just got longer and longer. Again I didn’t think just saying “oh guess what I learned Paul is an absolute psychopath last week, surprise!” Would have been super appropriate either but I wanted to find the right balance.\n\nHere’s the message I ended up sending him:\n\n*****\nHi Mark, so this is a bit out of the blue and I really don’t know how to start this so I’m just going to put it out there. I’m sorry for not listening to you… Paul messaged me last week and revealed everything and I’m just… sorry. This isn’t easy to write and you deserve so much more than just an apology so long after the fact. There’s no excuse for me not giving you the benefit of the doubt other than I let myself be stupidly gaslight by a psychopathic maniac. \n\n(Screenshot of his confession to me)\n\nThis is the message he sent me, it even confesses to an assault on you in the event that you’d like to press charges against him as I have already filed a police report for what he did to me. \n\nIf you would like to talk about any of this at all, my inbox is open. If you want to tell me to fuck off… well I guess I understand that too… I’m not sure what I expect really because this has ripped open a wound I had been trying to heal and I’m sure this might cause you some distress but I felt you at the very least deserved to know.\n\n*****\n\nI know I probably could have said more but any time I kept trying to write I felt like it was just me making excuses. I sent that to him this past Friday and I’m pretty sure he read it some time between Friday and Saturday as the “read” notification had been there when I checked Facebook again at lunch on Saturday (I had been out with my friend “Jenny” who had stayed over with me after I learned the truth and when I told her I had messaged Mark she wondered if he had responded so I checked.)\n\nLast night at about 6PM my phone dinged and while I thought it might have been a text from Jenny or maybe my mom (I don’t really text or talk to a lot of people) I actually found that Mark had sent me a reply.\n\n“I wish you would have listened to me back then, but I’m glad you know the truth.”\n\nI thought that was all he was going to send me when the three dots kept going across the bottom of my screen. He was still typing when he sent me pictures as well. They were graphic and Paul’s assertion that he had beat the shit out of Mark did in fact also come with documented proof from him in the form of pictures. \n\nMark went on to explain that he filed an assault report the next day after my birthday but that the Police had warned him against accusing Paul of sexually assaulting me given the turn of events and my “don’t speak to me again” text I sent him when he tried to explain himself. Nothing had ever come of his police report and he wasn’t even sure why (neither am I but he intended to follow up once more today). \n\nMark is still very much the kind person I remember him being, and while I was bracing for him to hold a grudge against me, he instead just expressed his happiness that I finally knew the truth. \n\nWe exchanged small talk through chat for a little while but it was nowhere near the conversations we used to have. Mark is actually engaged to a girl he has been dating for about two years now. He had apparently never brought any of this up to her until she saw my name flash in his screen with the notification and asked who I was. \n\nWhile some of you expressed concern that my friends had smeared his name, he apparently never heard anything of it. He actually still works for the same company we had both been at just now in a copywriting role for the marketing team so at the very least the lack of a police report from me or making a scene at work worked out in his favor there.\n\nI asked if we could keep in touch, even if only with small talk and he said that he thought that would be okay, though he was a lot busier than he was back then between work and planning his wedding.\n\nWhile I thought that was going to be the end of it, he messaged me a few hours ago to let me know he refiled his police report with the added messages I had sent him and that if I’d be open to it, he’d like to meet for coffee with his fiancée in tow and a friend of mine if I felt more comfortable doing it that way. \n\nNot really sure if that’s an entirely good idea but I shot Jenny a text to see what she thinks and if she’d be open to coming with. She said it’s ultimately up to me what I decide to do and she’d be with me either way so yeah, that’s the update for those of you who have reached out and asked.\n\n**TL;DR** Told Mark about Paul’s confession. He was happy to be finally absolved in my eyes and didn’t seem to hold a grudge against me. We might get coffee this weekend supervised by his fiancée and my friend.",
            "spoiler": false,
            "stickied": false,
            "title": "[Update] I [28/f] spent 5 years thinking my Ex-Best Friend [29/m] tried to rape me.",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjsa2m/update_i_28f_spent_5_years_thinking_my_exbest/"
        },
        {
            "author": "u/Apprehensive_Cake108",
            "created_utc": "03-22-2022 10:14:42",
            "distinguished": null,
            "edited": false,
            "id": "tjyvm7",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjyvm7",
            "nsfw": false,
            "num_comments": 73,
            "permalink": "/r/relationship_advice/comments/tjyvm7/can_i_breakup_as_gf_wont_stop_meeting_guy_who/",
            "score": 154,
            "selftext": " \n\nIts her best friend. He confessed one night but joked the next day he was drunk, sure buddy. Now my gf doesnt want us to hold hands or say i love you in front of him as his feelings might get hurt? Wtf is going on?\n\nInfo- I am 28m, she is 30f and he is 32m.",
            "spoiler": false,
            "stickied": false,
            "title": "Can I breakup as gf wont stop meeting guy who confessed love to her",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjyvm7/can_i_breakup_as_gf_wont_stop_meeting_guy_who/"
        },
        {
            "author": "u/Far-Title9817",
            "created_utc": "03-22-2022 08:36:43",
            "distinguished": null,
            "edited": false,
            "id": "tjxkcg",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjxkcg",
            "nsfw": false,
            "num_comments": 73,
            "permalink": "/r/relationship_advice/comments/tjxkcg/realising_my_gf_doesnt_respect_me/",
            "score": 127,
            "selftext": "My Gf (23f) and I (25M) went out for a few beers on Saturday, I was rolling a cigarette for her. A women on the table next to me asked for a paper, so I handed that over. My GF decided that she didn’t like that, didn’t say anything and left the table to go talk so a random guy in the bar. \nI was confused and frankly a bit insecure about that. I said to her politely I was uncomfortable with the situation that had developed, and I didn’t like how close they were getting. \n\nShe came back to our table, where two of my mates were sitting, I went to go order a round, I come back and she had invited the guy to sit at our table. In my seat. \nI was understandably quite annoyed and upset by this. \nI politely said to the guy, that’s my seat and that’s my girlfriend. He proceeded to say she won’t be yours much longer and gave her his number. She took it and put in her phone. \n\nI then told the guy he needs to leave and grab his arm. To move him away from the table. (I’m now the bad guy to all my friends and gf) \nMy gf leaves the bar and so does one of my mates, for a cigarette. I go to stroke a puppy cocker spaniel to chill me out 😅 and I look at the window and my gf and my mate is out there smoking with the guy I have been uncomfortable with. I go back to my table. But I can’t contain my anger, I go out side and said “thank you, so much” \n\nThe night then ended in a argument with me and my friends and girlfriend. \n\nWhat should I do?",
            "spoiler": false,
            "stickied": false,
            "title": "Realising my Gf doesn’t respect me",
            "upvote_ratio": 0.91,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjxkcg/realising_my_gf_doesnt_respect_me/"
        },
        {
            "author": "u/BaneWilliams",
            "created_utc": "03-22-2022 07:16:17",
            "distinguished": null,
            "edited": false,
            "id": "tjwfvj",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjwfvj",
            "nsfw": false,
            "num_comments": 26,
            "permalink": "/r/relationship_advice/comments/tjwfvj/my_37m_sisterinlaw_32f_seems_crazy_and_i_dont/",
            "score": 164,
            "selftext": "So some background is required here. Firstly I am Autistic, Bipolar, and ADHD, all medically diagnosed and treated. Because of that ?FUN? combination of mental health issues, I am a very blunt individual, and I don't deal particularly well in social situations that require a delicate touch, which is why I'm asking for help.\n\nI've been seeing my partner (37F) now for coming up to 3 years. She has had a bunch of shit relationships before me, including a messy divorce and a kid (9M) who is on 50/50 split between them. I really like the kid, we get along swell, and I love my partner and want the best for her. My partner has a high pressure job, and unfortunately she also has Multiple Sclerosis. For those that don't know, MS is a hell of an disease with no cure that disables parts of the brain and causes a lot of massive problems.\n\nMy partner has had a rough life. If I'm being honest, so have I... between homelessness and undiagnosed mental issues for much of my adult life, I've been a mess and only recently in the last few years have managed to improve - to where I'm no longer in poverty and can provide if needed. Any given day my partner needs to deal with issues stemming from an abusive ex husband manipulating her kid, trying to provide for the kid and save enough for a house deposit, trying to make it so that way her health issues don't cost her her job, and more.\n\nBetween all this, she manages pretty well. There are some rough days, and some good ones, and plenty of in between. She deals with it as well as I think anyone could.\n\nThen there is her sister. SIL is the kind of person who thinks she is perfect, and has no issues. Part of this has been because whenever she is combatitive to her mother or my partner, they just kowtow to her so that way they avoid the situation without any issue, even if she is clearly wrong. SIL is argumentative, but doesn't like being argued against, and will resort to personal attacks if she fears she is losing an argument.\n\nThis happened for the first time two months ago. She was badgering my partner to drink more water and that the barely flavoured soda waters my partner drunk \"didn't count\". It seemed kind of friendly banter, and me being the autistic person I am, attempted to socialise by joining in. Big mistake. I mentioned that I almost never drink straight water, and hate the taste of it, and I'm very physically healthy. She is a nurse, and this caused the beginning of an argument that I should drink more straight water.\n\nShe asked why I didn't drink water. I mentioned the taste issue I had, and I brought up that historically, mankind has had thousands of years where much of the populace didn't actually drink straight water, and when adjusted for infant mortality rates, they weren't substantially less healthy than we are now. She was quiet for a moment and then bitterly spat out \"Don't mansplain to me!\". I was taken aback - I was just answering a question, and based on previous discussion we'd had, I knew she knew very little about history.\n\nAt first, I thought it was just me being autistic. It happens. sometimes I cause offense in a social situation for being, well, me. I tried to say I wasn't mansplaining and she just went off. \n\nThere was another little blow up a month or so later, but it's not super relevant so I'll share in the comments for completion sake. But needless to say again she was perfectly fine with me, then suddenly hostile, this time saying \"don't try to one up me!\". I swear to you reddit, that was the farthest thing from my mind.\n\nNow Sister is staying with my partner. This is because Sister sold her old place because she wanted to buy a new one, and my partner took her in while she was looking. This is when I started to notice things.\n\n* Sister went to have a working holiday in England. Hospital in England was very willing to have her, just needed a piece of documentation from her University and to get in contact with her nursing org. This required her to send two emails. This lead to days, days of crying, holing herself up in her room, and acting like it was the worlds worst thing. (needless to say she isn't going now)\n* Sister spent time looking at houses, when one she wanted was sold for more than she was willing to spend, same situation - days of crying and holing herself in the room and acting like the world was coming to an end.\n* Sister finally gets a house. Despite all of us telling her to get a building inspector before buying, doesn't.\n* Sister gets the keys to the house, only to find that there is a MINOR issue with one of the sinks plumbing, and the 20+ year old looking garage opener fob doesn't work. Maybe $200 to fix, maybe an hour out of her time, but now she hates the house, wishes she hadn't bought it, can't even rent it out because \"everything is broken and it would all need to be fixed\" days of crying, holing herself in her room.\n\nBasically, if things don't go perfectly her way she gets bitter, angry, or upset. It doesn't matter how minor the inconvenience, it is a major consequence. Even worse, she takes it out on those around her. She forced her mother to be 2 hours late to work, and had my partner take time off work because she made the issues at the house sound so bad so they came to help. They weren't bad.\n\nSo she has blown up at me twice. I don't take that sort of thing well, and tend to push back when pushed against. What's more, there is little that annoys me more than people who have issues and take them out on others and do nothing to improve themselves. I'm really worried that we're going to sit down at a family gathering, she's going to say something to me and I'm just going to verbally tear her a new one. I'm then additionally worried she will then refuse to go to family gatherings and make it a 'him or me' situation.\n\nTo me it seems like she just needs therapy. The fact that my partner has all this stuff wrong with her life yet manages to (mostly) function like an adult, and her sister has everything fucking going for her and still acts like a spoilt pretentious brat the moment something doesn't go her way is frankly, disgusting to me.\n\nI could use help understanding her, so I can empathise... because right now, there is none.",
            "spoiler": false,
            "stickied": false,
            "title": "My (37M) Sister-in-law (32F) seems crazy, and I don't know how to help before I just snap at her.",
            "upvote_ratio": 0.91,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjwfvj/my_37m_sisterinlaw_32f_seems_crazy_and_i_dont/"
        },
        {
            "author": "u/Ernestodelaverga",
            "created_utc": "03-22-2022 01:07:18",
            "distinguished": null,
            "edited": "03-22-2022 01:18:03",
            "id": "tjpy46",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjpy46",
            "nsfw": false,
            "num_comments": 83,
            "permalink": "/r/relationship_advice/comments/tjpy46/my_girlfriend_doesnt_want_me_to_be_in_shape/",
            "score": 204,
            "selftext": "I've lost alot of weight over the years and find myself in very moderate athletic shape. \n\nI met my girlfriend about a year and a half ago. She's on the chunky side to put it bluntly. I still love her. \n\nI go to the gym about 4 or 5 days a week and she always complains I'm at the gym. I always ask to join me to which she rejects.\n\nRecently she tried to make me eat stuff I usually do not eat. Burgers and pizza. I ate them but with moderation.  She complains that I'm trying to show off and started to cry that I want to make her feel bad for being chunky.\n\nThis isn't how I feel and wish she would see this. She said she found me more physically attractive when I was heavier.\n\nI feel like I should run for the hills but I love her.\n\nWhat should i do ?",
            "spoiler": false,
            "stickied": false,
            "title": "My girlfriend doesn't want me to be in shape...",
            "upvote_ratio": 0.95,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjpy46/my_girlfriend_doesnt_want_me_to_be_in_shape/"
        },
        {
            "author": "u/Bookworm8795",
            "created_utc": "03-22-2022 13:04:19",
            "distinguished": null,
            "edited": false,
            "id": "tk1f06",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk1f06",
            "nsfw": false,
            "num_comments": 61,
            "permalink": "/r/relationship_advice/comments/tk1f06/mid_life_crisis_from_a_wifes_perspective_any/",
            "score": 13,
            "selftext": "\nMy Husband is 51 years old and is having a mid life crisis. We have been happily married for fifteen years. A few months ago, he expressed his unhappiness about getting old, his looks, his job, not having achieved all of his life goals and expressed a few minor issues in our marriage. The issues were talked about at length. Our discussion escalated into a row. My Husband then left me for a day. \n\nUpon his return, he said that he had a breakdown and wasn’t sure he wanted to be with me, but that he wanted to work on our marriage. I agreed, although I was still perplexed as I thought we had a wonderful marriage. Don’t get me wrong, we argued from time to time and both said things we didn’t mean, but didn’t argue about anything major enough to break a marriage. \n\nFast forward a couple of weeks and we went out for drinks. My Husband got very drunk and told two separate women how attractive they were, right in front of me. I  cried and wanted to go home, but he ignored me. This was completely out of character. He doesn’t remember any of it, but I do. I feel like a fool and my self esteem has been dented. I’m younger than my Husband and have been told I’m attractive. I know I’m not perfect (who is) but I’m a very good Wife and a nice person. I’ve never cheated, nor would I. I’ve stood by my Husband through it all and continue to do so, but I’m feeling increasingly unhappy. \n\nA mid life crisis can last for many years. My Husband is acting incredibly out of character. He has expressed an interest in making female friends at the gym. He said he gets on better with women. He’s losing weight and taking better care of himself. Which is great! But alarming given everything else I’ve mentioned. He’s spending huge amounts of time on Reddit and social media platforms. He’s always hated social media! \n\nWhenever I confront him about any of the above subjects, he gets mostly defensive and tells me I’m ‘a f****** idiot’ or to ‘shut up’. I don’t recognise my Husband. He’s never been like this. The only reasons he can give me for wanting female friends is due to the pandemic and wanting to make his world a bit larger.\n\nI feel that I’m on an emotional rollercoaster. I love him and want to support and stand by him, but I’m struggling with my self esteem as a result. I feel so very unhappy and can’t seem to get over the fact he left me for no major reason. He now says that he loves me more than ever and never wants to leave me. He said the thought of me being with someone else would break him. He gets very jealous and every time I receive attention, he thinks people are falling in love with me. \n\nAm I supposed to continue being treated this way indefinitely? Can anybody else identify? Thanks.",
            "spoiler": false,
            "stickied": false,
            "title": "Mid life crisis from a Wife’s perspective. Any advice appreciated…",
            "upvote_ratio": 0.89,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk1f06/mid_life_crisis_from_a_wifes_perspective_any/"
        },
        {
            "author": "u/witchypisces",
            "created_utc": "03-22-2022 03:39:11",
            "distinguished": null,
            "edited": false,
            "id": "tjsx4s",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjsx4s",
            "nsfw": false,
            "num_comments": 22,
            "permalink": "/r/relationship_advice/comments/tjsx4s/update_i_f24_moved_2000_miles_away_with_my/",
            "score": 74,
            "selftext": "[PT 1](https://www.reddit.com/r/relationship_advice/comments/tf4ivr/i_f24_moved_2000_miles_away_with_my_partner_m38/)\n\n\\-\n\n I'm still in Arkansas, but not because I chose to stay with him. Spring Break was a thing and travel prices were out of budget no matter who was able to chip in. But I have officially booked my flight home for next Saturday.  \n\n\nHe's at work right now and I haven't told him, but I know it's gonna be rough.  \n\n\nAfter I made that post I honestly wasn't sure what I was going to do. I very seriously considered staying... until about 2 days later when I couldn't shake the feeling there was more. The first night, he said he just had a hard time handling the distance and those things all happened while he was drinking and feeling lonely and lacking judgment, etc. He insisted that all those conversations happened on the same, drunken night. I honestly started to doubt what it was I saw, and he had deactivated his fb so I wasn't sure how to check. But while he was at work the following day I weaseled my way back in and saw it actually dated back to October (we became exclusive in September, per HIS request). And it wasn't just mindless flirting and lousy attempts to hook up. There was one woman in particular (I later found out she's an ex of his) who he was telling he loved. That he adored her. Wanted to try again. And of course, more nudes. And that's when I knew 2 things:  \n\n\nhe never loved me, and even if he did, I could never trust him again.  \n\n\nI let him have it on the phone and he left work early to come home and talk. And strangely once he walked in, I was still upset, but I couldn't scream at him anymore. When I looked at this man, I saw my best friend. He knows more about me than probably anyone. And I never thought I could feel so many things about another human being. I get that I'm young, but my life hasn't been easy by any means. I have never felt safe with anyone the way I felt safe with him, and I never thought I would. I think that's the worst part. This relationship gave me so much faith in the world around me, and I have never felt so disillusioned. It was a \"finish each others sentences\", \"same goals\", \"same quirks\", \"same everything\" kind of relationship. But I understand it's over now and I just can't wait to get home.  \n\n\nHe is paying for my things to be shipped back, and my parents are contemplating billing him for the $700+ they spent on renting a car, as well the hotel/gas/etc.  \n\n\nAnd if anyone cares to know, he isn't being an ass about anything. He promised he wouldn't grovel and make my departure any harder than it already is. But he did express how much he wants me to stay before then. Other than that, we've been going about things as we typically would. Except he has been sorta spoiling me. It's probably a manipulation tactic, I get this, but I can assure you it has changed nothing. I told him I wanted to keep things as amicable as possible because I'm going to have the entire grieving process to eventually hate him and I may as well enjoy AR as much as I can.  \n\n\nThe absolute biggest thanks in the world to every single commenter on here, and those who reached out privately. All your words brought me back to reality every time I started to consider staying with him. You've saved my god knows how much more grief and I am eternally grateful.  \n\n\n\\-  \n\n\ndo I have to tl;dr an update? lol. oh well...  \n\n\ntl;dr: He was cheating even more than I initially thought, and I will 1000% be home in under two  weeks. He is paying for a majority of the trip, as he should.",
            "spoiler": false,
            "stickied": false,
            "title": "[UPDATE] I (F24) moved 2,000 miles away with my partner (M38) just to find out he's been cheating",
            "upvote_ratio": 0.92,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjsx4s/update_i_f24_moved_2000_miles_away_with_my/"
        },
        {
            "author": "u/Expensive-Aside8318",
            "created_utc": "03-22-2022 00:20:00",
            "distinguished": null,
            "edited": "03-22-2022 01:17:34",
            "id": "tjozb9",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjozb9",
            "nsfw": false,
            "num_comments": 194,
            "permalink": "/r/relationship_advice/comments/tjozb9/boyfriend_has_daily_movie_marathons_with_ex/",
            "score": 139,
            "selftext": "Am I (23) completely unreasonable for not feeling comfortable?\n\nBoyfriend(25) works with his ex FWB(19) who he was with the same month we started dating. They work together and he invites her over for movies after work. This means they hang out from 7am - 12am whenever she decides to leave. I'm invited as well but I hate being in the same room as her so usually I just end up crying in my room. \n\nShe told me about 2 weeks before I started dating him that she has a huge crush on him. \n\nFurthermore every week he has a movie night with this girl and another ex(23), the one he dated for a month right before dating me. The 3 of them have a list of movies written out that includes a bunch of chick flicks. I was not a part in making this list. \n\nThe FWB one day decided that they should all play twister which made me very uncomfortable. \nShe left the game on his nightstand \nShe always leaves her hair ties on top of mine \nHer stuff in his room \nAlways shows off how much she knows my bf \n\nThese girls have caused a lot of fights between us \nTo the point that one day he said fine and stopped hanging out with them outside of school and work. \nSince then he's gotten very resentful towards me ruining his friendships and one night decided to take his ex out for a drink because she was going through a rough time and she only has his FWB and my bf as a friend. \nHe says it sucks he can't be there for her when she needs him. \nI went out drinking alone that night as I was sad about how cold he's been treating me \n\nHe came back that night happy again and treating me great. \nFew weeks go by and I find out he's going on a 3 day trip for school with these girls to a big city. \nI've told him I hate the thought of this \n\nHe says it will be his first time traveling without family \nThe part that stings is that experience will be shared with his 2 ex gfs and not me..\n\nThere's a lot more details but I tried to keep it short\n\nEdit: his ex recently told me I should seek professional counseling for not being able to accept their friendship",
            "spoiler": false,
            "stickied": false,
            "title": "boyfriend has daily movie marathons with ex",
            "upvote_ratio": 0.91,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjozb9/boyfriend_has_daily_movie_marathons_with_ex/"
        },
        {
            "author": "u/throwoutacctquestion",
            "created_utc": "03-21-2022 23:10:21",
            "distinguished": null,
            "edited": "03-21-2022 23:18:32",
            "id": "tjng2t",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjng2t",
            "nsfw": false,
            "num_comments": 118,
            "permalink": "/r/relationship_advice/comments/tjng2t/my27f_husband28m_came_out_as_transgender/",
            "score": 162,
            "selftext": "**\\*I am going to use he/him pronouns still in this post bc he specifically asked me not to change to feminine pronouns when talking about him.\\***\n\nMy(27f) husband(28m) came out as a transwoman to me this week. I was proud of him and excited bc I have suspected this for a while and he seemed very conflicted. I was supportive and he was SO happy, I swear he was beaming talking about transitioning.\n\nHowever, he took some time to reflect on how it would affect him religiously and changed his mind. He is very religious and believes if he were to ever transition, he would go to Hell. So he doesn't want to do anything about it. He wants to just move on as if nothing has changed. Have kids sometime in the next year and just keep living our lives. He doesn't want to tell anyone else.\n\nBut I can SEE the misery it is causing him to deny himself. He came out to his mom and she was upset at first but so happy to hear he has no plans to change anything and that he wants to go to heaven.\n\nI can not believe the lengths he is willing to go to in order to go to heaven. I have no idea what to do. I want to be supportive of whatever he wants, but how can I support him in causing himself so much harm and pain? It is killing me.\n\nI love him so so much and want him to live his life authentically and happily. I know this is going to continue to eat him up. I am in the same religion and am now so disgusted that it is making my husband feel that way that I want OUT of it. Which is now making my husband feel even more distressed.\n\nTLDR: Husband is a transwoman but is not going to transition for fear of going to Hell. How do I support him/his beliefs when I disagree???\n\nAny advice is appreciated.\n\n&#x200B;\n\nEdit: I should have included this, but I am bisexual and he is still very much only attracted to women. So when he first came out to me and was planning to transition, we were planning on staying married as a lesbian couple.",
            "spoiler": false,
            "stickied": false,
            "title": "My(27f) Husband(28m) Came Out as Transgender",
            "upvote_ratio": 0.84,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjng2t/my27f_husband28m_came_out_as_transgender/"
        },
        {
            "author": "u/hyoriworks",
            "created_utc": "03-21-2022 18:27:29",
            "distinguished": null,
            "edited": "03-22-2022 02:36:07",
            "id": "tjh2sy",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjh2sy",
            "nsfw": false,
            "num_comments": 151,
            "permalink": "/r/relationship_advice/comments/tjh2sy/should_i_confront_my_bf_about_him_searching_his/",
            "score": 378,
            "selftext": "My bf and i have been dating for 2 years, and it's also been 2 years since he broke up with this ex. We were scrolling on his instagram on his phone together the other day to look at this brand we follow, and when i clicked the search engine to type something in, i saw his ex's profile was at the top of his search history. I panicked (shocked and not wanting to confront it) pressed the back button, came up with an excuse like \"Oh wait i forgot what i was looking for\", and pretended i didn't see it. Later on that day, i got curious and wanted to make sure my eyes weren't playing tricks on me, so i asked to see his instagram again to \"type the account i was looking for earlier\", but when we got to his search, the entire history was already cleared.\n\n\nIt bothers me that he looked her up and makes me feel insecure. Should i confront him about it? Or rather should i be concerned? It feels weird that he cleared his search afterwards too.\n\nEdit: thank you to everyone for your advice and sharing your stories too! I feel like i should clarify what i mean by 'confront' since everyone seems to have a different meaning behind it. When i asked whether i should confront him, i think i meant more like, how do i bring this up or talk about it while trying to make things comfortable between us. In no way am i focusing solely on accusing him or have intent to cause unnecessary drama/harm, (although i know my insecurities can get the best of me, and if anything, i'm just looking for reassurance). I do understand that my post does make my intentions seem otherwise though, so i get why it's confusing! But again thanks so much , i didn't expect so much support and reassurance from everyone.\n\nEdit: i did talk to him and tried to bring it up as casually as i could. He said that he was genuinely curious, and we both laughed about it. I will admit that it did hurt a little (a mix of my insecurities and also knowing their history because he and i are long time friends), but i'm trying to reassure myself that this is normal and he hasn't given me any reason otherwise to doubt what we have now. Thanks again to anyone sticking this long to read this post despite how silly it is lol",
            "spoiler": false,
            "stickied": false,
            "title": "Should i confront my bf about him searching his ex gf on instagram?",
            "upvote_ratio": 0.9,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjh2sy/should_i_confront_my_bf_about_him_searching_his/"
        },
        {
            "author": "u/Momo_jiji",
            "created_utc": "03-22-2022 12:27:50",
            "distinguished": null,
            "edited": false,
            "id": "tk0sy4",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk0sy4",
            "nsfw": false,
            "num_comments": 42,
            "permalink": "/r/relationship_advice/comments/tk0sy4/is_it_a_red_flag_if_someone_has_no_friends/",
            "score": 14,
            "selftext": "And I mean like no real friends at all. They have acquaintances they talk here and there but the one friend they had they had a falling out with",
            "spoiler": false,
            "stickied": false,
            "title": "Is it a red flag if someone has no friends?",
            "upvote_ratio": 0.99,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk0sy4/is_it_a_red_flag_if_someone_has_no_friends/"
        },
        {
            "author": "u/ta_ashamed_confused",
            "created_utc": "03-22-2022 13:18:54",
            "distinguished": null,
            "edited": false,
            "id": "tk1ohn",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk1ohn",
            "nsfw": true,
            "num_comments": 34,
            "permalink": "/r/relationship_advice/comments/tk1ohn/i_f24_accidentally_crossed_boundaries_feeling/",
            "score": 10,
            "selftext": "Hey all\n\n(TW; potentially triggering for consent and sexual harassment, NSFW; mention of sexual activity and bodies) \n\nLast night my partner (M30) and I (F24) were in bed together. We are isolating at the moment as I have covid, but he has managed to not contract it from me yet. We have been together for a bit over a year and have had a pretty good and smooth relationship so far. \n\nAs we lay in bed, I was spooning him and I started running my fingers and nails up his back and neck and down along all of his body. He loves when I do this and often requests it. We are a very touchy/feely couple and have quite an active and healthy sex life. I ran my fingers along his legs and thighs and hip bones, and then over his butt. I regularly touch and compliment his butt, this is something he has always been comfortable with. I was feeling a little horny, sure, but I wasn't sure if he was in the mood or not so I just thought I would touch his body a little and see how he responded. He moaned a little and seemed to be relaxed and enjoying it, but as I went toward his butt and down between his legs or along his underpants elastic he didn't seem receptive so I didn't push anything further. He eventually grabbed my hand and moved it up to his chest and held it. I didn't run my hands over him any more. \n\nThis morning we were talking and he revealed to me that he had felt extremely uncomfortable last night and that I had crossed boundaries, violated his consent and was trying to push him into sex. I was honestly shocked. We have always been very feely with each other and I'm used to running my hands over his body when we are together and vice versa. To clarify, not once did I touch his genitals last night. I didn't want to go to far if I didn't get the sense he was interested and reciprocal. He said that I should've been able to tell by his body language and lack of reception that he wasn't comfortable. But to me, I thought we were just spooning and he was relaxing while I ran my fingers over him. \n\nThe language he used around consent leaves me feeling so ill. This was not my intention at all and I had no idea this touching would make him feel that way, he also did not verbally express this to me last night at all. He told me he was so anxious that he couldn't verbalise it to me at the time. He said he didn't feel like he would be able to say no. I hate thinking that I made him feel this way and I'm just at a loss at how I managed to miss it completely when this touching is something he has always been comfortable with in the past. I am the last person who would want to cross a line with consent and sexual touch, I have my own history of sexual abuse and it is a topic that I am very conscious of. I have been crying all day as I feel so ashamed and uncertain of myself. I think we are okay with each other now, we had a shower together and watched some movies and he's been affectionate and pretty normal with me since. \n\nBut there seems to be an elephant in the room about sex. When he was washing me in the shower I noticed he was careful not to touch my breasts or my butt at all, when this would be normal for us when we shower together. I didn't know where to put my eyes, I felt like I couldn't comfortably look at his genitals or butt or body without making him feel like I was sexualising him. I would usually touch his skin and tell him how gorgeous and sexy I think he is but I feel so uncertain about doing this as I am afraid to make him feel uncomfortable. I can't see our sex life being the same again, how can I try and initiate anything with him without feeling like I'm pressuring him? How can we have a normal consenting physical relationship and I know that he's not just going along with it but actually is uncomfortable. Of course moving forward I will always check verbally for consent more regularly but I don't even picture myself being able to ask without feeling like some kind of predatory deviant. I love him to pieces and I love having sex with him, we have always had very regular, consensual and enthusiastic sex from both sides in the past and this truly feels like it's come out of no where. I feel so out of sorts with him and like I've lost my level of comfort around his body. \n\nTLDR; I unknowingly crossed a line with my partners sexual boundaries last night and now I feel awful and like things will never be the same between us sexually again, when it's always been great before.",
            "spoiler": false,
            "stickied": false,
            "title": "I (F24) accidentally crossed boundaries, feeling uncertain and insecure moving forward with partner (M30)",
            "upvote_ratio": 0.92,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk1ohn/i_f24_accidentally_crossed_boundaries_feeling/"
        },
        {
            "author": "u/Run-Fox-Run",
            "created_utc": "03-22-2022 09:17:50",
            "distinguished": null,
            "edited": false,
            "id": "tjy470",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjy470",
            "nsfw": false,
            "num_comments": 29,
            "permalink": "/r/relationship_advice/comments/tjy470/i_35t_would_like_to_see_other_people_but_my/",
            "score": 18,
            "selftext": "I don't mean like see other people as in date them, or do anything sexual whatsoever. \n\nI mean *see* them in person again.\n\nYou see, ever since the beginning of the pandemic we have been in total household isolation. My husband refuses to compromise our health. Even though we are vaccinated & boosted, and the friends I want to see are too.\n\nSpecifically, I am a runner and I really want to run with a few friends, one-on-one. I don't expect that they will wear a mask while running nor that I'll have to, but if it comes down to that, I'd wear it...\n\nA little more background - we work from home and never go out, never see anyone in our family, and never eat outside of the home. We cook everything at home. We only go out to go grocery shopping and always wear a mask, wash the groceries, and shower and change clothes immediately upon getting home. \n\nI just want to see people again. I miss my friends, and I would love to see them in an outdoor setting on a trail that isn't really crowded or popular.\n\nSince I'm a distance runner and my friends are too, I've accidently run into a few of them on the trails recently and ran a mile or so with one friend, one-on-one. My husband was upset about the risk, but I had the best time being able to see a real friend in person. My friend was so happy to see me too and said he had the most fun he'd had in a while just jogging a mile with me. I was so elevated by this experience and I realized how much I miss other people.\n\nI used to run with a group every weekend before the pandemic, and I loved the social aspect of it.\n\nI have been doing pretty well for over two years of total isolation now. But I'm starting to get lonely. I really want to be able to see people again. Just a couple friends in specific, one at a time, in an outdoor setting, for a few hours at a time.\n\nPlease, what can I say to help convince my husband that the risk is worthwhile to be able to see a few friends occasionally? I get the feeling that he will be totally against it. The risk isn't worth it for *him* because he doesn't get anything out of me being able to run with a friend.\n\nI am just sad, and a little lonely. My friends are excited and *want* to see me, and I want to see them, but my husband has full control of every aspect of my life except when I run out the door. He doesn't allow me to drive and I wouldn't want to have to sneak away to see someone. That seems insidious. \n\nWhat can I do to be able to see people again?",
            "spoiler": false,
            "stickied": false,
            "title": "I [35t] would like to see other people, but my husband [40m] is against it",
            "upvote_ratio": 0.74,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjy470/i_35t_would_like_to_see_other_people_but_my/"
        },
        {
            "author": "u/throwawayact6523",
            "created_utc": "03-22-2022 04:55:00",
            "distinguished": null,
            "edited": "03-22-2022 06:01:34",
            "id": "tju9oo",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tju9oo",
            "nsfw": false,
            "num_comments": 17,
            "permalink": "/r/relationship_advice/comments/tju9oo/managers_talked_about_my_sexuality/",
            "score": 43,
            "selftext": "Info: I’m 20F. I’ve been working at this place for under a month. This job is one of the most relaxing jobs by far. I have worked in fast food in the past and being a cashier and being paid decent money is really nice!. \n\nPatty and I talk just as much as every other cashier talks to one another but Patty and I are getting in trouble for talking to each other. I was pulled aside and put somewhere else. Which I’m fine with, I can just talk to Patty on social media after work and not at work. They told me I can’t talk to Patty anymore or I will get pulled aside and talked to, and that Patty has already gotten in trouble and pulled aside to be talked to. Which I asked Patty during our lunch break if they talked to her and she said no. I told a friend about this and he told me not to get mad but the managers were making assumptions that Patty and I are dating and how it’s weird that Patty hugs me after she gets out of work. \n\nIt makes me very uncomfortable how the managers are making assumptions about Patty and I like that. Like so what if her and I are dating, it should not be their business. Should I bring this up to hr tomorrow?\n\nEdit: I may have confused some people but her and I are not dating. We are just work friends. The most we have done is give each other a one second hug two times and that was when she was leaving. I never thought a hug was weird since I’ve seen my other co workers hug each other.",
            "spoiler": false,
            "stickied": false,
            "title": "Managers talked about my sexuality",
            "upvote_ratio": 0.88,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tju9oo/managers_talked_about_my_sexuality/"
        },
        {
            "author": "u/throwRAmmmeife",
            "created_utc": "03-22-2022 11:15:23",
            "distinguished": null,
            "edited": "03-22-2022 11:26:36",
            "id": "tjzpn0",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjzpn0",
            "nsfw": false,
            "num_comments": 21,
            "permalink": "/r/relationship_advice/comments/tjzpn0/my_husband_keeps_having_messed_up_dreams_about_me/",
            "score": 13,
            "selftext": "Good morning everyone.  I’m 38 (f) my husband is 38 (m). Recently (about  six months ago) he woke up and said he had a weird dream about me, that involved me dying. He’s consistently kept having these dreams for months. In every one I die in a strange, pretty macabre way. In these dreams he’s not doing it to me, it’s more he’s just finding me in these situations. After the second dream I was like ummm after you worried or stressed about something and he was like nope, I’m good. I even asked if he had some phobia of me dying and he said obviously he doesn’t want me to but it’s not something he gets anxiety over. \n\nIt’s just kind of freaky he’s having these dreams so often. I’m not freaked out by the dreams themselves (I love horror movies) nor do I think my husband is plotting my demise and then casually bringing it up in the morning but I would like to see what other people think this might mean. \n\nThanks for reading, I hope I didn’t leave out any relevant info please ask for clarification on anything if needed",
            "spoiler": false,
            "stickied": false,
            "title": "My husband keeps having messed up dreams about me",
            "upvote_ratio": 0.99,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjzpn0/my_husband_keeps_having_messed_up_dreams_about_me/"
        },
        {
            "author": "u/Lonely-Pie6166",
            "created_utc": "03-22-2022 13:20:48",
            "distinguished": null,
            "edited": false,
            "id": "tk1pqb",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk1pqb",
            "nsfw": false,
            "num_comments": 33,
            "permalink": "/r/relationship_advice/comments/tk1pqb/my_wife_gave_me_some_details_about_her_ex_being/",
            "score": 7,
            "selftext": "My wife was in a verbally abusive relationship prior to meeting me. She told me that he told her things like no one would want her and he even once through a stack of papers at her but he missed. She told me that he did things that she never wants to tell me because it's embarrassing. She later said that she will tell me one day but she didn't want to dwell on the things he did. She said that he never got physical with her and that's all I need to know. But I feel like she should be able to open up to me especially since we've been together 13 years and have a child now. I feel like there's a part of her that I don't know and I don't know how to feel about it",
            "spoiler": false,
            "stickied": false,
            "title": "My wife gave me some details about her ex being verbally abusive but she won't tell me more so it caused an argument.",
            "upvote_ratio": 0.77,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk1pqb/my_wife_gave_me_some_details_about_her_ex_being/"
        },
        {
            "author": "u/jdonnally02",
            "created_utc": "03-22-2022 05:15:05",
            "distinguished": null,
            "edited": false,
            "id": "tjuma3",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjuma3",
            "nsfw": false,
            "num_comments": 69,
            "permalink": "/r/relationship_advice/comments/tjuma3/my_boyfriend_told_me_he_would_leave_me_if_i/",
            "score": 29,
            "selftext": "the title speaks for itself. was chatting with my bf and i brought up the hypothetical that if i were to get in an accident that left me disabled, (paralyzed, both arms cut off, whatever) would he leave me. he said yes. he wouldn’t want to be my caretaker for the rest of his life and would want to actually enjoy it. \n\nnow, my answer was the opposite. i told him that no matter what happened to him, i’d stay. because no matter what happens, i still love him for him and who he is and couldn’t imagine my life without him.\n\nhis answer made me think a lot. like if you were with someone and loved/cared about them, wouldn’t you want to stay with them through anything… like am i overthinking this or what. cause maybe he doesn’t love me as much as i do him. :/",
            "spoiler": false,
            "stickied": false,
            "title": "my boyfriend told me he would leave me if i became disabled",
            "upvote_ratio": 0.84,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjuma3/my_boyfriend_told_me_he_would_leave_me_if_i/"
        },
        {
            "author": "u/Longlostneverland",
            "created_utc": "03-21-2022 19:54:09",
            "distinguished": null,
            "edited": false,
            "id": "tjj1wt",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjj1wt",
            "nsfw": true,
            "num_comments": 69,
            "permalink": "/r/relationship_advice/comments/tjj1wt/does_having_sex_make_anyone_else_start_their/",
            "score": 150,
            "selftext": "So I’m not sure why but whenever I do doggy I bleed afterwards sometimes just abit but other times it will start a full period lasting Like 5 days. It’s only ever in this position so I’m not sure why. It isn’t painful or anything sometimes in doggy my stomach feels a little sore and weird so maybe it’s going in to deep? I’ve never met anyone else who this has happened too. Can anyone on here relate and tell me what I’m doing wrong",
            "spoiler": false,
            "stickied": false,
            "title": "Does having sex make anyone else start their periods?",
            "upvote_ratio": 0.9,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjj1wt/does_having_sex_make_anyone_else_start_their/"
        },
        {
            "author": "u/bunniidere",
            "created_utc": "03-22-2022 12:32:20",
            "distinguished": null,
            "edited": false,
            "id": "tk0vk1",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk0vk1",
            "nsfw": false,
            "num_comments": 10,
            "permalink": "/r/relationship_advice/comments/tk0vk1/boyfriend_talks_about_me_in_his_sleep/",
            "score": 7,
            "selftext": "My boyfriend has given me special nicknames during our relationship, and for some reason sometimes while he’s sleeping he uses those names. (ie: said (nickname) i love you. (Nickname) stop tbagging me) it sounds like he’s dreaming about me or something but if i ask he’s like no?\n\nIs there a reason for this 😭 i think it’s cute but I’m genuinely curious because it freaks me out sometimes when he mentions me and is deadass asleep",
            "spoiler": false,
            "stickied": false,
            "title": "Boyfriend talks about me in his sleep",
            "upvote_ratio": 0.9,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk0vk1/boyfriend_talks_about_me_in_his_sleep/"
        },
        {
            "author": "u/Top-Exit-7215",
            "created_utc": "03-22-2022 13:17:23",
            "distinguished": null,
            "edited": false,
            "id": "tk1njl",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk1njl",
            "nsfw": false,
            "num_comments": 12,
            "permalink": "/r/relationship_advice/comments/tk1njl/my_dad_is_getting_remaried_and_my_mom_is_very/",
            "score": 6,
            "selftext": "Hello yesterday my dad tod me he is gettig remaried to his fiancee next week. He told everyone in the family and my mom is freaking out, like talking abount me not being her son if I go. I want to support my dad but i dont want to ruin my relationship with my mom. I also dont want to worsen up my reltionship with my dad or his fiancee. Any advise on how could I proceed talking with my mom?",
            "spoiler": false,
            "stickied": false,
            "title": "My dad is getting remaried and my mom is very angry about it",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk1njl/my_dad_is_getting_remaried_and_my_mom_is_very/"
        },
        {
            "author": "u/ThrowAwayqwqwe322",
            "created_utc": "03-22-2022 04:11:47",
            "distinguished": null,
            "edited": false,
            "id": "tjtih7",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjtih7",
            "nsfw": false,
            "num_comments": 51,
            "permalink": "/r/relationship_advice/comments/tjtih7/i_37m_fed_up_with_my_wife_31f_i_feel_so_lost/",
            "score": 35,
            "selftext": "Before we met I woke up every day at 5 am. I ate extremely healthy and ran between 35-50 km every week. I work as an engineer and I had my own house, car and at least $30k in savings.\n\nToday I am out of shape. Some days I don't eat. Other days I eat garbage food from fast food stores. My pay is top 1% in my country, but at the end of every month I have $0 in my bank account. Basically I wake up, clean the house, go to work, come home to a mess of a house, entertain my toddler till she sleeps, get up and watch a bit of TV before sleeping on the couch or going back to bed.\n\nMy wife doesn't work or study, and I have given up trying to encourage her to get off instagram and work or study. I am in a zombie mode, where I don't feel anything. I literally feel nothing. All I do is work and listen to my wife complain about how hard and unhappy her life is...\n\nIs it too much to expect my wife to keep a clean house, cook and do the laundry most days while she is unemployed and not looking for work?\n\nIf it wasn't for my 3 year old, I would leave her in a heart beat, but instead I am up at 4 am writing on reddit. The house is a mess and I have decided to stop doing anything around the house, except during weekends and completely ignore my wife when she starts ranting about her doing everything...\n\n:(",
            "spoiler": false,
            "stickied": false,
            "title": "I [37M] fed up with my wife [31F]. I feel so lost...",
            "upvote_ratio": 0.83,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjtih7/i_37m_fed_up_with_my_wife_31f_i_feel_so_lost/"
        },
        {
            "author": "u/teddpole",
            "created_utc": "03-22-2022 13:12:28",
            "distinguished": null,
            "edited": false,
            "id": "tk1kd1",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk1kd1",
            "nsfw": false,
            "num_comments": 7,
            "permalink": "/r/relationship_advice/comments/tk1kd1/as_i_am_ageing_i_am_feeling_more_and_more/",
            "score": 6,
            "selftext": "I can see my relationships rotting away if I take stock of my life for the past 10 years or so. I am in my late 30s and have this growing sense of powerlessness. Despite my cordial relationships with my colleagues, I can see them struggling to find chink in my armor. My relationship with my bosses has always been very transactional. My wife, though very loving, will shy away from discussion if I show my vulnerabilities. As long as I am a functioning husband and her lifestyle is not at risk, she is ready to play her role of loving wife. My siblings are there only because I have been calling them and trying to keep in touch. None is there who actually roots for me; encourages me for my potential. All see me as a provider or someone they rely on. I feel this immense pressure building up and I just feel like dropping all things under mounting family and career pressure. What's in it for me after all? If their happiness or support is conditional to my suffering why do it? \n\nThis realization is making me bitter day by day and is seriously affecting my relationships with everyone. I feel alone and depressed most of the time. I don't know who to ask for all this and share my fears. How can I stop and revert this from happening? What mindset change should I make that may make me overlook such pains and be more positive?",
            "spoiler": false,
            "stickied": false,
            "title": "As I am ageing, I am feeling more and more powerless as I see all my relationships are based on some needs.",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk1kd1/as_i_am_ageing_i_am_feeling_more_and_more/"
        },
        {
            "author": "u/Avaxo20",
            "created_utc": "03-22-2022 14:09:50",
            "distinguished": null,
            "edited": false,
            "id": "tk2nsx",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2nsx",
            "nsfw": false,
            "num_comments": 3,
            "permalink": "/r/relationship_advice/comments/tk2nsx/so_traumatised_from_my_last_relationship_its/",
            "score": 5,
            "selftext": "I’m a (32f) I was in a toxic/abusive relationship for 8 years. He cheated on me multiple times, gave me herpes&chlamydia after the first time he cheated and I think I stayed mainly because of the herpes (I had a negative mindset towards it) he strangled me a couple of times when he was drunk, pushed me off the bed onto the bedside table when I took his phone as a joke. He was a alcoholic, drink always came first and this is the icing on the cake…before we met he had a partner and 2 children, they split and we got together she wouldn’t let him see his kids for 6 years, after 6 years she finally let him see them on and off, me and my ex then split and I find out he had been sleeping with his ex for the last 2 years of our relationship. This woman took his children for 6 years and he still went back slept with her. Yes I’m aware this is my fault too for staying with him. But that just about killed me. \n\nI was then single for a year and off men completely, I just didn’t think I had it in me to go through that again. \n\nBut then I met someone and I fell in love, he treats me so well, he shows me he loves me, he reassures me when I need it but in my mind it is hell, all I can think is he’s going to do the same (he also has a child) and in the back of my mind all I can think is he’s going to do the same or he’s going to turn any moment from the amazing guy he is too a stranger that just wants to hurt me at any second. I constantly question if he’s genuine about his feelings, I question if he’s love bombing me or being general. It’s bringing out my toxic traits, I feel like I’m self sabotaging because I then start thinking of the ways he could hurt me and how maybe I should end things so that I don’t get hurt. \n\nI’m finding it’s all I can think about when I’m at work (I work pretty much by myself so that’s 6 hours with my own thoughts) and I feel like it’s effecting my performance at work. I’ve even cried there a few times because I’m in my own head. \n\nI hate that when I’m thinking about being insecure that I think of my ex and he’s why I’m so insecure and terrified everyone is the same. Because I don’t want him in my head, I have however noticed that I never think of the good times it’s always the bad ones. And I don’t cry because of what he did to me, I cry because of how it’s effecting what could be the best relationship. \n\nI can’t go through my relationship paranoid of my new partner and his child’s mother just because of what my ex did to me but I don’t know how to get past it. \n\nI thought I was ready for a relationship but I’m not sure that’s the case anymore. \n\nI would like to work on it and stay with my partner but I don’t know how.",
            "spoiler": false,
            "stickied": false,
            "title": "So traumatised from my last relationship it’s effecting my new relationship.",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2nsx/so_traumatised_from_my_last_relationship_its/"
        },
        {
            "author": "u/flatchleyfub07",
            "created_utc": "03-22-2022 06:46:48",
            "distinguished": null,
            "edited": false,
            "id": "tjw0hs",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjw0hs",
            "nsfw": false,
            "num_comments": 34,
            "permalink": "/r/relationship_advice/comments/tjw0hs/my_boyfriend_refuses_to_throw_his_used_condoms_in/",
            "score": 18,
            "selftext": "My (19f) boyfriend and I (19m) always have sex at my place because he lives with his parents and it's always a lot going on there. \n\nAfter every time, he ties the condom up and take it with him. I've told him he could just throw it in the trash, but nope. I kept asking him why and he always just brushes it off, but finally I got him to say “I just feel better knowing it's discarded” which I then told him the trash is fine, and he again brushed that option off.\n\nI mentioned it to his brother, then I got the truth. Apparently my boyfriend walked in on a girl he was with, with his discarded of condoms more than once. My friends think this is some really weird MRA level paranoia and I agree. \n\nAny advice on what to do about it?",
            "spoiler": false,
            "stickied": false,
            "title": "My boyfriend refuses to throw his used condoms in the trash",
            "upvote_ratio": 0.88,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjw0hs/my_boyfriend_refuses_to_throw_his_used_condoms_in/"
        },
        {
            "author": "u/StubblesTheClown",
            "created_utc": "03-22-2022 08:46:33",
            "distinguished": null,
            "edited": false,
            "id": "tjxp59",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjxp59",
            "nsfw": false,
            "num_comments": 13,
            "permalink": "/r/relationship_advice/comments/tjxp59/update_he_kicked_me_out_when_i_asked_to_see_a/",
            "score": 14,
            "selftext": "So my last post didn’t get too many replies but I still wanted to write an update since I love reading all your updates myself. I’m hurting so hard I had to go home and write this. \n\nSo tl;dr is that i was pretty suspicious of my boyfriend (47M) for the way he was acting about his ex girlfriend, Nancy. It had been an issue since early on due to him getting drunk and emotional about her. My other friend Sam said she knew they had been hooking up in secret while we were on a break. When he and I were hanging out again and talking about getting back together, I asked him about Nancy and He denied anything happened but was acting super weird about it. I asked to see his last texts to her, if their relationship was so platonic and he had an unusual reaction and kicked me out of his house. \n\nNow I know why! They had hooked up but he went even further than I thought he would. I saw the texts. He started telling her things like she was the one, talked shit on her boyfriend, said that she got his hopes up of them getting back together, said how upset he was that she didn’t want to, and get this: that he wanted to fucking marry her!!!\n\nSo I found out cause I borrowed his laptop for work and his text app was getting notifications. As an added bonus, right above his texts to his ex was his last text to his coworker, who I’m friendly with, saying “you’re so beautiful 🖤” she had sent him a selfie of herself in bed. \n\nTurns out she was also an on again off again fuck buddy! They both claim they stopped when we started dating. But on our break, They also hooked up and apparently cuddled and watched movies. He told her via txt how much fun he had with her, that she was the best and that he loved her. \n\nI checked the time stamps and they were when he was writing me emails about being in love with me and wanting to be with me forever.  Wtf.\n\nI’m now home, numb, and wondering what the fuck just happened and what to do next. At first I thought some of the PMs commenting on my first post were kinda harsh (in a good way) but turns out you were all right. I’m hurting so bad right now, crying again over this mess and he’s here texting me this about his ex:\n\n“I’m sorry you saw that. I only said I wanted to marry her because I was drunk and sad about you.”\n\nTl;dr Ya’ll cracked the case again. He was lying. \n\n__________________________\nHe (47M) has an ex girlfriend that he once cried to me about when he was drunk and I’ve (33f) secretly suspected he had lingering feelings since then. They never used to hang out though, just cordial exes i thought, so it wasn’t much of an issue. I said just stop texting her that you miss her and her dog and go back to no contact?\n\nWe took a break two months ago because he kept having bad drinking episodes. He has thrown things at me, flipped tables, smashed vases, etc. so I broke things off and said sobriety would be the only thing that would make me consider coming back.\n\nSo he hasn’t drank for one month which isn’t long but I appreciated the effort and we started hanging out again.\n\nWhile we were separated, my friends saw him leaving a bar after it closed with this ex. This girl and I have a mutual friend in common and this friend told me she thinks they’ve been sleeping together after a series of texts about how she feels “guilty” for seeing him since she has a bf.\n\nHe claims she was looking for him on her birthday and called him around midnight and he went over to have drinks with her. Then he says they also went to lunch another day. I found it weird that we broke up and he immediately went back to talking to her like that \n\nthen yesterday the fight was about why she had to come over to his house to help him sign up for health insurance?  I found that weird as a grown man he needs this girl to do that for him. He said they just hung at his place for a while and I asked if anything happened and his response was “she has a boyfriend.”I said I want to see the texts arranging that meet up because it sounds so sus to me! And he refused. Then he kicked me out of his house.\n\n\nWas it over the line for me to ask to see the texts? I could have snooped but I have always respected his privacy. He acted like I was insane and we haven’t spoken since.\n\nWe break up and get back together every few months and it’s taking a toll on me mentally. He did manage to make me feel like I’m controlling and jealous though. Is it even worth salvaging?\n\nTL;DR Boyfriend (47) of a year got really upset I (33f) wanted to see his texts with his ex and kicked me out of his house.",
            "spoiler": false,
            "stickied": false,
            "title": "UPDATE: He kicked me out when I asked to see a text thread with his ex girlfriend.",
            "upvote_ratio": 0.94,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjxp59/update_he_kicked_me_out_when_i_asked_to_see_a/"
        },
        {
            "author": "u/thcrapster",
            "created_utc": "03-21-2022 15:31:40",
            "distinguished": null,
            "edited": "03-21-2022 22:58:49",
            "id": "tjd575",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjd575",
            "nsfw": false,
            "num_comments": 186,
            "permalink": "/r/relationship_advice/comments/tjd575/gf_19f_keeps_acting_like_its_her_duty_to_check/",
            "score": 314,
            "selftext": "Edit: okay, my inbox blew up, a lot of people responded. I’ll be reading all of them, but I can’t possibly reply to all.\n\n**UPDATE**: I talked to her, she said she’d been feeling anxious and that she saw a few stuff on TikTok that made her think that way. She promised to try and stop, and I promised to always be open to her (as if I already wasn’t, but I said it anyways to get it over with). If the relationship doesn’t get be better, I’m leaving her, no matter how much I like her.\n\nOtherwise, I love her, but this is getting annoying.\n\nIf I put my phone face down, she’ll be like “oh, you’re cheating on me? Is that how it is”, and I’m just putting it down out of habbit because I’m at the dinner table and I don’t want food to get on it, and it’s not that big of a deal, it’s just how I was holding it.\n\nAnd I’d be sitting down, browsing Reddit mostly, and she comes up from behind me, snatches my phone, and starts looking at my photo albums and messages, and all she finds is a few funny prank or hank green or marvel stuff TikToks, then she checks my hidden album expecting to find porn or whatever, and she does find porn, my cigar collection anyways, those I smoke and take pictures of. I’m not cheating on her, but she keeps thinking that I will. And so what if I had porn? As if she doesn’t. And if I change my passcode, she’ll spend an hour arguing and the next few days giving me the silent treatment, same if I turn on do not disturb (which is turning on automatically because of the update, not that I’m complaining about it).\n\nIt feels silly to drop the relationship because of this, but I’m feeling as if I’m living with my mom again, but at least my mom only checked my phone when she had valid reason to suspect something (like replying to spam mail, or doxing her, and I’ve only done the first).",
            "spoiler": false,
            "stickied": false,
            "title": "Gf (19f) keeps acting like it’s her duty to check my(19m) phone daily",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjd575/gf_19f_keeps_acting_like_its_her_duty_to_check/"
        },
        {
            "author": "u/ThrowRArope12",
            "created_utc": "03-21-2022 07:43:20",
            "distinguished": null,
            "edited": "03-21-2022 16:44:56",
            "id": "tj5gn8",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tj5gn8",
            "nsfw": false,
            "num_comments": 148,
            "permalink": "/r/relationship_advice/comments/tj5gn8/there_is_a_drunk_girl20sf_maybe_in_my_room_what/",
            "score": 1262,
            "selftext": "So I was at a club with my friends drinking and all. We met a group of girls, we danced, it was fun.\n\nSome of my friends went away with a few of the girls and few of us were left. And then I begin to chat with this girl from that group.\n\nShe is very drunk and very flirty and as we talk she asks if I wanna take her home. This was very new to me, cus this was the first time a girl at a club seemed interested at me. So me being an idiot didn't take in consideration she was drunk took her back to my place. Well I was getting freshen up and when I came back out she was passes out on the bed.\n\nI tried to maybe wake her up so she could go back but she is down.\n\nNow Im panicking a little, cus I dont know what to do here. Do I just leave her alone? Do I try to call her friends or family to pick her up? Do i call the cops. Did I do anything wrong? Please tell me what I should do now and maybe in the future so this doesnt happen again.\n\nUPDATE :\n\nSo I put her on her side with some pillows, water, A trash can and A note explaining what happened.  Then I shot a text to my friends who did go with girls from her group but they havent responded yet. Few mins later I went to take a nap on the couch and woke up about 10mins ago.\n\nI will go call them now hoping they are fking awake. Thank You all.\n\nFinal UPDATE :\n\nIm happy to report that things went smoothly. She woke up and came out of the room with the note, didnt puke but drank the water, used the bathroom and then called her friends to pick her up. None of my friends read the text or calls yet so Im assuming they are in a fkin coma. She was quiet and I didn't bring up anything about last night. Her friends then picked her up and she left. Im glad it went smoothly, Thanks for all your help",
            "spoiler": false,
            "stickied": false,
            "title": "There is a drunk girl(20sF maybe) in my room, what the fk do I(21M) do now?",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tj5gn8/there_is_a_drunk_girl20sf_maybe_in_my_room_what/"
        },
        {
            "author": "u/Geeinmeesh",
            "created_utc": "03-21-2022 23:28:34",
            "distinguished": null,
            "edited": false,
            "id": "tjnudd",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjnudd",
            "nsfw": false,
            "num_comments": 61,
            "permalink": "/r/relationship_advice/comments/tjnudd/boyfriend_unknowingly_talked_to_my_friend_on_a/",
            "score": 68,
            "selftext": "My boyfriend and I were in a long distance relationship for couple of years and it was great. He's 15 years older than me but it was no big deal. My friend showed me screenshots of him on the dating site and his messages to her. He didn't know she was my friend but doesn't matter. She talked to him a little to find out more information, he's been on the site for 2 months. \n\nAfter I confronted him, he blamed me not being there as an excuse for his cheating. I said why do long distance relationship then, he said he loved me. We broke up days later. \n\nAny advice?",
            "spoiler": false,
            "stickied": false,
            "title": "Boyfriend unknowingly talked to my friend on a dating site.",
            "upvote_ratio": 0.82,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjnudd/boyfriend_unknowingly_talked_to_my_friend_on_a/"
        },
        {
            "author": "u/shad0wmoon",
            "created_utc": "03-21-2022 19:04:44",
            "distinguished": null,
            "edited": false,
            "id": "tjhx69",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjhx69",
            "nsfw": false,
            "num_comments": 106,
            "permalink": "/r/relationship_advice/comments/tjhx69/i_just_want_to_workout_not_talk_at_the_gym/",
            "score": 150,
            "selftext": "About 6 to 8 months ago a guy(m46single) started talking to me(f49married) at the gym. I mostly do treadmill workouts. He will use the machine next to mine. If I say I’m doing a certain workout he’ll tell me to go ahead but, he will still stay on the treadmill next to mine.( I find it to difficult to run when this happens)\nAt first I was flattered ( my husband was made aware). I learned a lot about this person and he isn’t a person I want to be associated around. Sometimes these conversations cross boundaries which make me feel uncomfortable. \nI also find this talking time is taking away from my workouts. I really just want to listen to my phone and not talk anymore. I can’t change gyms or times because of work. How can I make this happen? I don’t want to hurt anyones feelings   I truly just want to be left alone. I know I should not care but ,I do. Any suggestions on getting away from him? I thought about saying I was training for a road race that’s important to me but I hate lies. I feel he might also take this as an invite to\n”train too”. I just wish things could go back to before I started talking to him.",
            "spoiler": false,
            "stickied": false,
            "title": "I just want to workout not talk at the gym",
            "upvote_ratio": 0.91,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjhx69/i_just_want_to_workout_not_talk_at_the_gym/"
        },
        {
            "author": "u/j_tudordabs",
            "created_utc": "03-22-2022 05:49:09",
            "distinguished": null,
            "edited": false,
            "id": "tjv5e5",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjv5e5",
            "nsfw": true,
            "num_comments": 24,
            "permalink": "/r/relationship_advice/comments/tjv5e5/choking_during_sex/",
            "score": 21,
            "selftext": "(23M) Not sure if this is exactly the right place to post this, if not please let me know where I should. So for a while now, the girls I’ve been dating, increasingly have all asked me to choke them during intercourse. And while I’m not one to deny someone’s wants during this time, I have an extremely uncomfortable feeling while doing this or even just thinking about doing the act (It may help to put into perspective I’m a very big person, 6’3”, 220lbs, etc.) I’ve had some trauma dealing with me hurting people when I was young, as well as witnessing a lot of domestic violence between my parents, and I’m wondering if this is maybe something I should explain beforehand? Or is there maybe a way I could genuinely avoid this?\n\ntl;dr: I have a problem putting my hands on a woman to choke her during sex, and don’t know if this is trauma I should be looking to work through, or if this is a normal thing for a guy to be nervous about?",
            "spoiler": false,
            "stickied": false,
            "title": "Choking during sex?",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjv5e5/choking_during_sex/"
        },
        {
            "author": "u/Throwaway638511",
            "created_utc": "03-22-2022 12:20:40",
            "distinguished": null,
            "edited": false,
            "id": "tk0osi",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk0osi",
            "nsfw": false,
            "num_comments": 23,
            "permalink": "/r/relationship_advice/comments/tk0osi/every_argument_with_my_husband/",
            "score": 6,
            "selftext": "Him: You did this thing that upset me\n\r\nMe: I'm sorry about that. Here is my perspective on the situation.\n\r\nHim: I don't want to hear your perspective.\n\r\nMe: I think it's important that we both understand each others perspective.\n\r\nHim: Just apologise.\n\r\nMe: I opened with my apology and, again I am sorry. Please can you acknowledge that you also could have done things differently. We both did things we could have done better, not just me?\n\r\nHim: Fuck off! I can't believe you won't just apologise. You have no awareness of the impact of your actions.\n\r\nMe: Again, I am sorry.\n\r\nHim: You always think you are right and can never back down.\n\r\nMe: I apologised\n\r\nHim: it doesn't count, because you tried to make it my fault \n\r\nMe: I'm not trying to make it your fault. I admit I did some things wrong and I could have done better, and I am sorry. You have upset me too though and I would just like you to acknowledge my feelings too.\n\r\nHim: You are selfish and can't admit when you are wrong.\n\r\nMe: ...\n\r\n\r\nEvery single dispute is about him exerting his dominance over me, and me submitting to subservience. If I try to point out anything from my perspective he escalates and escalates and escalates, threatening increasing consequences, until I revert to full subservience and meekly agree everything is entirely my fault, as always.\r\n\r\n\r\nI can count on one hand the number of times he has apologised or admitted he could have done something differently. Each of those occasions has immediately been followed with extensive gloating about how magnanimous he is and how that is how I should behave, and how I should learn from his example. The only reason he ever apologies is to score points.\r\n\r\n\r\nWe never have any argument where he genuinely wants to resolve the situation fairly. It is always an exercise in him asserting dominance. This is where I go wrong in my approach. I try to have a shred of self respect and articulate the situation as I see it. This assumes I am in discussion with someone who wants to resolve the issue with the best outcome for everyone involved, just as I do, with give and take on bkth sides. That isn't his goal though. His goal is to get me to acknowledge my disobedience / lack of appropriate subservience / arrogant assertion of a difference of opinion, and to apologise for stepping out of line.\r\n\r\n\r\nAs long as I can remember how he views my role in the relationship. That is one of complete subservience, then I can largely avoid disputes. Sometimes he pushes that dynamic to an outrageous extreme, and what is left of my dignity forces me to push back a little. He gets horribly offended by any disobedience on my side, any expression that I would like to do things differently than how he wants. It makes him upset. This is what leads to the argument above. Then I am force to either argue my point about how I think we both could do something better in the situation, or abandon my dignity and tell him what he wants to hear. Say \"yes, it's all my fault. I'm sorry I was out of line. You did nothing wrong\".\r\n\r\n\r\nHow did I get myself into this life? I know he loves me. He shows me love, looks after me. Takes an interest in my wellbeing. It can be lovely. Just as long as I am obedient and don't disagree with him on anything.\r\n\r\n\r\nRecent example:\r\nI caught covid. I isolated myself in the guest room and suggested he leave me be in there. The problem was the gaming PC was in there. He spends the whole weekend gaming whilst I am in bed in the same room. I offer to go to a different room but he doesn't want me spreading my germs to the rest of the house. We open windows, run the air filter, and he requests we both mask up. I mostly wear my mask, but my breathing is tight due to infection and the mask is making my breathing more difficult. I tell him and again suggest we keep to separate rooms. He insists it will be fine, just keep the mask on. I do my best but take it off some of the time for some relief. He catches covid from me and goes of on a verbal tirade about how I don't care about his health and how I hope I'm happy now that I selfishly gave him covid. I apologise for giving him covid and for not wearing the mask more. I remind him that I was finding the mask uncomfortable and I offered to stick to separate rooms. That isn't a good enough apology for him. I should have just kept the mask on. I have no respect for him, his health, his feelings. I should apologise unreservedly. I apologise unreservedly but it is too late now. I tried offering my perspective on the situation and that shows an unforgivable lacking of subservience. I'm in the doghouse until whenever...\r\n\r\n\r\nOf course this is just my perspective. I know that from his perspective I am just having a fit of selfishness and I need to snap out of it, apologise and move on. Maybe he is right?",
            "spoiler": false,
            "stickied": false,
            "title": "Every argument with my husband",
            "upvote_ratio": 0.72,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk0osi/every_argument_with_my_husband/"
        },
        {
            "author": "u/Luckymoney20",
            "created_utc": "03-22-2022 14:25:57",
            "distinguished": null,
            "edited": false,
            "id": "tk2z05",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2z05",
            "nsfw": true,
            "num_comments": 8,
            "permalink": "/r/relationship_advice/comments/tk2z05/stressed_partner/",
            "score": 4,
            "selftext": "Husband of 6 years always truthful about places he goes well st Patrick’s day comes along he didn’t tell me his plans I figure him and his friends might attend a strip club I’m okay with him going even though it bothers me long as he is truthful well I see on his location he was at a swingers club lied to me about it we got into arguments I’m still upset and hurt about it and not being unfaithful  and when he lied  even though I caught him and I don’t want him to go swingers club that is more emotional then a strip club at least in my eyes :please read all of the story",
            "spoiler": false,
            "stickied": false,
            "title": "Stressed partner",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2z05/stressed_partner/"
        },
        {
            "author": "u/Ordinary_Menu3691",
            "created_utc": "03-22-2022 14:25:32",
            "distinguished": null,
            "edited": "03-22-2022 14:36:28",
            "id": "tk2yoo",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2yoo",
            "nsfw": false,
            "num_comments": 5,
            "permalink": "/r/relationship_advice/comments/tk2yoo/update_my_bf_got_into_an_accident_and_i_dont/",
            "score": 4,
            "selftext": "https://www.reddit.com/r/relationship_advice/comments/ti98cq/my_bf_got_into_an_accident_and_i_dont_think_i_can/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf this is the original post. \n\nHey guys. I apologize for not using too many paragraphs. I was emotional and kind of ranting earlier. \n\nThings ended up taking a turn for the worst. My bfs head injury caused his brain to swell and he is under a drug induced coma. He’s stable as of now and I have no idea when he will be waken up. His brother (who is 18) is sending me updates about once a day which is less than I’d like but it’s what I get. His mom hasn’t reached out to me despite me trying a few times, I don’t want to stress her out more. I spoke to her once and she said he can’t have visitors right now, he’s stable, and hasn’t reached out to me since. That was about 2 days ago. \n\nI have been having a lot of anxiety but am trying to keep busy and keep myself thinking positively for him. It’s been almost 3 days that he’s been sleeping. There hasn’t been signs of the swelling decreasing. I’ve trying to send positive thoughts and energy to him. I’ve been sending him text or video messages throughout my day so he can know once he’s awake that I’m thinking of him and that I am not there physically but am in other ways. I’ve been trying really hard not to break down but it’s been tough. I’ve had 2 dreams of him waking up and telling me he’s okay. It’s only a matter of time before he can actually.  say that to me\n\nHe’s always told me I need to be more positive so I’m trying really hard. If anyone has any experience with this please give me some hope. If anyone knows about sending him positive energy in his sleep please let me know too. Thank you guys for all your messages. I feel bad even thinking of breaking up with him and what I want to do now is propose as soon as he’s awake. He’s not a bad guy. He loves me and he’s always been there for me no matter what. We’ve been tested by the universe many times and have passed every single one.\n\nEdut: [og post](https://www.reddit.com/r/relationship_advice/comments/ti98cq/my_bf_got_into_an_accident_and_i_dont_think_i_can/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
            "spoiler": false,
            "stickied": false,
            "title": "UPDATE: my bf got into an accident and I don’t think I can keep dating him",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2yoo/update_my_bf_got_into_an_accident_and_i_dont/"
        },
        {
            "author": "u/Duriannn",
            "created_utc": "03-22-2022 14:24:49",
            "distinguished": null,
            "edited": false,
            "id": "tk2y6h",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2y6h",
            "nsfw": false,
            "num_comments": 2,
            "permalink": "/r/relationship_advice/comments/tk2y6h/m20_my_girlfriend_f19_goes_on_online_chatrooms_a/",
            "score": 4,
            "selftext": "Do you guys get uncomfy when your partner goes on online chatrooms like ome.tv , omegle, etc.?\n\nIs that okay? or is that something else?",
            "spoiler": false,
            "stickied": false,
            "title": "[M/20] My girlfriend [F/19] goes on online chatrooms a lot and I don't know if that's fine or something?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2y6h/m20_my_girlfriend_f19_goes_on_online_chatrooms_a/"
        },
        {
            "author": "u/Final_Preference_434",
            "created_utc": "03-22-2022 07:35:52",
            "distinguished": null,
            "edited": false,
            "id": "tjwq60",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjwq60",
            "nsfw": false,
            "num_comments": 12,
            "permalink": "/r/relationship_advice/comments/tjwq60/update_to_we_are_in_open_relationship_but_i_fell/",
            "score": 15,
            "selftext": "OP Post-[https://www.reddit.com/r/relationship\\_advice/comments/tih2ok/we\\_are\\_in\\_open\\_relationship\\_but\\_i\\_fell\\_in\\_love/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/relationship_advice/comments/tih2ok/we_are_in_open_relationship_but_i_fell_in_love/?utm_source=share&utm_medium=web2x&context=3)\n\nUpdate- My gf and I had a long talk after I made the post, the kind of talk we should have had when the topic was first brought up but whats done is done. I asked her if she can be really happy in a closed relationship or is she just saying it to stop our relationship from imploding? She very confidently said yes and then I asked her why the open relationship? Well she was very interested in the dom/sub dynamic but since in the bedroom I am more of a giver (as in I prioritize her pleasure) she thought I wont be open to be her dom. Also she has some internalized shame for her desires because of which she didnt want me to look at her any differently if I knew the real her. We clearly dont have that good of a communication as we thought. But the gist is that we have decided to stay together and do some couples counselling because we clearly need it. \n\nAs for my other partner I informed her that I have chosen to stay with my gf and we cant meet or have any kind of contact ever again. I apologized to her too. And lastly you might ask just whom do I love? Well the thought of my gf not being in my life was much more painful than the thought of breaking up with my other partner. I owe it to myself to try and make a new relationship with my present gf. And yes, I have decided to learn more about dom/sub stuff too. Lets see. Thank you to everyone who commented and gave advice.",
            "spoiler": false,
            "stickied": false,
            "title": "Update to We are in open relationship but I fell in love with someone else",
            "upvote_ratio": 0.75,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjwq60/update_to_we_are_in_open_relationship_but_i_fell/"
        },
        {
            "author": "u/ThrowAwayFloofurr",
            "created_utc": "03-21-2022 17:31:59",
            "distinguished": null,
            "edited": "03-21-2022 18:24:07",
            "id": "tjfu45",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjfu45",
            "nsfw": false,
            "num_comments": 76,
            "permalink": "/r/relationship_advice/comments/tjfu45/sister_27f_ghosted_all_her_friends_after_she/",
            "score": 188,
            "selftext": "My sister \"Katie\" and I have a circle of friends that include some relatives and some non-relatives. Think a close-knit Italo-American family. We all went to school together and have remained close until Katie just up and ghosted everyone. She disappeared from everything, made her IG private, blocked people, and stopped responding to their texts. I knew what was up, but they didn't. It's a huge fucking problem.\n\nThe backstory is that one of our cousins was dating a guy named James. She is never happy in any relationship and can find fault with anything. She was dating \"James\" who seemed great, but she found fault with everything. It was clear she was going to pick this relationship apart and destroy it like every other one by being toxic. He was too nice and tried to fix things, but it just wasn't going to work. They dated like \\~5 months, but the last month and a half were a bit distant and because of his job (which she both loved/hated... which was crazy) it didn't have the same frequency as a more traditional 5 months.\n\nKatie was friendly with James but that's as far as I thought it went. Instead, she had gotten close and they hooked the night our cousin dumped him. Katie came told me a couple of weeks after our cousin and James broke up, told me to keep the secret and then literally ghosted everyone else in the group. No one could figure it out. That was over a year ago.\n\nAt Xmas, Katie debuted her relationship, but it was clearly very serious. The only people who knew were my parents and myself, but my parents didn't know that he had been seeing our cousin. My cousin and some relatives were insulted. It became a real drama. My family felt this was cheating/infidelity and my aunt (mom of my cousin) wrote on FB that Katie is nothing but a cheap wh\\*\\*e. That triggered my mother and father and now no one is talking.\n\nMy grandparents have a 60th anniversary coming up and my aunt won't go if my parents or Katie go. My mom won't go if my aunt's family is there. My uncle won't go if there's any drama. My grandparents just want everyone together because they are getting old. So they asked ME to mediate. fuuuuck.\n\nThe thing is, Katie and Jack are very serious. They moved in together a few weeks ago and she's telling everyone that he's the one. She's in wifey mode and is angling for a wedding next summer and he seems open to the idea. It has really been dramatic in our family and my aunt is salty about everything and my cousin is straight-up furious. Despite complaining about him endlessly, she feels maybe they could have salvaged things. To me it feels like she just doesn't want anyone else to have him.\n\nI don't even know where to begin. I can't get Katie/my cousin in the same room and no one is willing to back-off. Everyone is acting like a dug-in pain. Does anyone know how to broker peace in a family for elderly grandparents who'll probably not live *that* many more years?\n\nI think both my cousin and sister handled it badly and now I'm stuck in the middle. Again.",
            "spoiler": false,
            "stickied": false,
            "title": "Sister [27/F] ghosted all her friends after she \"stole\" her current BF [29/M] from our cousin [also 27/F]. Family found out at Xmas, I'm stuck in the middle with everyone accusing her of infidelity and being a \"wh**e\". Grandparents want me to mediate this nightmare.",
            "upvote_ratio": 0.89,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjfu45/sister_27f_ghosted_all_her_friends_after_she/"
        },
        {
            "author": "u/Pepperonin424",
            "created_utc": "03-22-2022 08:50:56",
            "distinguished": null,
            "edited": false,
            "id": "tjxr9m",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjxr9m",
            "nsfw": false,
            "num_comments": 20,
            "permalink": "/r/relationship_advice/comments/tjxr9m/what_to_do_about_gf_always_being_drunk/",
            "score": 9,
            "selftext": "I'm at my wits end. We'll have been together 7 years this May and were friends for years before we got together. This has been a recurring issue that has escalated to a breaking point before dying back down, until rinse and repeat it happens again. \n\nThere have always been issues- she doesn't work or drive, she has had jobs while we have been together but it isn't a regular thing for her. She doesn't have any drive to get her license, or progress with her life whatsoever. Even when she's seemingly motivated I basically have to do everything for her or it will not get done- at least adult/responsibility-wise. She had a pretty awful upbringing and was basically raised to do chores and housework and take care of the other drunk, drug dependent people of the household rather than be her own person. \n\nShe won't say why and absolutely refuses to go to therapy or counseling but I think she is bitter and drinks to cope with it. I will drink on occasion but do not feel the need to more than once every couple weeks or so and even then I usually need to be pushed into it by someone. I'm just not someone that cares about alcohol that much. She seems like she has to drink all the time which was not the case when we started dating (she's the only person I've ever met addicted to weed, like I couldn't take her anywhere if she couldn't smoke every 20 minutes when we started dating and she literally could not eat if she didn't smoke right before). Regardless of the reasons, she always gets shitfaced plastered to the point she throws up, I can't understand what she is saying and she wakes up the entire house including my sister's toddler between throwing up and then crying and always leaves puke everywhere, usually (with multiple other adults and my parents living in the house) abruptly comes back from the bathroom naked having had to walk all through the house like that because she decided she needed a shower but didn't bring a towel or anything with her. \n\nShe's drunk as I'm typing this and I'm just exhausted. I work a 12 hour shift tomorrow and I worked one today. I have to come home from work and babysit a drunk and assure her that something isn't her fault- no idea what, she won't say and even if she tries to explain she replaces every single word with \"doots\". You might think I am exaggerating but this is literally what she just said to me:\n\n\"I don't have the doots, to doots *waving hands* and I doots so when you- *burp* I doots, I cannot- *stops mid conversation and stares into space before sitting down*\" \n\nIf I ask her to slow down, what she's saying, anything she starts BAWLING. Like, people start knocking on my bedroom door at 2am asking if we're okay bawling. And then I get texts from people asking if I know what the obvious puke all over everything is in the bathroom the next day while I'm at work.\n\nI've tried explaining to her when she's sober how bad this is and she will nod and agree and say everything I want to hear, and then without a car or a job of her own or living close to anything she's always somehow drunk when I get home. I think she's stealing alcohol from my parents or someone else in the house. \n\nShe just fucking fell down and knocked over a bunch of shit in the kitchen as I typed this. I have to pretend this isn't a big deal because now she is crying and I just want her to stop and go to bed so she stops waking everyone else up. She's not gonna remember any of this even happened tomorrow I'm gonna have to explain it to her while she looks mortified. \n\nI can't keep doing this every night. I can't. Idk what to do I love her so much and we've been together so long I don't even know what I would do if I was on my own again. She won't open up about it or talk to anyone and I feel like if I do leave her it's gonna only get worse. I'm sleep deprived going into work each day and instead of resting it's this all night basically until I have to work again. What can I do?",
            "spoiler": false,
            "stickied": false,
            "title": "what to do about gf always being drunk?",
            "upvote_ratio": 0.85,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjxr9m/what_to_do_about_gf_always_being_drunk/"
        },
        {
            "author": "u/JeremyMcWinnin",
            "created_utc": "03-22-2022 11:05:25",
            "distinguished": null,
            "edited": false,
            "id": "tjzkmb",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjzkmb",
            "nsfw": false,
            "num_comments": 20,
            "permalink": "/r/relationship_advice/comments/tjzkmb/what_am_i_24m_doing_wrong/",
            "score": 7,
            "selftext": "TL;DR My girlfriend seems to be causing problems and I don’t understand why\n\n\n There’s been a few situations between my fiancé (22F) recently that have left me confused and I’m hoping someone can help me understand what I’m doing to provoke her. \n\nThis morning she sent me a photo of a woman with a particular haircut she liked, suggesting that she get that hair style. I responded with “I wouldn’t complain”. She asked me what I meant and I said “it’s nice to look at” \n\nSo she hits me with “because you thought it was nice to look at other girls…?”  \n\nAnother example, a couple of days ago she went through my friends list and seen a girl she didn’t recognize I guess. She went through her photos and seen I liked the most recent one (this is a woman I added from a meme page cause she always posted funny memes). She asked me “oh you liked her photo so you want to f**|< her right”\n\nI’m trying not to get frustrated with her but it’s difficult because I’ve never cheated on her, hit on another girl or even gone out of my way to compliment someone else. At first I was all about reassurance but it happens several times a week at this point and it’s starting to wear me down. \n\nIt got to the point she suggested relationship counseling to which I directly agreed causing her to say “oh so you think I’m crazy”\n\nAny advice or thoughts are appreciated!",
            "spoiler": false,
            "stickied": false,
            "title": "What am I (24m) doing wrong",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjzkmb/what_am_i_24m_doing_wrong/"
        },
        {
            "author": "u/WarmChocoMilk",
            "created_utc": "03-22-2022 13:53:07",
            "distinguished": null,
            "edited": false,
            "id": "tk2c0n",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2c0n",
            "nsfw": false,
            "num_comments": 18,
            "permalink": "/r/relationship_advice/comments/tk2c0n/is_it_worth_it_to_deal_with_a_person_with_mental/",
            "score": 4,
            "selftext": "I (26m) am having a hard time dealing with the constant mania/depression toxic cycle of my girlfriend (36f) of 5 years. \n\nThe psychiatrist seems to be just tossing darts at the wall with drugs to see what helps or not. It's obvious the doctor doesn't have a full understanding of exactly what these drugs do beyond what anybody can google.\n\nNothing is working and I'm trying because I love her and we have two young kids together, but I want to give up sometimes.",
            "spoiler": false,
            "stickied": false,
            "title": "Is it worth it to deal with a person with mental health issues?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2c0n/is_it_worth_it_to_deal_with_a_person_with_mental/"
        },
        {
            "author": "u/Due-Memory-4937",
            "created_utc": "03-22-2022 13:37:46",
            "distinguished": null,
            "edited": false,
            "id": "tk21n5",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk21n5",
            "nsfw": false,
            "num_comments": 2,
            "permalink": "/r/relationship_advice/comments/tk21n5/still_having_feelings_after_ten_years_apart/",
            "score": 4,
            "selftext": "I’m new here so hope I’m posting correctly?\n\nWhy do I still have feelings for someone from over ten years ago? At the time I had walked away from an abusive partner and wasn’t ready for another relationship, and he also had come out of a long term relationship. He was willing to wait for me until I was ready, we had known each other since high school. The problem was his ex loved him dearly, depended on him and suffered from depression. I couldn’t make things even worse for her and couldn’t have had a happy relationship with him, knowing it would cause hurt to her.\n\nI told him at the time to forget about me and to go back and help her and that she needed him then. Which she really did, and I don’t regret any of that. If I could relive that moment I would make the same decision. He was upset that I didn’t want to try with him but I knew it was for the best.\n\nThe problem is that it’s now over ten years later. I’ve settled down with someone who I love and yet I still think of “him” deeply. Why?! It’s actually quite frustrating, I question myself why? Then just recently he popped up as a suggested friend on social media which got me wondering if he’s ok? Obviously I can’t ask him, he’s still with the lady and I’m so happy he made her whole again. I just remember the things he said to me, and how he felt and can’t help but wonder is he happy? And also how I need to forget about him, but how? I’m a logical person and after all this time this feels completely illogical and ridiculous to even feel/think this way? How can I move past this after all this time? Will the feelings ever leave?",
            "spoiler": false,
            "stickied": false,
            "title": "Still having feelings after ten years apart",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk21n5/still_having_feelings_after_ten_years_apart/"
        },
        {
            "author": "u/worriedaf22",
            "created_utc": "03-22-2022 13:22:01",
            "distinguished": null,
            "edited": "03-22-2022 13:31:29",
            "id": "tk1qj8",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk1qj8",
            "nsfw": false,
            "num_comments": 10,
            "permalink": "/r/relationship_advice/comments/tk1qj8/found_out_im_pregnant_yesterday/",
            "score": 4,
            "selftext": "i (27 f) and my fiancé (27 m) don’t know if we’re ready to be parents or if we even want to be. i don’t know what to do. i feel numb since i found out.\n\nediting for context although i don’t feel like there needs to be..\n\nmy fiancé and i have been together 6 years in september and i have always been on birth control. i literally went in for a refill and instead found out i was pregnant..",
            "spoiler": false,
            "stickied": false,
            "title": "found out i’m pregnant yesterday…",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk1qj8/found_out_im_pregnant_yesterday/"
        },
        {
            "author": "u/Fuzzy_Pancake30",
            "created_utc": "03-22-2022 13:18:54",
            "distinguished": null,
            "edited": false,
            "id": "tk1ohg",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk1ohg",
            "nsfw": false,
            "num_comments": 3,
            "permalink": "/r/relationship_advice/comments/tk1ohg/what_does_it_feel_like_to_fall_out_of_love_with_a/",
            "score": 4,
            "selftext": "My partner (27NB) and I (28F) have dated for 2.5 years, have been living together for just under 2 years now.  We’ve been stuck in a cycle where I express upset feelings to them regarding actions they take, they promise to try harder, they put in the effort for up to a week, and then things go right back to how they were.  I’ve also expressed to them how I am recognizing this cycle and how it needs to break, and that it’s on their end.  When we have these discussions I try very hard to not blame them and to be understanding because they have diagnosed mental health issues (depression, anxiety, ADHD).  Today as we said our goodbyes and ‘I love you’s before leaving for work, I realized I just did not feel like I loved them anymore.  The words felt so disingenuous leaving my mouth.  I have depression as well and sometimes if I know I’m having a wave of depression it’s hard for me to access my emotions at all, but this did not feel like that.  People of Reddit, if you’ve fallen out of love with a partner before, what did it feel like?  How did you recognize it as it happened or after?  Is there a way to get this back?  I’ve suggested couple’s counseling and they did not react well, although they agreed to try.  The problem is we don’t have much money right now and neither of us have made the appointment.  I am in individual therapy and I’ve asked them repeatedly to go back to therapy (they were in it when we met but stopped), and they made one appointment, hated the new therapist, and have not tried again since.  We’ve had these talks so many times and I’m just scared that things will never change or improve.  I feel like I’m not worth the effort, or that they think this isn’t negatively effecting our relationship as much as it is.\n\nTLDR: This morning I felt no love for my partner when we said goodbye to each other as we left for work.  If you’ve fallen out of love before, what was it like for you?  How/when did you realize it?",
            "spoiler": false,
            "stickied": false,
            "title": "What does it feel like to fall out of love with a partner?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk1ohg/what_does_it_feel_like_to_fall_out_of_love_with_a/"
        },
        {
            "author": "u/Computer_Business",
            "created_utc": "03-22-2022 10:15:36",
            "distinguished": null,
            "edited": false,
            "id": "tjyw3b",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjyw3b",
            "nsfw": false,
            "num_comments": 5,
            "permalink": "/r/relationship_advice/comments/tjyw3b/my27f_gf25f_is_distant_i_feel_like_our/",
            "score": 6,
            "selftext": " I met this girl last January and we hit it off. We decided to meet on February and right now we are currently in our 2nd month anniversary. She says she wants to take everything slow, but i feel weird going on just 2 dates with her in the past two months. Have kissed her once. She also doesn’t want to sleep over to cuddle. I promised her I wouldn’t touch her and that I just wanted to spend the night with her. She says she’s open to sleepovers maybe around the 7-10th date. We go out once a month and I’m not rushing anything or what but I feel like sometimes she doesn’t crave my presence enough.",
            "spoiler": false,
            "stickied": false,
            "title": "My(27F) GF(25F) is distant? I feel like our relationship is moving too slow. Any thoughts?",
            "upvote_ratio": 0.81,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjyw3b/my27f_gf25f_is_distant_i_feel_like_our/"
        },
        {
            "author": "u/EntertainmentSea3817",
            "created_utc": "03-22-2022 05:20:04",
            "distinguished": null,
            "edited": false,
            "id": "tjup5p",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjup5p",
            "nsfw": false,
            "num_comments": 48,
            "permalink": "/r/relationship_advice/comments/tjup5p/gf_blocked_me_on_everything/",
            "score": 17,
            "selftext": "Hello,\n\nI have been experiencing health issues for the past 3 months. In and out of hospitals with neurological issues. Through this time my gf of 1 year has been there for me helping me out. I have been deeply depressed and has changed my personality a great deal, which in turn has messed with the relationship. \n\nAbout a 2 weeks ago she started a new job and had other family issues happening which resulted in less help from her. One Friday night she was not picking up her phone so I went over to her parent’s house as I felt worried. Her dad opened the door and got her for me. I asked her why she didn’t pick up the phone and noted it was silent. I then asked her about her day off with a “higher tone” and she suddenly decided to walk away. I ended up grabbing her by the arm to stop her which made her freak out. She ran inside the house with myself behind her, telling her dad I pulled her. I obviously told him I did because I wanted to talk. Long story short I talked to the dad and eventually left. \n\nShe then proceeded to block me on social media and cell phone. She also blocked my parents when they tried to contact her.\n\nIt’s been 5 days now and I’m confused as to what happened. Dealing with a major health issue at the moment idk why she would do this.\n\nHer mom ended up texting me to stop trying to talk to her, and that she was scared for the reason of blocking. I’m devastated as she hasn’t communicated anything directly to me.\n\nShe removed all of my pictures from her social media. \n\nShould I wait for her explanation? I’m I just delusional at this point?\n\nI’m devastated as she was my rock since the begging of my health journey. \n\nPlease advise.",
            "spoiler": false,
            "stickied": false,
            "title": "GF blocked me on everything",
            "upvote_ratio": 0.85,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjup5p/gf_blocked_me_on_everything/"
        },
        {
            "author": "u/boysgotojupiterright",
            "created_utc": "03-22-2022 10:04:26",
            "distinguished": null,
            "edited": false,
            "id": "tjyqn1",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjyqn1",
            "nsfw": false,
            "num_comments": 9,
            "permalink": "/r/relationship_advice/comments/tjyqn1/i_24f_feel_like_i_have_to_change_my_entire/",
            "score": 8,
            "selftext": "Last spring I joined this tennis event on meetup. I asked my fwb at the time to attend it with me as I wasn’t comfortable going alone. He did attend it with me. Present day, they stopped making these tennis events outside for the fall and winter and the organizer only invited his friends by text. He had my phone number but never invited me to any of these indoor tennis events during the fall and winter. But I know he invited my ex fwb to them because I saw him ask for my ex fwbs number while he only asked for mine out of pity I think. So for this entire 6 months, I’ve been depressed in the house and I was getting really good at tennis. I know my ex fwb has been hanging out with their group and I’ve been excluded. I saw today he posted on meetup that he is looking for a few more people to join them since they don’t have enough people to play. When I saw that post, I almost threw up. It seems like nobody likes me because maybe I’m too quiet or maybe I’m too awkward. But I’m only hurt because they kept my ex fwb who I introduced to the event and excluded me. Are my feelings valid? Should I feel sick?",
            "spoiler": false,
            "stickied": false,
            "title": "I (24f) feel like I have to change my entire personality in order to make and keep friends.",
            "upvote_ratio": 0.89,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjyqn1/i_24f_feel_like_i_have_to_change_my_entire/"
        },
        {
            "author": "u/dizey520",
            "created_utc": "03-21-2022 20:01:22",
            "distinguished": null,
            "edited": false,
            "id": "tjj7zr",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjj7zr",
            "nsfw": false,
            "num_comments": 89,
            "permalink": "/r/relationship_advice/comments/tjj7zr/my_30m_gf_31f_wants_to_go_on_vacations_but_i_dont/",
            "score": 93,
            "selftext": "She is constantly guilt tripping me that I don't take enough vacations with her, but the times we have gone I pay for everything and she doesn't get that I don't like it. Its not my way. I don't mind paying for certain things but when it's all the time, it gets old. \n\n  Granted my job pays more then her job (80k) and I pay for all the bills and rent for our house. I pay her bills as well. She sees our friends who have S/O going on vacations constantly but those friends all have good paying adult jobs (70-100k a year) and no kids. My gf on the other hand has a job that pays nonsense that she won't give up on because she loves her work environment. But she makes a little over 20 grand a year. \n\n  I have my own business and I work insanely hard to make it succeed. Meaning I more often then not work 7 days a week 12 hour days if not more. Whenever I bring up that I'm going to go somewhere with the guys for a weekend. (Leave Saturday come back sunday) she goes on and on about how I'm able to do that but not with her.\n\n\n  Well when the guys and I go on a trip. Everyone pitches in their fair share. Everyone splits everything evenly and it really doesn't cost much when it's 5 dudes sharing an airbnb somewhere. And when I tell her this she gets defensive. \n\n  She says we could do the same thing but realistically she can't without me having to cover things while we're on the vacation or when we get back because she's used up all her money. \n\n  And if I bring up that she doesn't make much money. She gets on the defensive saying that not everyone is like me. That she's not as lucky as I am to have my own business and make good money. But its not luck. It's from the hard work I do. It's from the hours I bust my back doing what I gotta do. It's not luck at all. It's drive. \n\n  Drive which she doesn't have. She has no actual goals for the future when I ask her, just ideas of what she wants. She has no skills that would be considered a career. And I ask her about going back to school and learning something but she either shuts down and doesn't want to talk about it or gets defensive and starts saying I think she's a loser. And turns it into a pitty party \n\n  I'm trying to find the right way to tell her that I wish she could be more like me and find it in her to strive for greatness but she's so content just doing what she's doing and letting me pay for everything. I don't want to separate. We have a child together, I just need her to do a little more. I want her to want to do her share and not make me feel like an asshole for wanting that. \n\n  I just have no idea how to begin that conversation without hurting her feelings or making her feel like I'm putting her down. I feel like I've strayed from the whole vacation thing but it all circles back to it. Being the main thing that I don't want to pay for all our living expenses and vacations on top of that.  \n\n  I feel stuck and don't know a way of expressing that to her.",
            "spoiler": false,
            "stickied": false,
            "title": "My (30m) gf (31f) wants to go on vacations but I don't want to pay for everything.",
            "upvote_ratio": 0.87,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjj7zr/my_30m_gf_31f_wants_to_go_on_vacations_but_i_dont/"
        },
        {
            "author": "u/Responsible-City2201",
            "created_utc": "03-22-2022 10:53:09",
            "distinguished": null,
            "edited": false,
            "id": "tjze20",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjze20",
            "nsfw": false,
            "num_comments": 12,
            "permalink": "/r/relationship_advice/comments/tjze20/is_it_okay_for_husband_to_be_calling_me_bitch_hoe/",
            "score": 6,
            "selftext": "Hi everyone,\n\nI need some advice. This whole situation began when my 3month old started crying. So before I went to bed, I told my husband that if he's still awake to take care of our baby so I can sleep. Keep in mind that I take care of my 2 yr old toddler and my 3 month old 7 days throughout the week. My husband is either working or when I ask him for help during his days off; while I do homework, he'll help, but that's usually during the daytime. But this happened at night and since he was awake, it was his shift and it irritated me that when our 3month old started crying he immediately told me \"get up and breastfeed him\". He goes and make a bottle. It got me mad because even though it was his shift he still woke me up and I found it unfair that during my shifts I don't ever wake him up. Only time I woke him up throughout the night was when our son was 1 month old. So I got mad and told my husband that there are ways around it without having to wake me up. He didn't need to rely on me to make our baby stop crying while he made a bottle. He could have given him a pacifier temporarily while he makes the bottle. I told him and he got angry and said \"are you fuckin stupid? bitch, shut the fuck up. Your fuckin irritating right now\". We argued more and he continued to say \"shut the fuck up you piece of shit\". So I told him that I didn't want him cussing at me because it makes me feel offended and disrespected. I told him many times before our first child was born and even now he just tells me \"I'll work on it.\" Or he says \"you know I'm this kind of person. I've always cussed.\" Because he gave me the same answer like usual, it made me angrier and I brought up the fact that I don't cuss at him or call him names even when I'm angry with him and he says \"so? I'm not like you\". I felt like I couldn't express how angry I was with him so I told him I wasn't going to sleep with him, so I took my pillow and blankets and told him I was sleeping on the couch because I'm too angry with him. He then says \"you fuckin idiot. Stay your fucken ass here. You don't need to go sleep out there and make this situation worse. I swear, you are like a fucken child. I can't believe I'm married to a petty ass child\". I left anyways and left the kids with him so he'd know how it feels to care for BOTH the kids throughout the night WITHOUT my help. He called me a hoe as I was closing the door behind me. And... I said something unnecessary back that might have hurt him before I left the room because I was so angry .... It was the first time I ever said it because I was so angry and I felt like whatever I told him was not getting through to him because I have told him many times about how I felt about him calling me names. I told him \"no wonder why your parents have a hard time loving you\".  I know it was wrong of me. I plan on apologizing once we both cool down.\n\nI know it was long but... What do you guys think? How do I work with this? Is it okay to be called names? How can I make it better? Hearing him call me \"bitch\", it's just so degrading to me. I get so offended and it gets me so angry when he calls me names. It makes me feel unappreciated. Getting up every 2-3 hours every night is hard for me. I am a full-time mom and a full-time student.  If I was on my period, he would've said that I was throwing a pissy fit cause I was on my period or if I was pregnant, he would have blamed it on that. He's done that before. Today during this argument, he blamed it on lack of sleep. Because I just woke up and is tired that's why I was arguing. I want our relationship to work. We don't argue all the time. Maybe once or twice every other week. I try to understand from his point of view so I try to do the best that I can as a wife. I know he's tired when he comes home from work, that's why I take care of the kids on the days he work without asking for help in return. But during this situation, he was off work. He was just playing games.",
            "spoiler": false,
            "stickied": false,
            "title": "is it okay for husband to be calling me \"bitch\" \"hoe\" \"idiot\" during an argument even though I've brought it up multiple times about how it makes me feel?",
            "upvote_ratio": 0.8,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjze20/is_it_okay_for_husband_to_be_calling_me_bitch_hoe/"
        },
        {
            "author": "u/insecure_wtf",
            "created_utc": "03-22-2022 13:02:27",
            "distinguished": null,
            "edited": false,
            "id": "tk1dra",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk1dra",
            "nsfw": false,
            "num_comments": 8,
            "permalink": "/r/relationship_advice/comments/tk1dra/i_41m_want_to_set_boundaries_for_wife_38f_of_7/",
            "score": 4,
            "selftext": "Hello,\n\nMy wife and I are going on vacation soon, and one of the issues I've been having lately is how much time every day she spends talking to this new male work friend. There have been days where it's been like 8 hours or more in a given day. This makes me uncomfortable, and I don't want her to be giving him time/attention during \"our\" time.\n\nI really want to ask for no contact with him during our trip, but I worry about being controlling/unsupportive. Is any boundary appropriate in this situation?\n\nTLDR: Wife and I going on vacation, I don't want her talking to this other man at all during this time. Not sure if reasonable.",
            "spoiler": false,
            "stickied": false,
            "title": "I (41M) want to set boundaries for wife (38F) of 7 years chatting with other man during our vacation",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk1dra/i_41m_want_to_set_boundaries_for_wife_38f_of_7/"
        },
        {
            "author": "u/Successful_Monk8757",
            "created_utc": "03-22-2022 14:30:37",
            "distinguished": null,
            "edited": false,
            "id": "tk32ho",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk32ho",
            "nsfw": false,
            "num_comments": 6,
            "permalink": "/r/relationship_advice/comments/tk32ho/im_only_19/",
            "score": 3,
            "selftext": "I’m 19 and i dont find girls my age attractive and i only like older woman so i wanted to know if theres any way for me to meet one. What should i do?",
            "spoiler": false,
            "stickied": false,
            "title": "I’m only 19",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk32ho/im_only_19/"
        },
        {
            "author": "u/Interesting-Battle85",
            "created_utc": "03-22-2022 11:42:43",
            "distinguished": null,
            "edited": false,
            "id": "tk03nd",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk03nd",
            "nsfw": false,
            "num_comments": 7,
            "permalink": "/r/relationship_advice/comments/tk03nd/my_dog_loves_my_boyfriend_more_than_me/",
            "score": 6,
            "selftext": "I guess it’s just like my title says. My two year old dog loves my boyfriend of one year more than he loves me. I can tell this is true because he cuddles with my boyfriend but not with me. He also brings the ball to my boyfriend rather than me when I play fetch with him. He prefers my boyfriends voice when we give commands and train. When my boyfriend isn’t around he goes back to showing me love… \nI’m glad that they get along but I am feeling a little jealous. My boyfriend is great with my dog and I should be grateful for them both but sometimes I feel like my boyfriend is reaping the benefits of my training and loving my dog.",
            "spoiler": false,
            "stickied": false,
            "title": "My dog loves my boyfriend more than me.",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk03nd/my_dog_loves_my_boyfriend_more_than_me/"
        },
        {
            "author": "u/blackaccountantbabe1",
            "created_utc": "03-22-2022 14:26:43",
            "distinguished": null,
            "edited": false,
            "id": "tk2zk9",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2zk9",
            "nsfw": false,
            "num_comments": 7,
            "permalink": "/r/relationship_advice/comments/tk2zk9/i_24_f_think_my_friend_26_f_had_sex_with_someone/",
            "score": 3,
            "selftext": "I can't prove it but I heard her moaning and skin slapping against each other. I saw a mans shoes in her apartment and her BF is out of town. But there was no car in our driveway...we live in the same apartment. It's just iffy. This was 3 days ago and her and I haven't talked much and I heard her crying last night...",
            "spoiler": false,
            "stickied": false,
            "title": "I (24 F) think my friend (26 F) had sex with someone and She has a BF (29 M)",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2zk9/i_24_f_think_my_friend_26_f_had_sex_with_someone/"
        },
        {
            "author": "u/Dreary_Libido",
            "created_utc": "03-21-2022 10:12:35",
            "distinguished": null,
            "edited": false,
            "id": "tj7kip",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tj7kip",
            "nsfw": false,
            "num_comments": 157,
            "permalink": "/r/relationship_advice/comments/tj7kip/feel_like_ive_checked_out_after_conversation_with/",
            "score": 538,
            "selftext": "We've been together for a few years now, and both wanted to be together for the long term.\n\nA few weeks ago, she asked me how I felt about her sleeping with a woman as a one-off. She said this was because it was something she'd always wanted to do and hadn't been able to since our relationship started and got serious very quickly (which it did).\n\nShe then added, unprompted, that she wouldn't be comfortable with me doing something similar.\n\nMore than the question - which I was happy to talk about, because you should be able to talk about anything with your partner - this really hurt my feelings. It made me feel like she didn't see us as equals, and honestly it made me doubt her emotional maturity. It's not even something I am interested in, but being told \"Can I sleep with someone else? I wouldn't want you to do the same though\" is a sentiment that - to me - seems totally lacking in self awareness. It's a side of her I haven't seen before, and one I'm not remotely interested in. \n\nI said I appreciated her being comfortable enough to ask me, but I wouldn't be comfortable with that. It's not the kind of relationship I want to be in.\n\nShe seemed like she didn't expect me to say that. I'm a pretty agreeable guy, but I have very firm boundaries and I've noticed people often aren't prepared to hear me say 'no'. She seemed quite upset, and kept talking me through how this is important to her as if it would make me change my mind or compromise. I reiterated that I respect her feelings and I understand her point of view, but I'm not interested in being in a relationship where my partner has slept with someone else - literally the same sentiment she expressed to me.\n\nShe went for a shower, and when she came back she said she wasn't interested in that idea after all. She said she had committment issues that she needed to work through, and she was scared about entering a serious relationship but she really wanted us to be together.\n\nWe've been together since (about a week), but I find I'm a lot less interested in her or the prospect of a long term relationship. I don't really want someone who treats my boundaries as something to be navigated around, and would ask to do something they wouldn't be comfortable with their partner doing.\n\nAs I said, I feel as though I've 'checked out' - still here, still enjoying her company and having fun together, but the spark I felt for her has wained a fair bit.\n\nThanks for reading to the end. Let me know what you think, I'm always open to different perspectives.",
            "spoiler": false,
            "stickied": false,
            "title": "Feel like I've 'checked out' after conversation with my girlfriend?",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tj7kip/feel_like_ive_checked_out_after_conversation_with/"
        },
        {
            "author": "u/noworkjustmoo",
            "created_utc": "03-22-2022 14:09:14",
            "distinguished": null,
            "edited": false,
            "id": "tk2net",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2net",
            "nsfw": false,
            "num_comments": 5,
            "permalink": "/r/relationship_advice/comments/tk2net/my_boyfriendm23_is_upset_because_i_couldnt_go_to/",
            "score": 3,
            "selftext": "Pretty much what the title suggests.\nNow the thing is, my GRE exam is in 1.5 months. I am an engineer so my math is pretty strong but since 1.5months is a little less to prepare, I paid for a tuition academy who take classes after work. This is not allowing me to have time to spend with my boyfriend during the week.\nToday, his friend(who is a popular local singer) is having a concert and its supposed to be very beautiful. I have already paid an arm and leg for my tuition and i really couldnt go because i had class. He asked me very very nicely(we both work together) and i said i couldnt go bec of class.\nHe got really really upset.\n\n\nRant: Its not like im having fun or doing fun things. nobody likes to miss a fun cool concert for studying. But i have so less time for my GRE exam. I really want to get into the MBA program. Please please help me out here.\n\nHow do i make my partner happy? what should i do? i feel like my brain would burst",
            "spoiler": false,
            "stickied": false,
            "title": "My boyfriend(M23) is upset because i couldnt go to a concert with him because i had class. He thinks i never spend enough time with him and i dont value him.",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2net/my_boyfriendm23_is_upset_because_i_couldnt_go_to/"
        },
        {
            "author": "u/EffectiveMight4933",
            "created_utc": "03-22-2022 12:33:10",
            "distinguished": null,
            "edited": false,
            "id": "tk0w06",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk0w06",
            "nsfw": false,
            "num_comments": 39,
            "permalink": "/r/relationship_advice/comments/tk0w06/29f_pregnant_with_ex_32m_and_panicking/",
            "score": 3,
            "selftext": "I am in a situation where I was going out with a guy on and off for 4 years because he didn’t commit . The entire time we managed not to get me pregnant . I was very on top of my periods and fertile windows this entire time . I am not working due to mental health ( anxiety disorder and ocd ) I am living at my parents with another sibling and have a couple of thousand savings but no career , I’ve just worked in bars and waitress jobs because I’ve no plan to settle yet . My parents do not have money or property to help me in the event I need a place to live .\n. I did not plan to have a baby until I have a solid home and job I can cut in and out of with maternity leave .\n\nHe dumped me two months ago which was a good thing moving forward but very hard for both of us . I also happen to have gotten pregnant AFTER we broke up because we didn’t stop seeing one another ??? \n\nI bought myself ovulation test sticks to make damn sure I knew exactly when I was ovulating so that I could be sure not to get pregnant because funnily enough that was worst case scenario , we had sex three times and no more ,my ovulation tests never showed positive until a few days ago …. When my period was due soon and it forced me to get a pregnancy test because I didn’t think that was possible ? Low and behold I am pregnant despite having had a full period after our last sex.\n\n\nAll I’m doing now is panicking because although the house is a nice place to live I don’t want to be poorly and pregnant here with all the family in and out , I need my own place to move into but don’t want to be reliant on my ex . I’m not in love or married or with a partner to live in and raise a child with . I don’t have a future planned income .\n\n\nI feel like I’m 15 and pregnant when this was my planned age to start thinking about kids . I don’t want an abortion but I just wish I’d left him blocked and not put myself into a position I’ve spent my teens and twenties trying to avoid",
            "spoiler": false,
            "stickied": false,
            "title": "(29f) Pregnant with ex (32m) and panicking",
            "upvote_ratio": 0.67,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk0w06/29f_pregnant_with_ex_32m_and_panicking/"
        },
        {
            "author": "u/Rare_figure0779",
            "created_utc": "03-22-2022 14:04:52",
            "distinguished": null,
            "edited": false,
            "id": "tk2kdb",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2kdb",
            "nsfw": false,
            "num_comments": 12,
            "permalink": "/r/relationship_advice/comments/tk2kdb/girlfriend_wants_to_be_housewife/",
            "score": 3,
            "selftext": "I’m 30 she’s 27. \nTogether 6 months.\nI just recently got an apartment last week and I work a good job making 80k a year a few months ago. Since I moved in she’s been staying with me which has been cool but I’m still moving things in and working all day and don’t have time to work out lately. It’s just been stressful. Knowing she’s at my new place all day cleaning and hanging out I didn’t think would bother me but she has no interest in getting a job. She said a few months back when I get my own place again that she’s afraid I’m going to have an epiphany and realize I want a woman that works. I just feel like she’s mooching but at the same time she’s so lovely and caring and gorgeous. She wants a kid with me… idk. I’ve known about her not wanting to work and wanting to be housewife but we’re not married and don’t have kids so it’s like…. Do something. She doesn’t even own a car so she’s stuck at my place all day and wants to get out when I get home from work when I just want to wind down and chill out…. But she has no friends and what not so I’d feel bad if I left and I’d be hurt to leave her I love her… what you think? \n\nTl;dr girlfriend wants to be a house girlfriend basically",
            "spoiler": false,
            "stickied": false,
            "title": "Girlfriend wants to be housewife?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2kdb/girlfriend_wants_to_be_housewife/"
        },
        {
            "author": "u/Mrwiseguyyy",
            "created_utc": "03-22-2022 13:59:12",
            "distinguished": null,
            "edited": false,
            "id": "tk2g2t",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2g2t",
            "nsfw": false,
            "num_comments": 5,
            "permalink": "/r/relationship_advice/comments/tk2g2t/help_with_one_sided_love_me_20m_and_her_21f/",
            "score": 3,
            "selftext": " \n\nSo about 6 years ago I started talking to this girl on the internet lets called S,who lived in a different city because of her dads posting there but was from my city originally and said that she would come back eventually. We talked a lot even tho she was an introvert. She had really less friends mostly girls because she didn’t talk to guys much. We became really good friends in all these years. We texted almost everyday. So fast forward to last year when her dad got posted back to my city. I was really excited to meet her and so was she. In all those years talking online sorta made me fall for her even tho I expressed my feelings she would say she isn’t interested in dating and just wanted to stay friends. I caught really deep feelings for her and thought she was my soulmate. we met often almost every 2 weeks I would pick her up from university and would hang out go shopping or drives or have food. However a couple days ago I expressed my feelings for her and she sorta distanced herself away from me and I felt a little bit broke inside. I knew this one sided love would hurt but what I didn’t know it would hurt so bad. she said she wanted some space and I got a little confused because she has never in 6 years said that to me and every time something was going on in her life she would tell me about but this time she didn’t and I felt that was strange. For a while I thought that she wanted to end her friendship with me and I so I got really pissed and asked her why she doesn’t wanna be friends and said she said I do but didn’t want to talk to me rn. So I gave her space. She hasn’t texted me in 3 days and I feel like she isn’t the one for me even though I’ve done so much for her and never wanted anything in return. I try to distract myself but almost everything reminds me of her. Should I wait for her to text or should I move on? I really need helps as I have no on else to ask. Thankyou for reading.",
            "spoiler": false,
            "stickied": false,
            "title": "Help with one sided love :( me (20M) and her (21F)",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2g2t/help_with_one_sided_love_me_20m_and_her_21f/"
        },
        {
            "author": "u/DogtrDoom",
            "created_utc": "03-22-2022 13:46:58",
            "distinguished": null,
            "edited": false,
            "id": "tk27u6",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk27u6",
            "nsfw": false,
            "num_comments": 22,
            "permalink": "/r/relationship_advice/comments/tk27u6/my_44m_wifes_40f_dog8dog_is_killing_me/",
            "score": 3,
            "selftext": "I know the title is dramatic. Here is the real situation:\n\nI grew up loving dogs. I have had 9 dogs in my life and loved 8 of them to death.\n\nWe have a poorly behaved dog. My wife adopted him right around the time we started dating. Thousands and thousands in training, most of which I paid for, over the last 8 years have produced nothing of note. He came from the dog shelter \"troubled\" -- he has always had severe food aggression that was just put off as \"well, he had a traumatic early life\". We have worked around that by significantly altering our lives, though he has hurt people and killed another pet over food unfortunately before we learned our lessons. It has been a constant source of fear and anxiety for 8 years.\n\nThe $12,000 fence I got put in the back yard just lead to him scratching the back door so much that we also had to replace it to the tune of $800. We didn't have money for the fence in the first place -- I refinanced my house to try and get some relief from being barked at and it did not work at all.  He hates to be alone. He gets anxious. In a way I feel sorry for him, but it has been so long. He has had 8 years of consistent training and a stable life where he can expect to get fed, walked, etc. and he still acts the same as he did when he was a puppy.\n\nI have spent no less than $25,000 just trying to not get barked at all evening after work. He demand barks(barks until he gets what he wants) and copious training has done nothing. It's getting worse as he gets older. The only way to make him stop is to one on one work with him. Walks, playing, etc. -- I walked him and played with him for three hours combined after work last night because I could not hear another yelp. I got home at 5 and went to bed at 10 and I spent 5-6, then 7-9 with the dog. This morning? No peace. 5 am I was getting barked at to walk him. It's now 7:45 with me leaving for work at 8 and I just put him up having only made myself a hasty sandwich(which I got barked at for because he wanted some).\n\nWe cannot eat dinner without demand barks coming from whatever room he is put in, or in our faces if we let him be free. He has been through tons of crate training and obviously his drive for food is stronger.\n\nMy wife helps some but she has Lupus and it has become de facto \"my job\".\n\nMy wife dropped a huge bombshell last night: our dog is getting older, so she thinks it's time to go ahead and get another. \"Get dealing with a puppy and dealing with old dog over with at the same time\".\n\nI can't do it Reddit. I don't think I even want dogs any more. She says we \"agreed to always have dogs\" before getting married. I am broken. I do not want a dog right now, much less a second one that ensures I will continually have a dog for yet another decade. I need a break and my wife doesn't get it. My wife is able to tune out all of the annoyance because she likes sleeping with dogs and he comforts her when she is hurting. I can't tune it out. It feels like my life revolves around this dog.\n\n(Also, I imagine it will be asked, we tried to rehome him but he is too \"troubled\" for farm dog type duties and obviously I would not put him on someone else as an inside dog)",
            "spoiler": false,
            "stickied": false,
            "title": "My (44m) wife's (40f) dog(8dog) is killing me.",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk27u6/my_44m_wifes_40f_dog8dog_is_killing_me/"
        },
        {
            "author": "u/Conscious-Pepper5852",
            "created_utc": "03-22-2022 13:44:24",
            "distinguished": null,
            "edited": false,
            "id": "tk262o",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk262o",
            "nsfw": false,
            "num_comments": 6,
            "permalink": "/r/relationship_advice/comments/tk262o/regaining_interest_in_your_marriage/",
            "score": 3,
            "selftext": "My partner and I have been married for about 5 years and have realized that we've just lost a lot of interest in each other. Anyone have good ideas for regaining interest and strengthening our relationship?",
            "spoiler": false,
            "stickied": false,
            "title": "Regaining interest in your marriage?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk262o/regaining_interest_in_your_marriage/"
        },
        {
            "author": "u/vvrice",
            "created_utc": "03-22-2022 13:42:02",
            "distinguished": null,
            "edited": false,
            "id": "tk24hr",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk24hr",
            "nsfw": false,
            "num_comments": 7,
            "permalink": "/r/relationship_advice/comments/tk24hr/i_feel_bad_for_my_partner_for_being_with_me/",
            "score": 3,
            "selftext": "It's happening again, I'm so tired I think I'm gonna fail school again and I can't even wash a f*ing plate to eat so I'm starving lying in bed waiting for my tired partner to come home to a worthless person who doesn't have the energy for anything, truly wishing he finds someone who is more energetic and full of life cause i cant be that :) This is my 4th time trying to finish school and it all gets stuck like this it's like a loop that keeps happening while everyone else is living life and moving on I'm still stuck in place and my partner has to live with this. Why does he decide to stay? I don't even have the energy to walk up to him all happy and excited or do fun things together plus my sex drive is non-existent he's lucky if he gets anything once a month or less. It's at a point where I almost beg him to just go find someone to be happier idk what to do anymore why is life so hard but it seems it's only me this way and not others...",
            "spoiler": false,
            "stickied": false,
            "title": "I feel bad for my partner for being with me",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk24hr/i_feel_bad_for_my_partner_for_being_with_me/"
        },
        {
            "author": "u/miceinthesea",
            "created_utc": "03-22-2022 13:37:42",
            "distinguished": null,
            "edited": false,
            "id": "tk21lk",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk21lk",
            "nsfw": false,
            "num_comments": 6,
            "permalink": "/r/relationship_advice/comments/tk21lk/me_18f_and_my_ex_boyfriend_20m_broke_up_a_while/",
            "score": 3,
            "selftext": "A bit of background,\n\nI (18F) really like playing online games, especially ones where I can interact with people. One day, I met a guy (20M) and we really hit off. We found out we lived in the same city and thought that after lockdown, we should meet up. Before we even met up, he started getting distant, saying he was busy all the time so we couldn't meet up and then when I finally made all the plans, he agreed. He lived kind of far away from me so we decided to meet up in the middle, which happens to be where I worked. I had known him at this point for like, a month. Maybe not the smartest choice but I was so excited because it would be my first ever date. And it goes great. But time goes by and he starts acting really rude to me, starts saying that he doesn't want to play with me because I'm bad at the game, that I should never have guy friends or even talk to guys, that my friends at the time were babying me. I felt like I was getting isolated from my friends and to a certain point, from him. \n\nIt was about two weeks after the first date where I decided I wanted to meet up again and have a nice date in a hip part of town. We made plans and I got there a little early. I waited for 30 minutes and he didn't show up. So I called him, no answer. I was getting nervous but decided to explore by myself. Another 30 minutes go by, then an hour and then another until it's been 3 hours since we were supposed to meet. He finally calls me back and apparently he slept in. He knew how excited I was for this and he completely ditched me. We later met up and hung out but I think that day really stuck with me.\n\nA week later, he's never asking to hang out, never calling me, texting me sometime and when I ask to call, he says he's with friends or that he doesn't want to play with me because I'm awful at the game. At one point, I confront him about this and he just says that he doesn't want to lie to me, that I just wanted to hear nonsense. I asked him about being supportive but he kept making the point that he was just being honest. I decided I was tired and asked to break up. It was like 2 months of knowing each other. We removed each other from everything and it was all good.\n\nFlash forward to my induction day to university, I'm sitting on campus waiting for some free food with my new boyfriend (19M) where I see someone that looks kind of familiar. My heart literally drops and I knew that it was my \"ex\". I didn't know how to react because I didn't know why he would be on my campus, he goes to a different university and lives far away. I then notice the security uniform he's wearing and it hits me. He used to work security and then left it for some reason. But now, he's wearing the uniform for my university. Noticing I'm with a guy (I think, maybe I'm wrong), he approaches me and pretends everything is fine. He tells me that he now works at my university and my student accommodation and I freeze up. He of course had to ask about my new boyfriend and if it's a guy he was worried about when we were together but they're two different people and so he left. \n\nI don't think I've had tears come into my eyes as fast as when he turned around and left. I started to silently cry and watch him walk away as my boyfriend sits there confused. I never told him how mean he was to me and how bad it was. We got our free food and left.\n\nIt's now been a couple of months and I haven't seen him on campus nor on my accommodation. I don't want to be someone who makes something out of nothing. I feel more safe that I haven't seen him but what if I do? I'm not sure if there is anything I should do and if I'm just overreacting. \n\n&#x200B;\n\n**TLDR;** I used to be with this guy that treated me quite nastily and now he works at my university and where I live. I'm not sure if I'm overreacting. What should I do?\n\n&#x200B;\n\nSorry if the formatting is bad, this is my first reddit post.",
            "spoiler": false,
            "stickied": false,
            "title": "Me (18F) and my \"ex\" boyfriend (20M) broke up a while ago but then I realized he works at my university. What do I do?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk21lk/me_18f_and_my_ex_boyfriend_20m_broke_up_a_while/"
        },
        {
            "author": "u/Entire_Chicken_1460",
            "created_utc": "03-22-2022 04:40:43",
            "distinguished": null,
            "edited": "03-22-2022 05:19:13",
            "id": "tju0t8",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tju0t8",
            "nsfw": false,
            "num_comments": 16,
            "permalink": "/r/relationship_advice/comments/tju0t8/girlfriend_f28_has_extreme_pmdd_im_m36_not_sure_i/",
            "score": 14,
            "selftext": "Once a month my girlfriend will scream at me for literally hours it can be over something big or something she perceived as an attack or insult. Ie one time I asked if she ate a cookie. One time I said “god dammit” ( more disappointed than yelling) as I watched the cat run towards my coffee before it knocked it on the floor. I’ll try to calm her during this time but it never works. The next phase I’ll get angry after hours of being screamed at. During this time she’ll get attachment panic and try to block me from leaving the room which I’d much rather do or even put her hands in the door so I can’t go to the bathroom. If I try to calm her during this time it works for maybe 5 minutes before she eventually gets quiet then full on rage again. This will last for 3-4 days. It has been 3 years and she’s just admitting it’s related to her period despite being right before it each time.\nIf it was just this I’d be confident the relationship needs to end however for 26+ days a month we have a very happy deeply loving relationship.\nI have a therapist for combat related ptsd that thinks I should leave due to the trying to block me into places bit. I just have such a hard time agreeing when the rest of the time it’s great.\nEdit: as far as treatment her therapist and gynecologist recommended birth control to help. She went on it for one month before stopping saying it caused her physical pain.",
            "spoiler": false,
            "stickied": false,
            "title": "Girlfriend (f28) has extreme pmdd I’m (m36) not sure I can handle it but everything else is great.",
            "upvote_ratio": 0.9,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tju0t8/girlfriend_f28_has_extreme_pmdd_im_m36_not_sure_i/"
        },
        {
            "author": "u/IAMMOM93",
            "created_utc": "03-22-2022 13:22:57",
            "distinguished": null,
            "edited": false,
            "id": "tk1r53",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk1r53",
            "nsfw": false,
            "num_comments": 3,
            "permalink": "/r/relationship_advice/comments/tk1r53/where_is_this_going/",
            "score": 3,
            "selftext": "In January, I separated from my husband. There’s a plethora of reasons why and none of them are because of this new guy I’m seeing. After I had separated from my husband he and I just sort of randomly got in touch, we’ve known each other for many years and what little interactions we’d had growing up were always pleasant. \nThings went from platonic texting, asking about each others lives, to very flirtatious and soon after we hung out. It was easy and fun and we spent a great deal of it laughing and genuinely enjoying each others company. We’ve hung out a few times since then, every time a little more comfortable and every time a little more fun! We’ve shared some sleepy kisses and spent the nights cuddling but it’s never gone further than that. \nI’m a relatively sexual person but my physical attraction to him isn’t even close to the reason why I want to be around him! He’s funny, he’s kind and genuine. I did begin to notice though that he wasn’t making any moves at all and eventually I asked the dreaded “what are we?” Question. He said he really likes me and was loving spending this time with me but after an incredibly rough break up he really wants to take things slow and if I wanted to go in dates with other people and get out there then he’s ok with that. I obviously completely understood about his rough break up as I had experienced the same kind of thing and said I was happy to take it slow. It kind of irked me that he didn’t care if I saw other people because that indicated he really wasn’t bothered if we became something or not. I spent the night with him and again very little moves were made, we spent the night spooning and of course come morning the sexual tension was just through the roof. I lay there hoping he’d make a move but wasn’t going to push it because I respect his feelings. However it really made it clear to me that I definitely like him way more than he likes me. He texts me every morning and we’re in touch basically 24/7 so I know that he does like me but I’m just getting the vibe that I may be hoping for something that won’t happen. I’m not entirely sure how I should navigate it, or bring it up to him? Or maybe I’m just reading into it to much…any advice on what I should do is welcome.",
            "spoiler": false,
            "stickied": false,
            "title": "Where is this going?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk1r53/where_is_this_going/"
        },
        {
            "author": "u/dwlynds",
            "created_utc": "03-22-2022 00:00:07",
            "distinguished": null,
            "edited": false,
            "id": "tjoji9",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjoji9",
            "nsfw": false,
            "num_comments": 120,
            "permalink": "/r/relationship_advice/comments/tjoji9/how_do_i_get_my_dad_to_stop_tracking_my/",
            "score": 36,
            "selftext": "I am 22F, living with my parents. My dad is constantly tracking my location on Life360 and find my friends and it makes me so uncomfortable. Whenever I try to communicate this to him he’s like “why, are you trying to hide where you’re going?” And then forces me to allow him access to my location. Any advice would be really appreciated.",
            "spoiler": false,
            "stickied": false,
            "title": "How do I get my dad to stop tracking my location/communicate to him how uncomfortable it makes me",
            "upvote_ratio": 0.9,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjoji9/how_do_i_get_my_dad_to_stop_tracking_my/"
        },
        {
            "author": "u/askingforagoodfriend",
            "created_utc": "03-22-2022 13:14:33",
            "distinguished": null,
            "edited": false,
            "id": "tk1lno",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk1lno",
            "nsfw": false,
            "num_comments": 10,
            "permalink": "/r/relationship_advice/comments/tk1lno/something_off_with_girlfriend/",
            "score": 3,
            "selftext": "Today she said she went home to visit family, I told her to take some pics with them she said ok she will\n\n6 hours later she comes home, and I asked to see her fam pics. She said she didn’t end up taking any except for the taxi ride back. How the driver was going 80 miles driving so fast  blah blah\n\nWithout me asking she sends me a 9 sec video clip of the cab, a bit pointless really but she asks me to look at the video. I check and it was like going 30 miles only, was barely moving. I point this out to her \n\nShe then screenshots and sends me pic of the speedometer and says it’s going 80, at this point I’m wondering if she’s high or something, the speedometer was going 30 clearly\n\nI point this out to her, she deletes the video and unsends then when I ask her what she’s talking about she shuts down and gets upset. I ask her to explain and she just doesn’t want to talk anymore it’s so weird\n\nWorst part is she’s staying with me and I don’t feel very comfortable with her around right now on top of being a bit annoyed \n\nAnd worse I’m now still occupied with whatever that was, more suspicious than before too and not able to focus or do something more productive\n\nNeed a 3rd person perspective of what just transpired. Wtf was that lol. Was it some deliberate gaslighting thing or something’s totally off here? What should I do?",
            "spoiler": false,
            "stickied": false,
            "title": "Something off with girlfriend",
            "upvote_ratio": 0.8,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk1lno/something_off_with_girlfriend/"
        },
        {
            "author": "u/redKing-1612",
            "created_utc": "03-22-2022 13:01:44",
            "distinguished": null,
            "edited": false,
            "id": "tk1d6v",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk1d6v",
            "nsfw": false,
            "num_comments": 3,
            "permalink": "/r/relationship_advice/comments/tk1d6v/i_28m_intervened_in_a_bullying_situation_today_on/",
            "score": 3,
            "selftext": "I was driving past a bus stop where i saw a child on the floor with his head in his knees and a couple of children throwing stuff at him. At first i looked around and seen some adults so thought to myself they'll intervene, but a gut feeling told me otherwise and I quickly spun back around.\n\nAs i got near the bus stop i seen the child who was on the floor run around the corner up a street and another child chased after him. So i quickly pulled up and followed to see what was going on and as i turned the corner i saw the child, pinned to a wall by a taller child and another child slapping him in the face, a bunch of others where just hanging around, all looked around 12-14 y/o. They were both laughing but i couldn't make out what was getting said.\n\nAnyway, i approached them both and said \"what do you think you're doing!?\" and they quickly let go of the child and he ran off around the corner. \n\nThe smaller of the two said \"He was bullying an autistic kid\" and i replied \"All i see is a pair of bullies bullying a defenceless kid\". Again he said that the child was bullying an autistic kid, so i said well point him out then and they pointed to one in the group. Funnily enough this is the same child throwing stuff at the grounded child earlier on. So i told them i seen what happened earlier and they had nothing more to really say. So i just said \"how would you like it, if i was to pin you up against the wall and slap you in the face? You wouldn't like it would you?\". he said no. I seen that their bus turned up and said \"well don't do it to other people then! Your bus is there so i suggest you get going before you miss it\" and the two lads ran off. \n\nI'm not a fan of intervening, but i had a suspicion that the child they where bullying was autistic and that they were just being horrible children. I'm not a parent and in fact, i'm awful with kids. Just don't know how to interact with them. Could i have said stuff differently to make this a bit more educational for them?",
            "spoiler": false,
            "stickied": false,
            "title": "I [28M] intervened in a bullying situation today on the way to work. How could I have better commanded the situation?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk1d6v/i_28m_intervened_in_a_bullying_situation_today_on/"
        },
        {
            "author": "u/the_flying_ship",
            "created_utc": "03-21-2022 22:41:59",
            "distinguished": null,
            "edited": false,
            "id": "tjmt33",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjmt33",
            "nsfw": false,
            "num_comments": 36,
            "permalink": "/r/relationship_advice/comments/tjmt33/i_want_to_just_run_away_from_my_husband_with_my_7/",
            "score": 42,
            "selftext": "In a gist: Husband was alcoholic, never had a stable job just because of alcohol. We had a kid in 2015. Husband diagnosed with liver disease in 2016. I have been supporting us 100% since. Even the house we live in belongs to my parents, quite big and nice as per Indian standards. Over the years, my husband's verbal abuse has been on an upward movement. He accuses me of every failure in life, abuses, curses my parents. Will not let my parents visit me, will say all things nasty, real nasty about me in front of the kid. My kid still loves him because he loves him though he is excessively possessive of him. I just want to run away to some place he can never find us. I just behold myself of the fear that my son will loose his Dad and then his sickness. Will it be wrong to leave him at this stage of his sickness. He ends up in the hospital atleast once or twice a year. Also, the verbal abuse and false accusations go beyond my capacity and i have at times hurled stuff like a plastic bottle on him. I am no longer interested in convincing him for counselling or divorce. He just won't divorce, says, he wants the kid if at all.",
            "spoiler": false,
            "stickied": false,
            "title": "I want to just run away from my husband with my 7 year old boy.",
            "upvote_ratio": 0.86,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjmt33/i_want_to_just_run_away_from_my_husband_with_my_7/"
        },
        {
            "author": "u/lordcooterthug",
            "created_utc": "03-22-2022 10:12:39",
            "distinguished": null,
            "edited": false,
            "id": "tjyun7",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjyun7",
            "nsfw": false,
            "num_comments": 3,
            "permalink": "/r/relationship_advice/comments/tjyun7/i_20f_felt_a_strange_sense_of_happinesssadness/",
            "score": 5,
            "selftext": "Hello! So basically I (20F) stumbled across a pic of my ex bf (21M) with his new gf. \n\nNow me and that ex haven’t been together for years, we were a whole high school sweetheart thing and I moved away for Uni which ultimately ended things. I’ve had the odd thing here and there but decided to stay single as I wanted to work on me. I’m doing quite well, went on to grad and have started my masters! \n\nWhen I saw the pic I was taken aback by how much he’s changed. His new gf is absolutely beautiful and they look great together, I’m really happy for him. Overall he looks like he’s doing well in life (had a stalk) and it’s like seeing an old friend achieve all the goals they set. \n\nBut for some reason, I feel sad. I don’t have any romantic feelings for this ex (we haven’t seen each other irl in over 3 years) I saw all his family members comments on the post, and once upon a time I was close to them, but we’re not in each others lives anymore. I think a part of me wishes that I was able to be there and see him achieve those goals? Im unsure exactly why I feel sad. \n\nIt’s a very confusing feeling and I’m experiencing it for the first time. It has me questioning myself. Has anybody else gone through this? If so, any words of advice? :) \n\nTLDR : I saw a photo of my ex with his new girlfriend and I feel happy that he’s doing well but sad that I wasn’t in his life to see it",
            "spoiler": false,
            "stickied": false,
            "title": "I (20F) felt a strange sense of happiness/sadness seeing my ex (21M) with his new gf",
            "upvote_ratio": 0.99,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjyun7/i_20f_felt_a_strange_sense_of_happinesssadness/"
        },
        {
            "author": "u/whateverforeverdude",
            "created_utc": "03-22-2022 12:49:45",
            "distinguished": null,
            "edited": false,
            "id": "tk15lt",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk15lt",
            "nsfw": false,
            "num_comments": 4,
            "permalink": "/r/relationship_advice/comments/tk15lt/have_you_ever_experienced_extreme_laziness_with_a/",
            "score": 3,
            "selftext": "I’m finding myself falling into this slump. When I’m alone or single, I get shit done. When I’m dating or living with someone, I put things off and don’t do a whole lot. Wondering if anyone else has experienced this and what you’ve done to get yourself up and out.",
            "spoiler": false,
            "stickied": false,
            "title": "Have you ever experienced extreme laziness with a partner?",
            "upvote_ratio": 0.72,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk15lt/have_you_ever_experienced_extreme_laziness_with_a/"
        },
        {
            "author": "u/throwra_couchsleeptv",
            "created_utc": "03-21-2022 12:41:12",
            "distinguished": null,
            "edited": false,
            "id": "tj9tpk",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tj9tpk",
            "nsfw": false,
            "num_comments": 217,
            "permalink": "/r/relationship_advice/comments/tj9tpk/bf_and_i_dont_sleep_in_the_same_bed_even_though/",
            "score": 253,
            "selftext": "Throwaway bc I have family on my main and I want an unbiased opinion. \n\nIm 24F, my bf is 26M. We’ve been together for 4 years and living together for 2. Our relationship is pretty dope. No major blowups, a few arguments here and there over little stuff (him not replacing the toilet paper, me forgetting to put leftovers away, couple stuff). But we don’t share a bed. We cuddle and stuff but he leaves the bedroom and goes and sleeps in the living room. We have a nice big comfy couch so he’s fine. The reason he does is bc he needs the tv on to sleep whereas I need silence and darkness. I have black out curtains and a sleep mask and everything. We’ll sleep in the bed together maybe once a month. I actually don’t mind this. It gives me some alone time and I get the bed to myself so I can starfish if I want. We tried having a tv in the bedroom but it resulted in me not being able to sleep and being exhausted at work. We tried keeping the tv off and that resulted in him not being able to sleep and being exhausted at work. We tried him wearing headphones for the tv but the light kept me awake. We talked about it extensively and came to to conclusion that he doesn’t mind sleeping on the couch, that he gets to have the tv on plus he runs hot so he doesn’t like to cuddle for long anyway. He has a pillow, blanket, and just busts it out when he goes to sleep and then puts it away in the morning. It works, we’re both happy and getting sleep. We are planning on upgrading to a 2 bedroom when our lease is up so he can have his own bedroom with a tv in it.\n\nMy sisters think I’m weird and crazy for being cool with it, and it’s affected their relationship with him. They’re weird around him and make little snide remarks about how he’s not committed to me and or cheating while I’m asleep in the other room. My girlfriends also think it’s weird and have commented that they wouldn’t want their bfs to not share a bed with them. My view is that this works for us, we’re both comfortable and this setup allows us both to sleep properly. I know it’s not ‘normal’ especially with a young couple like us but I’m cool with it. Am I the weird one here for enjoying this? Do we need to change our setup? \n\nTldr: my bf and I don’t share a bed bc I need silence and darkness to sleep and he needs the tv on to sleep. He has a comfortable setup and this allows both of us to sleep well. My sisters think it’s weird and a sign that he’s not committed to me. Am I a weirdo? Is there something we can try that we may have missed that will let us share a bed?",
            "spoiler": false,
            "stickied": false,
            "title": "Bf and I don’t sleep in the same bed even though we live together. People think we’re weird.",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tj9tpk/bf_and_i_dont_sleep_in_the_same_bed_even_though/"
        },
        {
            "author": "u/sexaddictbfthrowaway",
            "created_utc": "03-22-2022 05:38:39",
            "distinguished": null,
            "edited": false,
            "id": "tjuzna",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjuzna",
            "nsfw": true,
            "num_comments": 8,
            "permalink": "/r/relationship_advice/comments/tjuzna/my_20f_boyfriend_21m_has_weird_fetishes_stemming/",
            "score": 11,
            "selftext": "For context: me and my boyfriend have been together for 2 years and despite some rough patches in the beginning, it has been amazing. He is genuinely so good to me, he has taught me what it feels like to truly be loved, and we have both grown so much as people. We get along great, have talked about a future together, and want all the same things. We are also currently long distance, but visit each other once a month or so.\n\nI had a really rough week (like, really, really rough), and made the spontaneous decision to go back to our hometown to see him so that I could get some affection, feel safe and loved, and have a break from reality for a night. He didn't know exactly what happened, but could tell that something bad happened and that I was struggling, and that's why I came down. He tried to talk me out of it a bit, saying that the drive was too long for just one night, that I can turn to my friends/roommates for support, but said he would love to see me if I did come down, so I went anyway. (I later found out it was because he didn't want to add to all the shit going on, but knew he wouldn't be able to keep the secret if he saw me as he had been building up to telling me the next time he saw me)\n\nWhen I arrived I could tell something was wrong on his end, and so I asked him what was wrong to which he said he was just tired, but then said \"well, maybe I do have something I want to talk to you about\". From here, we had a nearly 2 hour conversation (if you can call it that) consisting of him preparing both myself and him for the bomb he was about to drop. It was a lot of \"it's really bad.\" \"its disgusting\" \"i feel incredibly guilty\" \"i wouldn't blame you if you wanted to break up with me\" \"you should probably not bring your stuff in I don't think you'll want to stay the night after you hear this\".\n\nThere was also a lot of explanation which mainly consisted of him saying that he did it a lot when he was younger, but when he started dating his ex he stopped completely (they dated for 8 months). He then did it a bit before he met me, but again when we started dating he had stopped. He told me that he had slipped up once or twice while dating me, and that's why he wanted to tell me. He also said that he realized how fucked up it was after he started dating his ex, because up until that point, his friends were doing it too, he was young, and had a porn addiction that very much normalized objectification of women. You know how porn addictions are.\n\nAt this point, I was panicking. He was building it up so much that I was thinking absolute worst case scenarios. I'm talking unforgiveable, I should call the police, maybe I shouldn't be alone with him, scenarios. I wasn't talking because I didn't want to pressure him, but I didn't know what to say either.\n\nSo, the main event. He tells me that he has had a fetish since he was young of taking women's pictures in public. He said he used to masturbate to them, but hasn't in years, and for the past 3.5 years he's just taken the picture, and then deleted it, but it still comes from a place of sexual desire. As a woman who has had men on Instagram dm me telling me they masturbate to my posts, and have had men on public transport touch themselves or push up against me, this disgusted me. He was right, I didn't look at him the same. But he clearly was incredibly guilty about it (I don't know how to express how guilty he seemed. It's hard to put in words, but he was clearly *very* guilty and ashamed). He said that he tried going to therapy before, but has trauma preventing him from talking to men, and \"obviously\" can't talk to a woman about this.\n\nI didn't (and still don't) know how to feel. Obviously this is disgusting, but porn addiction is a serious issue and not entirely his fault. He's clearly ashamed and working to improve. He said he's willing to go back to therapy, and he wants to stop forever. He said he *had* stopped for 2 years since we started dating, did it once within the first month we were together, and once 2 weeks ago (which was the trigger for him wanting to tell me). I don't know if it's worth breaking up over a fetish that he is actively working to heal from. But I also don't know if I can look at him the same. As much as I want to work through this, I don't know if I can.\n\nI also don't even know if I want to work through this because I love him, or if it's because I'm just too scared to break up with him for fear of a) hurting him b) being alone again and c) him starting this behaviour again. But I also don't think it's fair to me to be responsible for his actions, and if I'm the only reason he doesn't do it, then he can't be that good of a person anyway???\n\nI also feel like it's important to note; he told me that even when he was actively doing this, he never did it every time he went out in public. It was more frequent when he was younger, but he still didn't do it every single time he went out. Doesn't make it better imo, but maybe important?\n\nETA: it was never nude pictures, or changing room pictures, etc. It was just pictures of women in the mall or on the street. Sometimes focused on their rear, but never up the skirt/panty shots. At least from what he's willing to tell me. \n\nTL;DR: My boyfriend has a fetish for taking pictures of women in public. He no longer masturbates to them, but did as a teen. He feels incredibly guilty and is willing to go to therapy, but I don't know if I can look at him the same, or if I can continue a relationship with someone like that. Otherwise our relationship is perfect, and if it weren't for this I could see us getting married.",
            "spoiler": false,
            "stickied": false,
            "title": "My (20F) boyfriend (21M) has weird fetishes stemming from a porn addiction in adolescence",
            "upvote_ratio": 0.64,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjuzna/my_20f_boyfriend_21m_has_weird_fetishes_stemming/"
        },
        {
            "author": "u/Regular-Two3424",
            "created_utc": "03-22-2022 12:32:55",
            "distinguished": null,
            "edited": "03-22-2022 13:06:13",
            "id": "tk0vuu",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk0vuu",
            "nsfw": false,
            "num_comments": 19,
            "permalink": "/r/relationship_advice/comments/tk0vuu/gf_and_i_are_in_a_long_distance_relationship_and/",
            "score": 3,
            "selftext": "My gf and I are in a long distance, open relationship. Open relationship here meaning that we can go on dates and be physically intimate with other people but not romantic involved (I.e. not falling in love with anyone else). We just opened the relationship out of necessity because we can not be physically together. We’ve been in an on and off relationship for 2 years but haven’t seen each other in a year and a half due the pandemic and living on different continents.\n\nWe’ve set a few ground rules, such as: \n\n1 - letting each other know when we see another person\n\n2 - not seeing the same person too many times (not a set number but generally agreed that we need to think carefully about seeing someone more than once).\n\n3 - making time for each other after seeing other people \n\nPlus, a few others.\n\nA couple of weeks ago she broke number 1 by not letting me know when she was out with someone. Whereas I always talk to her before and after my dates.\n\nThen, the other day she somewhat flippantly dismissed #2 while we were in conversation, and we had a small argument about it. I told her that we had already agreed to that rule and it matters to me. \n\nShe also agreed to see someone a certain night even though we were suppose to have our own virtual date the next morning (thus it could affect our thing). This bothered me because, although she didn’t canceled on me outright, she didn’t consider me and our plans when she made hers and it would have made it more difficult to have our thing when she had a date the night before.\n\nFinally, today, she went out on a date again without telling me before hand. \n\nNone of these are terrible on their own but I think it shows a general attitude that doesn’t feel right to me. Overall, I feel a bit disrespected and not considered because she keeps breaking these small rules and just seems to not care about my feelings as much I care about hers.\n\nNot sure if I should just break it off now, try to reset to a closed relationship, or just try to talk to her again about my concerns. \n\nIt’s early into our open relationship but I can’t see it working out if these small rules are being broken already. It just sucks because I really do love her and we wouldn’t have to do this if we could physically be together.\n\n— more context \nAlso, We just had a conversation about our rules and her having consideration for me yesterday for me and morning for her, then, on the same day for her, she went to see that person without telling me beforehand. Made me feel really stupid calling her as soon as I woke up just to have her ignore my calls then text me she’s out with someone. \n\nI don’t think I can have any conversation with her right now. Honestly, I don’t even want to speak to her at all right now. I’m thinking about just telling her we need some time apart to figure things out. \n\nIs it reasonable to tell her I need a week or a few days to figure things out on my own before we have a conversation again?\n\nEdit: grammar, more context",
            "spoiler": false,
            "stickied": false,
            "title": "GF and I are in a long distance relationship and just opened the relationship but I’m having doubts",
            "upvote_ratio": 0.64,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk0vuu/gf_and_i_are_in_a_long_distance_relationship_and/"
        },
        {
            "author": "u/AfterAmbassador3597",
            "created_utc": "03-22-2022 14:35:28",
            "distinguished": null,
            "edited": false,
            "id": "tk35z2",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk35z2",
            "nsfw": false,
            "num_comments": 1,
            "permalink": "/r/relationship_advice/comments/tk35z2/22f_pregnant_by_my_ex_22m_who_claims_hes_doing/",
            "score": 2,
            "selftext": "So I found out last week I was 5 weeks pregnant. The only possible father is my ex, whom I just seperated from right before New Years.\nWe had 3 physical altercations last year and I told him next time he puts his hands on me I'm leaving.. that was in December. I left even though I had no where to go. I slept at friends houses and my car until my financial aid was able to cover a studio for me.\n\nWe went in together and heard the news together.. He was estatic and I'm happy and undesicive. We talked and pretty much I summed it up:\n\nHe thinks he's ready.. I told him I'm not and I don't think he is (he's fighting a fleeing charge, he struggles with alcohol, and he's crashed 2 cars within 1 year...). I'm just really having a hard time understanding why he thinks we should have a baby when not even 6 months ago he was choking me, snatched my wig off, and tried to remove the air from my tires.\n\nI don't want to have an abortion but I dont want to carry a baby either. I feel terrible and I have 2 semesters of college left. Any advice? I do feel for men who wants a voice but at the same time I don't think he's changed drastically enough and I just can't chance it.\n\nTl;Dr : I'm  (22,f) pregnant with my ex's child but I don't think I want go have it. Things in the past were toxic... and I think he might just be getting worse but lying to me because he really wants to be a daddy. I'd rather finish school though",
            "spoiler": false,
            "stickied": false,
            "title": "(22,f) Pregnant by my ex (22,m) who claims he's doing better",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk35z2/22f_pregnant_by_my_ex_22m_who_claims_hes_doing/"
        },
        {
            "author": "u/JackfruitOk2197",
            "created_utc": "03-22-2022 14:33:33",
            "distinguished": null,
            "edited": false,
            "id": "tk34jq",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk34jq",
            "nsfw": false,
            "num_comments": 0,
            "permalink": "/r/relationship_advice/comments/tk34jq/me_female_19_lost_everyone_in_my_life_except_my/",
            "score": 2,
            "selftext": "I'm still in a freshly new relationship and have a lot of mental problems. Growing up in a verbally abusive household and wasn't able to speak unless someone spoke to me first. So I've brought that habit with me because I was scared of being verbally abused and possibly hit. Got out of a 3 year relationship and now have been with my boyfriend for 1 year. I've known him for about 8 years. \n\nI'm someone with a small amount of friends and hate socializing with others outside of work/school. I now live with my boyfriend and his family because of my household situation at home. My mother [30] and grandmother [68] both are completely toxic and try to control my life. If I'm not going to college or working they want nothing to do with my future life. My step-father sees what happens and helps me stay calm by talking to me alone in my room but there's no doors in my room. \n\nIn my boyfriends house I tried to make friends with everyone and then My boyfriends brother [26] brought home another Female [26] and they keep trash everywhere in the house except there bedroom and don't respect my belongings. \n\nMy friend, Female [20] of 5-6 years left me abruptly after fighting with her boyfriend [21]. They lived together and she briefly lived with me since her mother kicked her out of the house. At the moment she lives at her Aunts and recently lost her other aunt [?]. I've been trying to speak to her about this she deleted me off snap and archive our photos on Instagram, refusing to speak to anyone except her family. While she wasn't speaking to me, (still isn't really) she went back to her abusive ex [20]. She is suicidal and using a large amount of alcohol and weed. Her family encourages that while I don't and rarely drink unless on holidays.\n\nMy childhood friend, male [20] brought home a girl from out of town [18] and she now lives with him. I was friends with both of them but just recently started a friendship with the Female as he was my friend for 10+ years. He recently texted me that I wasn't allowed to speak to his girlfriend anymore because I was \"sending her seducing photos, using her for views, and telling her I can go to his house without his permission.\" I've never done any of those things and just wanted her to explore the new state since she has anxiety and a lot more emotional and physical issues. Coming from an abusive family and lived in a trailer park back at home. I went over there to play videogames, cards, read, watch movies, and color together. There was no issue up until this moment; and if there was any flirting between us was because she pushed it on me, so I caved in a little and flirted a little but never more than that and I always made sure she was comfortable with everything. He blocked me on all her accounts but not his, refusing to speak to me our my ex [20]. \n\nMy coworker Female [40] continues to bully me and I've been working there for 5-6 years already. I've spoken to the higher ups about it and honestly don't feel safe around her anymore. When I went to the bathroom and came out she waited for me and then yelled at me for what I did because I \"walked away from a customer\" when I got a drink of water after always being out there. And I always am out in the store with 5+ customers without having any help but when someone needs help with 1 customer waiting I need to rush out there. Yesterday I was getting ready to leave, so I just put some products out in the store before saying goodbye to everyone. I didn't see or hear a customer come into the store so I didn't tell anyone there was someone out there to serve. She turns to me and says \"Are you leaving?\" In an aggressive tone and I replied nicely \"yes.\" After serving the customer she comes back and says aggressively in front of my boss and others for the first time. \"Well next time you want to walk past a customer, tell one of us!\" This happens so much and I hate social situations, so I just walked away and ignored her. This happens everyday I work with her!\n\nA couple months ago I went to my exs house, male [20] to hang out and watch some videos like we always do. My boyfriend [19] was ok with this as long as I was safe. My ex that day almost sexually assaulted me and I left right away after that happened. I told my boyfriend and he told me unless he apologized for his actions I wouldn't be able to speak to him anymore. My ex said that he did apologize and went to therapy for it because he felt bad for what happened. He is suicidal and has been hospitalized for alcohol abuse multiple times. He also has a verbally abusive father and I've been in his life for 10+ years, helping him through all these issues. I'm not allowed to speak to him anymore but he isn't blocked on my social media. \n\nMind you everything is happening all at once and I'm just completely overwhelmed with life. Seeing a therapist and getting medication for all my issues. I've seen a lot of horrific things and have PTSD. I'm in college and about the get my associates at the end of this semester, trying to keep my cool and help everyone as best as I can. Please help.",
            "spoiler": false,
            "stickied": false,
            "title": "Me, Female [19] lost everyone in my life except my Boyfriend, Male [19] and Step-dad Male [27]",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk34jq/me_female_19_lost_everyone_in_my_life_except_my/"
        },
        {
            "author": "u/AsleepManner1993",
            "created_utc": "03-22-2022 14:31:23",
            "distinguished": null,
            "edited": false,
            "id": "tk3327",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk3327",
            "nsfw": false,
            "num_comments": 6,
            "permalink": "/r/relationship_advice/comments/tk3327/my_bf_21m_keeps_pushing_back_plans_or_forgetting/",
            "score": 2,
            "selftext": "My boyfriend (21M) and I (20F) have been together for a year, and we do long distance. It has been extremely difficult the past 3 months due to his change of lifestyle which he knows I don't really like. He has been going out every single night partying with his friends (not exaggerated) and because of it we barely talk anymore because he never contacts me when out, the worst part is he wakes up around 2-4 pm and parties at 6pm which means our time frame to talk is very small. However that is not the point of this question. Because of his recent choices of lifestyle, not only have we been lacking communication, but he seems to just ditch our plans and forget about stuff all the time. He forgot our valentines day date, he lost the 150$ long distance bracelet I got him, he forgets our facetime calls and now yesterday we had a movie date and he said he'd be late.. again. He claims he still loves and says he's trying, but when I see these types of actions I think differently. At this point, I'm just extremely discouraged and feel super upset. I still love him, I am still in love with him, but no matter how many talks we have about him putting in effort I see no change. I don't want to break up with him at all, I want to work through it because I know he's young and wants to enjoy his time, but personally this really got to me, so question is, am I allowed to be upset about this? Or it's in every humans nature to make mistakes and I should just let go of it.",
            "spoiler": false,
            "stickied": false,
            "title": "My bf (21M) keeps pushing back plans or forgetting. I (20F) still love him but am I allowed to be mad?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk3327/my_bf_21m_keeps_pushing_back_plans_or_forgetting/"
        },
        {
            "author": "u/Individual_Mess_8422",
            "created_utc": "03-22-2022 08:27:52",
            "distinguished": null,
            "edited": false,
            "id": "tjxgao",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjxgao",
            "nsfw": false,
            "num_comments": 34,
            "permalink": "/r/relationship_advice/comments/tjxgao/gf_of_3_years_hid_her_past_from_me/",
            "score": 6,
            "selftext": "Update- I talked to my gf and she told that yes she was very promiscuous when she lived with my friend but no she never did porn (she laughed at it) and that was 7 years ago and her thoughts on relationships and marriage has changed. She also informed me that she once complained about my friend to the landlord as my friend had her bf move in with her without informing the landlord (for 1.5 months before my gf complained). So they dont share cordial relationship since then. She said we can talk more if I want when she comes back and that she has nothing to hide. She was single and she enjoyed sex but was too busy for a relationship, and no she was not sorry for it (idk but that fire in her is my favorite). I think we will be ok. I am also suddenly missing her a lot. \n\nOP post-[https://www.reddit.com/r/relationship\\_advice/comments/tj5lep/gf\\_of\\_3\\_years\\_hid\\_her\\_past\\_from\\_me/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/relationship_advice/comments/tj5lep/gf_of_3_years_hid_her_past_from_me/?utm_source=share&utm_medium=web2x&context=3)",
            "spoiler": false,
            "stickied": false,
            "title": "Gf of 3 years hid her past from me",
            "upvote_ratio": 0.61,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjxgao/gf_of_3_years_hid_her_past_from_me/"
        },
        {
            "author": "u/Playinwitme-",
            "created_utc": "03-22-2022 14:20:13",
            "distinguished": null,
            "edited": false,
            "id": "tk2v0l",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2v0l",
            "nsfw": false,
            "num_comments": 3,
            "permalink": "/r/relationship_advice/comments/tk2v0l/do_i_26m_ask_my_tinder_match_25f_out_on_a_date/",
            "score": 2,
            "selftext": "I'll try and keep this as short as possible. I matched with a girl on tinder and we've moved onto WhatsApp to continue talking.\n\nShe's bad at replying for some reason and took a few weeks to reply on tinder (she didn't give me a reason. She just said she's bad at replying)\n\nAnyway we joked about what the date (Friday) would be & she read my message a few days later (Sunday), but hasn't replied yet.\n\nI don't want to seem weird by messaging her again knowing she's busy & can't reply always straight away. But at the same time I wanna shoot my shot.\n\nShould I ask her out? Or just wait for a reply I might not get?\n\nThanks in advance.",
            "spoiler": false,
            "stickied": false,
            "title": "do I (26m) ask my tinder match (25f) out on a date?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2v0l/do_i_26m_ask_my_tinder_match_25f_out_on_a_date/"
        },
        {
            "author": "u/p3243",
            "created_utc": "03-22-2022 14:17:07",
            "distinguished": null,
            "edited": false,
            "id": "tk2stj",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2stj",
            "nsfw": false,
            "num_comments": 3,
            "permalink": "/r/relationship_advice/comments/tk2stj/should_i_tell_my_friend_of_4_years_how_i_feel/",
            "score": 2,
            "selftext": "Back story. We’ve been friends for 4 years now.  I’m 34m she’s 40f When we met she was in a relationship with a team member who was a friend to me. I treated her with respect. Always admired her beautiful. We actually became good friends and talk a lot. I felt have a good understanding when we talk. That is what drew me more, I could feel the connection. At least what I think. \n\nWe some how broke up with our own partners and didn’t tell each other right away. We share everything with each other btw. Once we found out, we arranged dinner and a drink to celebrate a promotion. I pick her up. She was looking very pretty I also must add. I complained her on her beauty many times that night. We ate and had beer. After we said we want to hang out more together that night. We smoke weed and then went to the beach.  As we’re driving, I notice she was holding my hand( not interlaces) well driving. \n\nShe open up about her current dating life and things. She mention how she was talking with someone and having sex. I wasn’t bothered, but only by the fact the guy was misleading her. \n\nWe ended up at a beach area and sitting together talking. Holding hands (not interlaced). Each other had hands on legs or thigh. We were very comfortable together that we even walk holding one another. It felt great. \n\nAfter the beach we wanted to hang out more. I had to go home to feed my dogs and let them out. We were out together long so I had to take care of my dogs lol. We came home, I took my dogs out. She came with me, but it felt “ intimate.” We went inside and watch tv. We also took one shot. I somehow massage her shoulders. It felt hot being close to her.  I felt she was liking it but stop herself also and ask me to stop. I did.\n\nShe ask if my tv in the living room had Netflix. Which it doesn’t. Only in my room. So We went up. She sat in the couch in my room and I sat in my bed. We watch some Netflix like that. I really felt sleep due to the alcohol front he night and smoking. I put a pillow in the middle of the bed and said let’s just sleep here. She said no and ask to take her home. I did.\n \nDriving there was fine. Talk the whole way. Both told each other “I don’t understand why your single?” Gave many complaints to each other. And we hugged and I gave her a kiss on her check(in a friend way,were Mexican also) good night. \n\nWe didn’t hang out anytime after. I was wondering if maybe the little bite of affection we had that night make her want to stay away.\n \nLately we have talk mor due to a family member passing. I went to the service to show my support for her. She appreciated it. And we talk a little bite after service on whats app.\n\nToday I made some dinner and offered to take it to her. She accepted. Once there I insisted that she tried the food that I brought her in front of me because I wanted to see her reaction to it. She traded in front of me and was very impressed with her meal. Her enjoyment of the food on her face said it all.\n\nDuring the time we were talking I expressed to her how I would be there to support her as a friend for anything she needed. Because they care about her I told her. She think me and I noticed her eyes getting tears. I then gave her a hug. She hugged me back. We talked longer and it was for about one hour more. We both planned to get a drink to catch up since I currently have broke up with my girlfriend.\n\nOnce I got home she had text me “ thank you.” I had assumed she was thanking me for the food. We talked for a little bit more. And left a conversation as is. He didn’t say good night I didn’t reply back to her.\n\nShe knows that I find her attractive. My question is with all this information that I have provided am I going to ruin a friendship, or am I going to have a very awesome relationship?",
            "spoiler": false,
            "stickied": false,
            "title": "Should I tell my friend of 4 years how I feel about her?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2stj/should_i_tell_my_friend_of_4_years_how_i_feel/"
        },
        {
            "author": "u/IanAce90",
            "created_utc": "03-22-2022 14:15:04",
            "distinguished": null,
            "edited": false,
            "id": "tk2rem",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2rem",
            "nsfw": true,
            "num_comments": 1,
            "permalink": "/r/relationship_advice/comments/tk2rem/i_need_help_with_my_dirty_talk/",
            "score": 2,
            "selftext": "Me and my gf have a pretty great relationship, aside from the feeling sometimes she doesn't wanna have sex as much as me. And I'll message sometimes I can be a bit of a dick about it. But we are super tight and talk through shit.. anyway the sex IS great, BUT! I'm not good at sex talk... She will say things like, \" you like my tight little pussy?, It's tight like a hair tie around your dick isnt it?\" ( Which it is) but what do I say back to that? I just look down at her beautiful face and keep saying she's hot, or I'll fumble over my words b.c I just don't know what to say.  I say alot of, \" oh does that feel good?\" But I think if I improve my dirty talking skills it would make sex a little bit better because I know that makes her wet.  Someone help me a bit here.",
            "spoiler": false,
            "stickied": false,
            "title": "I need help with my dirty talk",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2rem/i_need_help_with_my_dirty_talk/"
        },
        {
            "author": "u/internetpokablu",
            "created_utc": "03-22-2022 14:14:55",
            "distinguished": null,
            "edited": false,
            "id": "tk2r9u",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2r9u",
            "nsfw": false,
            "num_comments": 2,
            "permalink": "/r/relationship_advice/comments/tk2r9u/my_gf_broke_up_with_me_due_to_depression/",
            "score": 2,
            "selftext": "\nSo recently(6 days ago) my girlfriend has broken up with me due to her depression. She said she broke up with me because she is depressed and “needs to focus on herself”. She goes to therapy and just now she started to receive antidepressants. She said she still loves me but it’s not a right time for a relationship for now and wants me to move on, but also wants me in her life, but as a friend as commitment is too much for her atm as she is failing school, her parents are getting divorced and she is struggling with self love. She also doesn’t want me to wait until things are better cause she doesn’t know how long it will take until things are fine with her again. \n\nI really love her and I feel empty now that she has left me.  I know I need to give her some time and space because this is what she asks for and needs right now. We’re still gonna hang out just much less than we used to and I’m gonna try my best to be a supportive friend (even though it’s not exactly what I want as I want to hold her hug her, kiss her and tell her how much I love her) and I guess I’ll see where it takes the both of us as being a supportive friend is probably the best way of getting her back anyway. \n\nAlthough I do realize this will take a lot of time and I’m not sure how much more I can take it. Ever since she left all I want is her, I can’t focus on anything else as she is the only thing I can think of. She was and still is the most important person to me and I’m not sure what the future will bring. I know that she is trying to move on and focus on herself but I’m not sure if I’m able to move on and also focus on myself as the fact that she still loves me and has told me on numerous occasions she still wants me in her life is honestly keeping me waiting until things get better and we can try being a couple again. However, I’m scared that her feelings for me are fading away and will continue to fade leaving me alone.",
            "spoiler": false,
            "stickied": false,
            "title": "My gf broke up with me due to depression",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2r9u/my_gf_broke_up_with_me_due_to_depression/"
        },
        {
            "author": "u/drummergirl007",
            "created_utc": "03-22-2022 14:13:07",
            "distinguished": null,
            "edited": "03-22-2022 14:16:20",
            "id": "tk2q19",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2q19",
            "nsfw": false,
            "num_comments": 4,
            "permalink": "/r/relationship_advice/comments/tk2q19/boyfriend_no_longer_responds_to_my_goodnight/",
            "score": 2,
            "selftext": "We are 4 months in. We see each other twice a week. He used to text me \"sleep well\" every night, send good morning texts, and call me cute pet names. Now he doesn't text good night or good morning. He also doesn't respond to my good night and good morning texts. But he calls maybe once or twice a week and texts here and there throughout the day. Is he still interested?",
            "spoiler": false,
            "stickied": false,
            "title": "Boyfriend no longer responds to my goodnight messages. But he still texts throughout the day and calls me once or twice a week. Is he losing interest?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2q19/boyfriend_no_longer_responds_to_my_goodnight/"
        },
        {
            "author": "u/Motoman687",
            "created_utc": "03-22-2022 14:10:39",
            "distinguished": null,
            "edited": false,
            "id": "tk2oco",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2oco",
            "nsfw": false,
            "num_comments": 3,
            "permalink": "/r/relationship_advice/comments/tk2oco/should_i_wait_a_bit_longer_to_break_up_or_is_it/",
            "score": 2,
            "selftext": "\nDue to various reasons, I’ve decided to end things with my GF of 3 months. The last time I saw her was on Sunday evening, which coincidentally was our 3 month anniversary. I admittedly wasn’t acting like myself, I was much more reserved than I usually am and I think she probably sensed it. Anyway, we got back to her place and laid down on her bed and made some small talk and I told her that I wasn’t feeling sex that night. We ended up chatting a bit more and she ended up laying on top of me while we talked and it eventually led us to having sex. \n\nAnyway, I’m supposed to have a date with her tonight and I feel like I need to go ahead and break up with her, rather than drag it out longer I just don’t want her to think I used her for sex one last time (Sunday night), because I honestly didn’t, it just happened. Tonight I’m gonna stand my ground and make absolute certain that we don’t have sex, but I want to end things as best as possible. My question is, should I wait another day or two before ending it, so she doesn’t think I used Sunday as a last opportunity for sex before ending it today or is it acceptable to just go ahead and end things tonight?, without having sex of course.",
            "spoiler": false,
            "stickied": false,
            "title": "Should I wait a bit longer to break up or is it an acceptable time - please read!",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2oco/should_i_wait_a_bit_longer_to_break_up_or_is_it/"
        },
        {
            "author": "u/Minimum_Bar240",
            "created_utc": "03-22-2022 14:02:42",
            "distinguished": null,
            "edited": false,
            "id": "tk2iu1",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2iu1",
            "nsfw": false,
            "num_comments": 6,
            "permalink": "/r/relationship_advice/comments/tk2iu1/i_30m_upset_my_gf_25f_last_night_and_shes/",
            "score": 2,
            "selftext": "I met my gf at work when she started in the sister office next door. We've spoken a few times about how she fell in love with me at first sight but while I liked her, I kept my distance because I didn't want to date a younger, junior colleague. I didn't want to be \"that guy\". We hit it off and eventually she asked me out and I went with it. \n\nWe've been together 6 months and have been super happy. We get on really well, have a lot of fun, and are gross in love. We've met each others friends and families, and everything is going super well. I bring her flowers every month, take her on 1-3 dates a week, and we talk all day every day. I listen to her and help her through some personal things she has going on and she tells me she appreciates me. I definitely appreciate her and how kind she is to me in return. We've never disagreed about anything.\n\nWe've joked a bunch about how she had to persuade me to date her. Last night we were generally talking and I said \"You know I didn't want to date a younger colleagues cause I didn't want to be that guy ...\" and I've said this before and she's said actually she finds that reassuring but last night I go on to add \"... So to push you away I was planning on saying something really rude, but decided against it because I could feel feelings start to develop\".\n\nThis extra bit seemed to really upset her. She questioned me about it a little and then her whole manner changed. It was the rude remark which upset her. She admitted it upset her but said it was OK - but I could tell it wasn't. I apologized and she acted like everything was OK but I could tell she was hurt. I tried to ask further but she didn't want to talk about it and insisted it was OK. She started getting a little annoyed at me asking. I stayed for another 15 mins then went home (as planned). I text her when I got home to apologize again and she didn't reply until this morning when she just ignored it and instead just said \"Good luck with your meeting this morning. You're going to do great. I love you\". I have a big, big meeting this morning. She transferred offices a while back so we're no longer around each other (which is a blessing).\n\nI don't know what to do now. Do I keep apologizing or do I drop it? I don't completely understand why she's so upset because it's not really anything we haven't laughed about before. She brings it up herself sometimes - sometimes she boasts to our friend group about how she had to persuade me. But it doesn't matter if I don't understand why she's upset - I clearly said something and I'm sorry that I hurt her.\n\nWhat do I do now? I don't even know how to respond. I feel like if I keep apologizing I'm just digging a hole and making it worse. But I feel terrible about hurting her.\n\nTL; DR - I think I said something to upset my gf and she says it's fine but it's clearly not, so do I ignore the issue and wait for her or keep apologizing?",
            "spoiler": false,
            "stickied": false,
            "title": "I [30M] upset my gf [25F] last night and she's pretending it didn't happen",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2iu1/i_30m_upset_my_gf_25f_last_night_and_shes/"
        },
        {
            "author": "u/lloboc",
            "created_utc": "03-22-2022 14:02:36",
            "distinguished": null,
            "edited": false,
            "id": "tk2irg",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2irg",
            "nsfw": false,
            "num_comments": 12,
            "permalink": "/r/relationship_advice/comments/tk2irg/why_cant_women_stand_sick_men/",
            "score": 2,
            "selftext": "So I'm having Covid since yesterday and my wife suffers from mental breakdown because it means i'll be staying in bed all week.Me and my friends already discussed this a couple of times, because their wifes and girlfriends seem to have difficulties with them being sick. Additionally, the usage of the term \"man flu\" is a worldwide phenomena. So it seems to affect other women as well.\n\nHow does your wife or girlfriend react to you being sick?",
            "spoiler": false,
            "stickied": false,
            "title": "Why can't women stand sick men?",
            "upvote_ratio": 0.63,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2irg/why_cant_women_stand_sick_men/"
        },
        {
            "author": "u/takeurpantsoffplease",
            "created_utc": "03-22-2022 11:46:45",
            "distinguished": null,
            "edited": false,
            "id": "tk05ox",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk05ox",
            "nsfw": false,
            "num_comments": 10,
            "permalink": "/r/relationship_advice/comments/tk05ox/my_18f_gf_17f_hid_her_feelings_for_our_friend/",
            "score": 3,
            "selftext": "my gf and i have been together for about 2 years. today i found out she had feelings for our mutual friend (let’s call them sam) for the first two months of this year. during this time i felt like she was prioritising sam over me. i confronted her multiple times about feeling like this and also feeling like i was having to compete for her attention. during this time i was also going through an abortion (she is trans and pre-surgery so the child was her’s) so it was a difficult time for both of us, and I admit i was probably hard to deal with. today when i found out about it all, i found out through accidentally seeing a DM to sam on her phone. when i confronted her about it she said she was going to tell me ‘after an adequate amount of time.’ which makes me think she wouldn’t have told me if i hadn’t found out. she said it was purely romantic and not sexual which i do believe. \ni talked to my other friend about it and he told me more of what happened, and said that he thought i knew. at this point i just felt horrible having to find out information from other people than her. the fact that she kept it from me and talked to our other friends about it made me feel worse than the fact that she had even caught feelings. in the afternoon i hung out with gf and sam at gf’s house. it was just me crying and them laughing like good friends do i guess. after some time i finally built up the courage and talked/cried to sam and gf about it all. gf did apologise but i felt it was half-arsed and she also said i was overreacting. i packed all my belongings and walked to the bus stop. gf followed me and started crying and apologising profusely and saying that she’ll change. i feel like she only did that because it truly hit that i was going to leave her and not that she was actually sorry. \nthis has happened on multiple occasions where i’ve had to find out about stuff she has done from other people, and only then she tells me a slither of the truth. i feel like i can’t trust her anymore. we are currently on a break, but she is begging me to not leave her and that she will change\n\ni really do love her but having her hide the truth from me broke my heart. how do i know if she won’t lie to me again? should i end it? \n\nTLDR: gf caught feelings for mutual friend and avoided to tell me until i found out from elsewhere. confronted her and friend about it and was met with not a very remorseful response from gf. packed my things and left. gf followed crying and begged me to stay. don’t know what to do.",
            "spoiler": false,
            "stickied": false,
            "title": "my (18f) gf (17f) hid her feelings for our friend from me",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk05ox/my_18f_gf_17f_hid_her_feelings_for_our_friend/"
        },
        {
            "author": "u/funmike",
            "created_utc": "03-22-2022 13:51:39",
            "distinguished": null,
            "edited": false,
            "id": "tk2b0o",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2b0o",
            "nsfw": false,
            "num_comments": 3,
            "permalink": "/r/relationship_advice/comments/tk2b0o/why_do_i_feel_emotionally_weak_when_in_a/",
            "score": 2,
            "selftext": "Why do I feel emotionally weak when in a relationship and love the woman I'm with? I feel like I behave differently less strong and confident from when we first start dating. I feel like her personality is stronger than mine and I worry more about the future and failing in my relationship. I'm more chill and laid back and she is more active and talkative around people. I love the sex and doing comfortable stuff together travel hangout outdoors grab dinner etc.\n\nDo other men feel the same way?",
            "spoiler": false,
            "stickied": false,
            "title": "Why do I feel emotionally weak when in a relationship and love the woman I'm with?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2b0o/why_do_i_feel_emotionally_weak_when_in_a/"
        },
        {
            "author": "u/thewarlordz_",
            "created_utc": "03-22-2022 13:51:15",
            "distinguished": null,
            "edited": "03-22-2022 13:55:21",
            "id": "tk2aqo",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk2aqo",
            "nsfw": false,
            "num_comments": 5,
            "permalink": "/r/relationship_advice/comments/tk2aqo/how_do_i_27f_tell_him_40m_that_a_friend_will_stay/",
            "score": 2,
            "selftext": "I meet a guy a few weeks ago (let's call him Jean). I tought he was attractive so I went to his house, we talked and he kissed me. We've been seeing each other almost everyday, we can talk about anything and time passes quickly, he respects my boundaries. We slept together twice, and last weekend I slept with him but nothing happened.\nWe both have \"alternative\" styles (goth) and similar interests so we hit off pretty quickly. \n\n\n\nProblem is neighbors are talking, everyone knows we are seeing each other and they aren't saying nice things (because of the age gap). \nA friend is coming from another country in a few weeks too, he will stay in my place, so I won't see him as often and neighbors will see me with my friend and tell him I am seeing other person(duh, yes, people is like that where I live)\n\n\n\nI don't know what to do in this situation. \n\n\n\n\nShould I tell Jean that a friend will stay in my place a few weeks? What do I do if he reacts badly?\nHow do I tell him?\nI don't want to mess up since I really enjoy spending time with him.",
            "spoiler": false,
            "stickied": false,
            "title": "How do I (27/F) tell him (40/M) that a friend will stay in my place?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk2aqo/how_do_i_27f_tell_him_40m_that_a_friend_will_stay/"
        },
        {
            "author": "u/throwaway79357847",
            "created_utc": "03-22-2022 11:38:51",
            "distinguished": null,
            "edited": "03-22-2022 12:06:22",
            "id": "tk01ln",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk01ln",
            "nsfw": false,
            "num_comments": 10,
            "permalink": "/r/relationship_advice/comments/tk01ln/my_bestfriend19f_had_sex_with_her_bf18m_while/",
            "score": 3,
            "selftext": "My bestfriend (19f) and her bf (18m) had asked me if I (18f) could leave the room (her room) while they had sex. I told them no, she had invited me and her bf so we could watch a movie and eat some snacks while we got high. That's exactly what I planned on doing, I did not plan to wait outside while they did it. My bestfriend and I got pretty high but he decided not to, which is completely fine.\n\nWe finished up our stash and headed back inside; we ate and after a few hours I was feeling sleepy so I tried to go to bed. I end up waking up to them whispering but I try to brush it off, then all of a sudden I could tell something was going on. We were all on a King sized bed fyi. It was so incredibly awkward and I had no idea what to do, I just laid there and felt like crying. I tried to go back to sleep but I couldn't, I just waited. They ended up leaving (to the bathroom I guess) and I could not believe what happened.\n\nHer bf went home around 1am and I pretended to wake up from the commotion of him grabbing his things and what not. Once he left we decided to watch another movie and I could tell she knew, I knew what happened. I laughed about it at first but I felt weird about it. She ended up crying and telling me she felt really bad, she asked \"do you think he thinks I'm easy\" and I just said no. I don't actually know what to think though, I ended up comforting her and she asked why I wasn't angry. I told her I didn't know what to feel and she said \"if I were you I'd be really angry\", that's when I was like oh. If the roles were reversed she probably wouldn't speak to me for at least a week.\n\nAfter thinking about it for a while and crying (a lot), I am angry, and I don't want them to think I was okay with it but if I try and talk to them about it I feel like I'll just end up feeling worse (and making her feel worse, she's sensitive). I want to have a relationship with them still but that night it felt like I was no one. For the first time it felt like she chose her lust for him over me. It hurt but I don't know what to do next. I saw them today and I couldn't help but feel distant.\n\nShe's my best friend of 9 years and he's her first love (dating 3 1/2 months), I am extremely confused and I need some advice.\n\nTLDR: my bestfriend and her bf had sex while I was \"asleep\", she felt bad about it but I told her it was okay. I do not feel okay.",
            "spoiler": false,
            "stickied": false,
            "title": "My bestfriend(19f) had sex with her bf(18m) while I(18f) was \"asleep\" in the same bed, how do I tell her what I'm feeling without making her feel worse...?",
            "upvote_ratio": 0.8,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk01ln/my_bestfriend19f_had_sex_with_her_bf18m_while/"
        },
        {
            "author": "u/Zestyclose_Buffalo82",
            "created_utc": "03-22-2022 07:02:35",
            "distinguished": null,
            "edited": false,
            "id": "tjw8wu",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjw8wu",
            "nsfw": false,
            "num_comments": 12,
            "permalink": "/r/relationship_advice/comments/tjw8wu/pregnant_and_depressed/",
            "score": 7,
            "selftext": "So I am 12 weeks pregnant and my boyfriend dosnt help out at all around the house he refuses to work and he is never home he is always out doing something with his family and he and I always argue when we see each other he is barley ever around and right now I’m the one paying for everything and doing everything while pregnant and super sick I have been having the worst morning sickness and it’s keeping me from wanting to do anything I have just constantly been feeling super alone and sad I just feel like nobody is there for me I don’t have much friends due to my shyness and I feel like a constant failure I just need someone to talk/rant to please feel free to say whatever u like I just really could use a friend! :)",
            "spoiler": false,
            "stickied": false,
            "title": "Pregnant and depressed",
            "upvote_ratio": 0.82,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjw8wu/pregnant_and_depressed/"
        },
        {
            "author": "u/Try2Smile4Life",
            "created_utc": "03-22-2022 13:50:04",
            "distinguished": null,
            "edited": false,
            "id": "tk29wh",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk29wh",
            "nsfw": false,
            "num_comments": 1,
            "permalink": "/r/relationship_advice/comments/tk29wh/need_advice_on_my_girlfriends_ex/",
            "score": 2,
            "selftext": "TLDR: Girl rejected me for my best friend. Now we're dating and I don't know how to feel about her ex. \n\n(This is written on mobile, so excuse the formatting. Also, this is my first post on this sub so ask away if something is unclear. Lastly, English isn't my first language to point out anything that needs editing) \n\n\n\nLast year I (M18) confessed my feelings to a girl (F18) and she responded that she already had feelings for my best friend (M18). They went ahead and dated on and off for around half a year, rather unsuccessfully: their relationship never lasted for more than one week at a time. Despite emotional hurdles in the beginning of things, my friendship with them both continued. I particularly got to be her rant partner for the periods when they weren't together. \n\nAlas, she ended things with him once and for all around new year's and my friendship with her blossomed more and more. I got to support her as she started with antidepressants despite her parents really not liking the idea and had an overall positive impact. \n\nThe weeks leading up to valentine's day we got really tight. Cuddled lots, talking about rather deep topics. She cried once in my arms which I failed to notice until after the fact. The day before valentine's day she asked me what this means for me emotionally, specially the cuddling. One thing leads to another and we have our first date on the 14th. \n\nBeing both of our second romantic relationships, we're marginally more experienced than first-timers. As of yet, things have gone great! We get along really well with each other, each other's friends and family, haven't had any fights, great communication and generally make sense as a couple. \n\nNow, my self-esteem isn't the best in the world, but I've had particular issues with the fact that her ex (my best friend) still takes up a significant portion of her mind. I know of the red flag of \"constantly talks about ex\" (which she doesn't), but I'm somewhat convinced she's over him and has been even since before we started dating. The rational part of me knows better, but sometimes I wonder if this wasn't some rebound from her? \n\nThe former issue isn't exactly helped by the fact that the two of them remain very close friends. Although I know of their ups and downs - one day she almost cried because it seemed as though all hope of their friendship was lost with how they fought the evening prior and how he made her uncomfortable - I sometimes feel as though I don't know how she feels about me *despite the two of us literally being in a relationship.* Her love language isn't even bad at all! But the two of them have something the two of us don't have, and sometimes I wonder if she loves me the way she once loved him. \n\nIs this an issue worth addressing? I might risk feeling jealous down the line if this isn't communicated right. How should I communicate my feelings (when I can hardly even describe them lol)? How should I handle such feelings, because I obviously need to accept other people in her life sooner or later?",
            "spoiler": false,
            "stickied": false,
            "title": "Need advice on my girlfriend's ex",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk29wh/need_advice_on_my_girlfriends_ex/"
        },
        {
            "author": "u/doctor_s23",
            "created_utc": "03-22-2022 07:52:13",
            "distinguished": null,
            "edited": false,
            "id": "tjwym6",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjwym6",
            "nsfw": false,
            "num_comments": 9,
            "permalink": "/r/relationship_advice/comments/tjwym6/my31f_husband34m_doesnt_want_to_get_wedding_rings/",
            "score": 7,
            "selftext": "We have been in a relationship for a year before we got married. \n\nFrom day one He clearly explained he doesn’t want a traditional wedding and I was ok with it.\n\nMy only condition was that we bought wedding rings. Even if he told me he will not wear a wedding band I want one. From time to time I remind him this and he keeps saying that we will get them.\n\nOur 2 years anniversary is approaching and he still didn't do anything about it and he never brings it up. \nI feel hurt and that my feeling don't matter to him. I'm thinking about buying them myself and surprise him but I feel nervous since it's a couples thing and he might get offended. \nShould I just buy them myself and surprise him or should I keep bringing it up?",
            "spoiler": false,
            "stickied": false,
            "title": "My[31f] husband[34m] doesn’t want to get wedding rings.",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjwym6/my31f_husband34m_doesnt_want_to_get_wedding_rings/"
        },
        {
            "author": "u/Relative-Ad9551",
            "created_utc": "03-22-2022 13:49:32",
            "distinguished": null,
            "edited": "03-22-2022 13:53:29",
            "id": "tk29k0",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk29k0",
            "nsfw": false,
            "num_comments": 3,
            "permalink": "/r/relationship_advice/comments/tk29k0/im_so_confused/",
            "score": 2,
            "selftext": "My (23F) boyfriend (34M) of 3 years broke up with me in February and two weeks later asked to get back together. When he broke up with me he said that we were at different points in our lives (obviously) and that his family disapproved of our relationship.\n\nRecently he told me he still does not see a future with me, which is hurtful and confusing because he asked to get back together and because we have been dating for over 3 years now. What's even more confusing is that he has been giving signals to the contrary. We have been seeing each other more than usual, he has been asking to spend more time with my friends, and he wants to plan a trip to Spain with me in June for my birthday.\n\nI am trying to be patient and empathetic because frankly I think that *he* is confused, but I feel like I am collateral to his mid-life crisis. I understand that I should take what he tells me at face value, but he has been so inconsistent and the confusion has been really affecting me. I want to be hopeful and I really want to try to make things work, because I do love him, but I am afraid of getting more attached to a guy who doesn't fully value me or who doesn't even know what he wants.\n\nThank you in advance for any thoughts and input",
            "spoiler": false,
            "stickied": false,
            "title": "I'm so confused!",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk29k0/im_so_confused/"
        },
        {
            "author": "u/travelbro85",
            "created_utc": "03-22-2022 13:49:15",
            "distinguished": null,
            "edited": false,
            "id": "tk29dh",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk29dh",
            "nsfw": false,
            "num_comments": 3,
            "permalink": "/r/relationship_advice/comments/tk29dh/sister_keeps_giving_my_contact_info_to_her/",
            "score": 2,
            "selftext": "My (35M) sister (34F) keeps giving my contact info to people I've never met. I work for government and she somehow thinks I can hire anyone, as if it was a private establishment. The government has very strict rules about hiring and is very transparent throughout the hiring process (which is good).\n\nI've told her I can't hire people, gave her the website where people can find job listings and asked her to stop giving out my contact information to people.\n\nWell that lasted maybe a year, now this guy is asking if we can have a chat, got my number off my sister. What do I do?\n\nDo I respond to him? If so, what do I say? Do I speak with my sister again?\n\nOr do I just ignore the whole thing and tell her I won't respond to people I haven't met and next time she should ask me first.",
            "spoiler": false,
            "stickied": false,
            "title": "Sister keeps giving my contact info to her friends saying they should call me and see if they can get into government",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk29dh/sister_keeps_giving_my_contact_info_to_her/"
        },
        {
            "author": "u/londonfogz",
            "created_utc": "03-21-2022 21:02:11",
            "distinguished": null,
            "edited": false,
            "id": "tjkljv",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjkljv",
            "nsfw": false,
            "num_comments": 19,
            "permalink": "/r/relationship_advice/comments/tjkljv/i_f26_am_ready_to_move_out_from_my_widowed_moms/",
            "score": 44,
            "selftext": "I lost my dad almost two years ago and I live with my mom and brother while I finish up school. I am hopefully finishing this august and I plan to move in with my boyfriend of five years once I’m done. If it was my choice I would have moved out a long time ago but my mom has told me a couple times not to leave her because she will be depressed. She had a hard time when my sister moved out last year. I just can’t stand living with my 31 year old brother though. My mom babies him and he’s lazy and immature. He doesn’t do much chores around the house and we disagree on a lot things… What should I do?",
            "spoiler": false,
            "stickied": false,
            "title": "I (f/26) am ready to move out from my widowed mom’s house but my mom has said she isn’t ready for me leave. But cant deal with living under the same roof as 31 year old brother anymore.",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjkljv/i_f26_am_ready_to_move_out_from_my_widowed_moms/"
        },
        {
            "author": "u/Independent_Win_4445",
            "created_utc": "03-22-2022 08:50:28",
            "distinguished": null,
            "edited": false,
            "id": "tjxr1p",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tjxr1p",
            "nsfw": false,
            "num_comments": 11,
            "permalink": "/r/relationship_advice/comments/tjxr1p/do_you_think_its_a_red_flag_for_my_boyfriend_to/",
            "score": 6,
            "selftext": "He’s given me no reason not to trust him. Always tells me when girls slide into his DM’s etc. i just don’t really understand why this would need to be the case unless there was something sketch going on?\nHelp me put it into perspective.",
            "spoiler": false,
            "stickied": false,
            "title": "Do you think it’s a red flag for my boyfriend to have his phone on DND only when he is around me?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tjxr1p/do_you_think_its_a_red_flag_for_my_boyfriend_to/"
        },
        {
            "author": "u/Swoopyl0op",
            "created_utc": "03-22-2022 13:48:25",
            "distinguished": null,
            "edited": false,
            "id": "tk28s5",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tk28s5",
            "nsfw": false,
            "num_comments": 8,
            "permalink": "/r/relationship_advice/comments/tk28s5/i_19m_cant_accept_that_20f_is_real/",
            "score": 2,
            "selftext": "I started dating a girl I met over discord, she was a friend of a guy I knew for a few years. I've seen countless pieces of evidence that she's a real person but no matter what I can't accept that she would like me. If I remember a story she said wrong it causes me to panic. Am I a bad person for feeling this way?",
            "spoiler": false,
            "stickied": false,
            "title": "I (19m) can't accept that (20f) is real",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tk28s5/i_19m_cant_accept_that_20f_is_real/"
        }
    ]
}