{
    "scrape_settings": {
        "subreddit": "relationship_advice",
        "category": "hot",
        "n_results_or_keywords": "100",
        "time_filter": null
    },
    "data": [
        {
            "author": "u/eganist",
            "created_utc": "12-02-2021 03:24:44",
            "distinguished": null,
            "edited": "12-02-2021 03:27:52",
            "id": "r6w9uh",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": "Moderator Announcement",
            "locked": true,
            "name": "t3_r6w9uh",
            "nsfw": false,
            "num_comments": 1,
            "permalink": "/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/",
            "score": 2569,
            "selftext": "#On the first topic: \n\nThe subreddit is a place for people to ask for advice on what to do next. I know it sounds dumb, but questions like \"Is this normal?\", \"Am I wrong\", \"Am I an asshole\", \"Is this fair\" or basically any questions asking about whether *something that happened in the past* was okay... these aren't requesting advice on what to do next, so they're not appropriate for the subreddit. \n\nInstead, posts should ask questions like \n\n* \"what should I do next?\" or \n\n* \"how do I do this?\" or \n\n* \"how can I fix this?\" etc.\n\nIf you have a question around something you *think* you want to do but aren't sure if it's a good idea, instead of asking (for instance) \"is this a good idea\" or \"would I be the asshole,\" try to encourage depth, like \"I'm thinking about doing this. What do you think I should do here?\" That way you'll get better answers than just a 'yes' or 'no.' Or at the very least, people might tell you why you should do the thing you already have in mind.\n\nWe're currently automatically removing variations of the following (these phrases aren't all exact):\n\n> \"Is this normal?\", \"Am I wrong\", \"Is it wrong\", \"Am I the asshole\", \"Am I in the wrong\", \"Would I be an asshole\", \"Would I be the asshole\", \"AITA\", \"WIBTA\", \"Should I have done\", \"Who's right here\", \"Was I wrong\", \"Should I have to\", \"Am I overreacting\", \"am I justified\", \"is  reasonable\", \"Am I at fault\", \"Was it irresponsible for\", \"am I out of line\", \"is this a big deal\", \"Isn't that fucked up?\", \"Am I the bad one\", \"Am I being too sensitive\", \"Is it weird\", \"Am I right\"\n\nSo hopefully this gives you an idea of what shouldn't be posted here. If your question is a yes/no question about something that happened in the past (like those are), change your question.\n\n---\n\n#On the second topic: \n\nif you have a question about any sexual situations involving minors (anyone under 18 for the purposes of this subreddit; it doesn't matter what your local laws say), even concerns around potential grooming, please don't post them here. \n\nIf you're a minor and have questions involving sexual topics, consider reaching out to either your parents or sex education/family life resources in your school on these topics, or if you're not comfortable, consider a resource such as:\n\n* [Scarleteen](https://www.scarleteen.com/article/relationships)\n\nIf you're a minor or know of a minor with sexual or potentially sexual interactions with an adult, instead of submitting here, please speak with a teacher, therapist, counselor, social worker, or other mandatory reporter or appropriate adult with your concerns and absolutely make use of the following resources:\n\n* [Darkness to Light: a child sex abuse prevention resource.](https://www.d2l.org/get-help/reporting/)\n\n* [A confidential hotline to a trained advisor who can help you navigate this](https://www.childhelp.org/childhelp-hotline/)\n\n* [International Resources](https://www.ecpat.org/resources)\n\nIt's safe to say that no one here on this subreddit is professionally, legally, or ethically qualified to give advice on these topics, so we're deferring to expert resources and hotlines like the ones above. \n\n## When reporting these, feel free to report these posts with the sexualization of minors option in the report list, as it's being enforced under that Reddit content rule. \n\n---\n\nWe owe a deeper rules reminder soon, but the above should cover the most pressing issues.",
            "spoiler": false,
            "stickied": true,
            "title": "[meta] \"Am I overreacting?\" \"Am I the asshole?\" \"Is this okay?\" don't ask these moral judgment (yes/no questions about the past) questions here. Likewise, absolutely no questions around sexual situations involving anyone under 18. See this thread for what to do instead for both of these.",
            "upvote_ratio": 0.97,
            "url": "https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/"
        },
        {
            "author": "u/PornoResearch",
            "created_utc": "03-15-2022 18:04:37",
            "distinguished": null,
            "edited": false,
            "id": "tettnq",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": true,
            "name": "t3_tettnq",
            "nsfw": false,
            "num_comments": 0,
            "permalink": "/r/relationship_advice/comments/tettnq/recruiting_adult_women_who_use_pornography_to/",
            "score": 261,
            "selftext": "If you are a woman 18 years and older and you used pornography at least once in the last 6 months, we would like to invite you to complete an online survey about your pornography use. It should take approximately 15-20 minutes to complete. Your participation is voluntary and anonymous. \n\nThe online survey is part of research conducted by Katerina Litsou, PhD researcher at the **School of Psychology, University of Southampton**. \n\nTo participate use this link: [https://southampton.qualtrics.com/jfe/form/SV\\_cZI01RWwXjv88AK](https://southampton.qualtrics.com/jfe/form/SV_cZI01RWwXjv88AK) \n\nAfter completing the survey, you will have the option to enter your email on a separate survey for a chance to win one of five £25 Amazon vouchers.\n\n**The study has been approved by the University of Southampton Ethics Committee.**\n\nIf you have further questions, please contact me: [**a-m.litsou@soton.ac.uk**](mailto:a-m.litsou@soton.ac.uk)",
            "spoiler": false,
            "stickied": true,
            "title": "Recruiting adult women, who use pornography, to complete an online anonymous survey",
            "upvote_ratio": 0.66,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tettnq/recruiting_adult_women_who_use_pornography_to/"
        },
        {
            "author": "u/Wolfyslittlekitten",
            "created_utc": "03-24-2022 00:34:44",
            "distinguished": null,
            "edited": "03-24-2022 00:57:13",
            "id": "tllhaz",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tllhaz",
            "nsfw": false,
            "num_comments": 501,
            "permalink": "/r/relationship_advice/comments/tllhaz/how_do_i_handle_this_as_a_mother_false/",
            "score": 511,
            "selftext": "TLDR at the bottom. For reference me (39f), my partner (35m) my daughter (now 12f) My partner and I have been together 8 years. \n\nEDIT TO ADD: my daughter doesn't live with me, she lives full time with her father and apparently this happened when she was visiting me for the summer. \n\nSo I have been in a mother's worst nightmare for the last year. A year ago almost exactly my daughter accused my current partner of sexual assault. The incurred an investigation, and charges laid (court proceedings are happening just very slow), however her father kept me completely in the dark as to what the situation was. I have been pursuing court action to be able to talk to my daughter but it's a slow process. My ex is fighting tooth and nail to keep me from contacting her, with his justification being that I'm still in a relationship with the person that allegedly assaulted her 🙄\n\nBut basically through legal proceedings we were able to finally get her side of the story, and it is absolutely untrue. I can't go into details but the set of circumstances laid out in her statement absolutely never happened. My take on it is she saw a video on tiktok/youtube about someone else's experience, saw all the attention and support they were getting and decided to make up a story. (Direct quote: My friend and I saw how sympathetic people were being and said hey let's get in on this) Unfortunately her father saw whatever it was that she was doing and immediately cut contact with me and went to the police. (My ex has hated my current partner since the beginning) \n\nBut I'm at a complete loss of what to do now. I'm the one that is going to have to testify that there is no way that situation happened, while she is surrounded by people that believe her absolutely. Even though I know for a fact that it never happened how she said, the idea of having to get up there and call her a liar is heartbreaking. I feel like it is something that neither of us will ever recover from. \n\nI am coming to the point where I am soon going to have to actually talk to my daughter about it, and have no idea how I'm going to address the fact that she blatantly lied, and that it has completely destroyed our lives. My partner lost access to his own daughter, since his charges prevent him any contact with anyone under 16. I haven't been able to talk to my daughter in a year. We've lost friends and family and are going to be out tens of thousands of dollars in legal fees before it is over. \n\nI love my daughter, but I am also intensely angry at her for the horror and trauma we have gone through. I recognize that she might not understand the consequences of her decision, and that her father would have been inclined to pursue this even if she tried to tell him it wasn't true, but I can't just disregard all the damage she has caused. \n\nTLDR: My daughter accused my partner falsely of SA and now I don't know how to handle her going forward. \n\nAnd for the record no I'm not just trying to cover for my partner. If I had any doubts about it actually being true I would be in a very different place. I wouldn't be willing to testify if I thought there was any possible way it could be true.",
            "spoiler": false,
            "stickied": false,
            "title": "How do I handle this as a mother? False accusations tore our family apart.",
            "upvote_ratio": 0.87,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tllhaz/how_do_i_handle_this_as_a_mother_false/"
        },
        {
            "author": "u/Patcha_Pup",
            "created_utc": "03-23-2022 20:31:02",
            "distinguished": null,
            "edited": false,
            "id": "tl9e63",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tl9e63",
            "nsfw": false,
            "num_comments": 347,
            "permalink": "/r/relationship_advice/comments/tl9e63/i_17f_dumped_my_boyfriend_23m_of_two_years_he/",
            "score": 933,
            "selftext": "TW: rape, abuse\n,,,,,,,,\nTl;dr Ex bf broke in 3 nights ago, things almost led to rape, I feel like I am in danger. Cops haven’t done anything.\n,,,,,,\nWhen my boyfriend and I first got together 2 years ago (I was 15), he lied about his age until he slept with me (said he was 18). Then after a few weeks, he told me the truth that he was actually 21. I was pissed, but ended up forgiving him and hid our relationship from everyone including my parents and family. We recently broke up because he was doing drugs behind my back after we agreed to be sober, & cheated on me & a whole lot of other things. His mom is crazy, and his dad was physically abusive when he was growing up & is no longer part of his life now. He lives with his JNM and JNS now. When I broke up with him, he started showing up to my work and screaming, & then to my house throwing rocks at it. He’s been calling me nonstop using No caller ID for weeks ever since, despite me begging for him to give me space to process everything that he’s done. I told him if he showed up again, I would call the cops. He refused, and a few days later after that (now 3 days ago) he broke into my house at 2am, climbed my roof and slid open my window when I was about to fall asleep & tried making out with me and I shoved him off. He pushed me back again and tried getting on top of me, I kept kicking him off me fearing he was going to rape me. I told him he needed to leave, I no longer loved him and he hasn’t respected any of my wishes, & he got violent and shoved me on my bed again, said ‘shut the fuck up and sit down bitch.’ I yell at my mom to call the cops and she does, he leaves before they get here, saying he is going to go have sex with other girls now & I’m a stupid kid, dumb bitch etc.\nCops questioned me but never arrested him and I do not feel safe. I haven’t been able to sleep well at night. They said they even saw him leaving in his car as they were coming into my community. I want to get a restraining order & I have a video of us having sex when I was 15 as evidence to get him registered as a sex offender. He has dated 4 other 16 year old girls before me from what I know of & flirted with countless more, some even younger than that, but the cops will not pursue him for those girls because they were age of consent (16 where I live). I’m the only one who can do anything . My friends and family have my back but I feel helpless, I feel like nothing is being done. He made a new Instagram and started following all of the girls he use to flirt and cheat on me with. I need help and I don’t know what to do or who to go to",
            "spoiler": false,
            "stickied": false,
            "title": "I (17F) dumped my boyfriend (23M) of two years. He broke into my house & it got physical. Need help asap",
            "upvote_ratio": 0.91,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tl9e63/i_17f_dumped_my_boyfriend_23m_of_two_years_he/"
        },
        {
            "author": "u/pbd1996",
            "created_utc": "03-23-2022 22:11:15",
            "distinguished": null,
            "edited": false,
            "id": "tlf74o",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlf74o",
            "nsfw": false,
            "num_comments": 88,
            "permalink": "/r/relationship_advice/comments/tlf74o/my_25f_husband_27m_has_friends_over_way_too_often/",
            "score": 333,
            "selftext": "My husband and I live in a one bedroom apartment that’s fairly small, but nice. I have a few friends that I text often, but don’t see them much as they are busy and live further away in their own apartments. My husband and I have a group of mutual friends that we like to go out with. In that group of friends, he has about three “best friends” that he hangs out with individually. I don’t hangout with any of them individually. \n\nMy husband’s best friends are….losers, if we’re being honest. Two of them are brothers who still live at their mother’s house. They literally share a bedroom and are 27 and 28. They both have part time jobs delivering pizza. No girlfriends. No aspirations or goals. And like to party. The third friend also has a part time job and lives at his mother’s house. He has a girlfriend of 6 years that he barely hangs out with. Whenever I have suggested going on a double date he basically says he doesn’t want to pay for her. He also likes to party. \n\nMy problem is, my husband hangs out with these three guys often. I would say maybe 3 days or nights out of the week with one or all of them. And when they “hangout” they all come here for either part of the time or the whole time… because they don’t have their own places. I find it exhausting. I don’t even like them to begin with, and even if I did, it’s just too often to have guests over. \n\nI’m a teacher, I work Monday-Friday, I get up at 6am everyday, and I also have work to do at home. I want to enjoy peace and quiet on work nights. I have repeatedly asked my husband to stop having friends here on my work nights. If he wants to go out with them, fine. If he wants to go to their houses, fine. Just not here. \n\nAt first, he tried to tell me this wasn’t reasonable because they don’t have the resources to do that. I told him that’s not my problem. Then he told me it’s not reasonable because we have different work schedules (he works random hours on the weekdays and all day Saturday). I told him to just have people on Saturday nights then. Then he told me I need to be more social because I’m not social enough. I told him that it’s irrelevant, and also, most working adults compromise on not having guests on week days. \n\nEventually, he “agreed” to not having them over on weekdays anymore. I’m still annoyed though as I feel like he still thinks I’m being the unreasonable one. How do I get my husband to see that I’m not being unreasonable and that it’s time to grow up and be considerate of the person you live with?",
            "spoiler": false,
            "stickied": false,
            "title": "My (25F) husband (27M) has friends over way too often and I can’t take it anymore",
            "upvote_ratio": 0.92,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlf74o/my_25f_husband_27m_has_friends_over_way_too_often/"
        },
        {
            "author": "u/Ntombizuu",
            "created_utc": "03-24-2022 02:58:44",
            "distinguished": null,
            "edited": false,
            "id": "tltqoc",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tltqoc",
            "nsfw": false,
            "num_comments": 63,
            "permalink": "/r/relationship_advice/comments/tltqoc/he_said_if_i_was_cooking_and_cleaning_the_house/",
            "score": 123,
            "selftext": "Well I broke up with him after finding lip gloss in his car, but it was the never ending gut feeling i had that he was being sneaky on the side. I never really found him cheating but i had been noticing that condoms on his bedside table were disappearing and we weren't using them. I started counting them each time I went over to his place and the day I would return, they would be short or completely gone.\n\nOne time I asked him about them and he said \"if  i was cooking and cleaning the house like a woman should then maybe the condoms wouldn't disappear\" lol my soul left my body because I couldn't comprehend what that man was saying to me.. I was in shock but dumb me at the time decided to stay because I thought maybe he was right. But deep down I knew he wasn't for me and i was too lonely and scared of being alone that I continued trying to make it work.\n\nI broke up with him but i miss him, he was my first boyfriend so i was trying so hard to hold on because well I want to be loved. I drank texted him yesterday and he made it seem as though I made the biggest mistake of my life by leaving him but I'll heal and find someone that deserves me. \n\nI feel like i wrong to breakup with him without any solid evidence of him cheating. But what's more solid than lip gloss?",
            "spoiler": false,
            "stickied": false,
            "title": "He said \"if i was cooking and cleaning the house like a woman should then maybe the condoms wouldn't disappear.\"",
            "upvote_ratio": 0.9,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tltqoc/he_said_if_i_was_cooking_and_cleaning_the_house/"
        },
        {
            "author": "u/ThrowRA1459010",
            "created_utc": "03-23-2022 22:29:11",
            "distinguished": null,
            "edited": false,
            "id": "tlg6mf",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlg6mf",
            "nsfw": false,
            "num_comments": 56,
            "permalink": "/r/relationship_advice/comments/tlg6mf/my_wife_accused_me_of_cheating_with_the_sitter/",
            "score": 269,
            "selftext": " I(40M) and my wife(42F) have a son(5M). When my wife gave birth, she left her job as she was struggling with schizophrenia, depression and anxiety. There were times where I couldn't leave the house because she accused me of meeting other women. She went as far as putting a tracker on my phone and fights would start if I went anywhere besides home or work. I do love my wife so much and I love our son. \n\nDuring the last two years, my wife spent searching for work and was offered a job a few months ago. I was laid off from my job and started working for a new company. Our son is back to attending school and is doing well. My job does require me to travel a lot and my wife sometimes will have to stay late. We decided to hire a babysitter to help with getting son off the bus and hanging with him until one of us gets home. \n\nWe decided to hire a recent college graduate(24F). Son loved having her around. She informed us that she was going to head back for school to receive her Masters and would have to cut back on her hours. I worked things out with my job to allow me to work from home two days a week. There were a few times where the sitter would be at the house while I was home working. The sitter stayed longer and I did give her a little extra when she stayed past her time. \n\nMy wife did see me give the sitter extra and accused me of sleeping with her. I denied the accusation and explained that I was giving her extra for staying later. The sitter texted me a few days ago letting me know that she was quitting. I asked why and she told me that my wife was asking her uncomfortable questions. I did confront my wife and she told me that one of her co-workers was going through a divorce because the husband was cheating with the nanny. She thought I was doing the same thing and now, I am not sure where we stand anymore. \n\n&#x200B;\n\nTLDR; My wife accused me of cheating with the sitter. Her reasoning is because one of her co-workers found out her husband was cheating with the nanny and one of the signs was receiving more money. There is a lot of tension between my and I at the moment and I do not want it to affect our son.",
            "spoiler": false,
            "stickied": false,
            "title": "My wife accused me of cheating with the sitter. Not sure where to go from here.",
            "upvote_ratio": 0.96,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlg6mf/my_wife_accused_me_of_cheating_with_the_sitter/"
        },
        {
            "author": "[deleted]",
            "created_utc": "03-23-2022 22:32:52",
            "distinguished": null,
            "edited": false,
            "id": "tlgcyl",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlgcyl",
            "nsfw": true,
            "num_comments": 132,
            "permalink": "/r/relationship_advice/comments/tlgcyl/boyfriend_m20_closes_his_eyes_when_i_f20_am_on_top/",
            "score": 234,
            "selftext": "I have never really had a lot of confidence when it comes to being on top. However, I have gained a lot of confidence over the year and now love being on top. But I noticed that my boyfriend almost always closes his eyes whilst I am on top. First I thought it was to maximize sensation but I have started to overthink it. Do you guys have any ideas why he does this?",
            "spoiler": false,
            "stickied": false,
            "title": "boyfriend (m20) closes his eyes when I (f20) am on top",
            "upvote_ratio": 0.87,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlgcyl/boyfriend_m20_closes_his_eyes_when_i_f20_am_on_top/"
        },
        {
            "author": "u/AnonymousSaderino",
            "created_utc": "03-24-2022 05:28:45",
            "distinguished": null,
            "edited": false,
            "id": "tlxn49",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlxn49",
            "nsfw": false,
            "num_comments": 23,
            "permalink": "/r/relationship_advice/comments/tlxn49/my_fiancees_father_50sm_is_refusing_to_apologize/",
            "score": 56,
            "selftext": "My wife-to-be's dad has always been a stupid bastard. When we first met, I walked up to him, hand extended. I said \"hey sir, I'm [name], it's really great to meet you.\" He was sitting and didn't stand, he didn't look me in the eye, and he didn't shake my hand. He just said \"mhmm.\" Guy hadn't even met me yet and decided he didn't like me. He's been telling my fianceè that she could do better since day one. He says she's settling. To this day he barely knows a thing about me. He's never asked me about myself, or about my family. He just makes demands. \n\nThings started getting worse a year ago when my fianceè and I moved in together. He was against it because of some religious reason we don't really care about. Since then, he's been treating her really bad. Insulting her, belittling her, making \"jokes\" about her decisions and telling her really rude things about me to her face. She's expressed her displeasure with him many times. His response is always the same: \"you're just being too sensitive.\" \"You just don't like hearing the truth.\" \"You don't know how to take a joke.\" And so on. We reached our breaking point with him when he made a joke about me getting a sex change. It made me very uncomfortable and I haven't been over to my fianceè's parents' house since. \nMy fianceè kept on going over  to spend time with her mother, and things got worse. My fianceè would come home crying, complaining, and fuming every time she went over because he wouldn't stop walking all over her feelings. Her mom doesn't help much, unfortunately. She moreso makes excuses for his behavior, chief among them being \"he just doesn't understand.\" Which I find laughable. \n\nBeing the father of the bride, he is supposed to give a speech at our upcoming wedding. I told him recently we don't think that would be a good idea. When he asked why, I told him about how the way he's been treating my fiancee has worried us enough to warrant our decision. He said I was being arrogant and conceited, and I told him I didn't care what he thought about it, that was his daughter's decision. He was furious. He started calling me names and lying about his behavior, saying he had no idea what I was referencing, and that he had never been that way toward her. I wove through his bullshit and told him we had had enough, and that if he didn't apologize to her by the month of our wedding, then he wouldn't be allowed to walk down the aisle, either. He said that wasn't fair, and I told him again that I didn't care what he felt. He said he was incredibly hurt by all this, and I again got to tell him that I didn't care. He said he wanted to speak with my fianceè, and I told him that her decision was that they would have any contact until he agreed to apologize. \nHe has since made it clear that he absolutely will not apologize. His wife and I have called a few times, and she's come over to our place to talk, and she's said that he's dug his heels in, and won't apologize unless I'm not there with my fianceè. That's not the way my fianceè wants it, so that's that. His wife has said that she feels like she's caught in the middle, which I appreciate. I know it's not easy. I told her \"it's this simple. He can either have his ego, or he can have a relationship with his daughter. You're watching him make that decision right now. He can come and apologize any time.\"\n\nThings have been a little tense since. Obviously. \n\nSo my dad is going to give the speech. He is not only supportive of our relationship, but him and my mom are both over the moon about my fianceè. Thing is: if her dad never apologizes, which seems to be the likeliest case, then what do I tell people who ask why her dad isn't walking her down the aisle, or why he isn't giving a speech? Furthermore, how do we proceed after the wedding? Do we go no contact? How does that even work? What kind of boundaries do we set? What do we do if he just shows up one day? Or corners her at her work? \n\nFor anyone who would like to interject that we're in the wrong, or that we should just give in and let him have his speech and walk down the aisle: fuck off I could not care less about any of that. If he needs consequences in order to learn how to treat his daughter, that's his problem, not mine.",
            "spoiler": false,
            "stickied": false,
            "title": "my fiancee's father (50sM) is refusing to apologize for his behavior. It's starting to drive a wedge between everyone.",
            "upvote_ratio": 0.92,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlxn49/my_fiancees_father_50sm_is_refusing_to_apologize/"
        },
        {
            "author": "u/foxfire1123",
            "created_utc": "03-24-2022 05:17:41",
            "distinguished": null,
            "edited": false,
            "id": "tlxggh",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlxggh",
            "nsfw": false,
            "num_comments": 107,
            "permalink": "/r/relationship_advice/comments/tlxggh/she_is_63_i_am_511/",
            "score": 51,
            "selftext": "Hey all, as the title says. This is the first time I am dating a woman who is taller than me. I am feeling a weird in all honesty. \nNeed your suggestion/ opinion as how to get past that feeling.",
            "spoiler": false,
            "stickied": false,
            "title": "She is 6’3” I am 5’11”",
            "upvote_ratio": 0.82,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlxggh/she_is_63_i_am_511/"
        },
        {
            "author": "u/TenderTruth999",
            "created_utc": "03-24-2022 07:52:28",
            "distinguished": null,
            "edited": "03-24-2022 08:01:45",
            "id": "tlztde",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlztde",
            "nsfw": false,
            "num_comments": 100,
            "permalink": "/r/relationship_advice/comments/tlztde/my_mom_is_cheating_on_my_dad_what_do_i_do/",
            "score": 27,
            "selftext": "They have been married for like 23 years.\n\nMy younger brother saw a sus text and when into her phone and saw she is cheating. He has photos of the texts. He found out 5 days ago and told me.\n\nI go back to college in 4 days so I have 4 days to do something. My brother already left for college so I will have to be the one to tell him.\n\nTheir relationship seems fine. My dad is busy due to him traveling for work and stuff so my mom is lonely, but I never thought she had it in her to cheat.\n\nI am hesitant as hell to tell him because he doesn't handle stress well and is already pretty stressed. My brother thinks my dad has a hunch my mom is cheating or being sus because he has made comments about not knowing where she is/how she isn't home.\n\nIt still feels surreal to me. The illusion I had that my parents were a happy couple and werent doing anything bad is shattered. Like we still go out to dinners, hang out, talk, they go on trips together occasionally, but knowing what my mom is doing makes me feel unclean and fake.\n\nEDIT: Okay so a lot of you are telling me I should tell my mom first. I have read lots of reddit/quora posts and have spoke to some friends and they said to tell my dad. Its honestly about 50/50 though. Like I want to tell my dad because I dont want to betray him but at the same time my brother and I should have never known this and it is my parents relationship but I dont want to betray my dad by not telling him. ",
            "spoiler": false,
            "stickied": false,
            "title": "My mom is cheating on my dad, what do I do?",
            "upvote_ratio": 0.88,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlztde/my_mom_is_cheating_on_my_dad_what_do_i_do/"
        },
        {
            "author": "u/ProfessionalFood8435",
            "created_utc": "03-24-2022 09:26:42",
            "distinguished": null,
            "edited": false,
            "id": "tm14sr",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm14sr",
            "nsfw": false,
            "num_comments": 15,
            "permalink": "/r/relationship_advice/comments/tm14sr/my_24f_best_friend_ended_a_friendship_with_me/",
            "score": 17,
            "selftext": " \n\nI didn't know that he had liked me. We used to flirt with each other a lot, but I never took it seriously. Though we were just humoring each other. He never showed me that he had serious intentions. And also I never thought to be his type. His previous girlfriends look nothing like me.\n\nRecently, I came out to him as bisexual. I knew that for a long time. I've been in an abusive relationship that made me hide this side and was shamed for it. Actually I was surprised that my best friend didn't catch up on this faster because I also never hid the truth that I had tons of crushes before. After I did it, I noticed a strange distance between us. I have not heard from him in three weeks. I assumed he was just busy before I texted him. And then I noticed how cold and unresponsive he was. Truthfully, I never saw this side of him. Like it is not my best friend anymore. I recognized something was not right. He was even dodging questions such as \"how are you?\" and speaking in tangents with me.\n\nI confronted him. What if I had done something? I am not a mind reader and even friendships require communication. And then he confessed to me that he had liked me for a long time. It's become difficult for him to control his feelings around me. But apparently, he doesn't feel very comfortable with my sexual orientation as he feels like will always have to fight for my attention. He feels like he doesn't stand a chance with me. And if anything was meant to happen it would have happened by now.\n\nWrote him that he really hurt me with what he said. Just because I am bisexual I don't go around and sleep with everybody. Out of all people he knows the best how much I struggle with intimacy and relationships. And didn't expect him to say that. He never replied to me back and last time I checked he left me on a read.\n\nI realize where his hurt might be coming from. But his reaction devastated me.\n\nTL:DR: My best friend confessed to liking me but he seems to struggle with my bisexuality. Also, he wants to end our friendship over his feelings. I don't know what to do.",
            "spoiler": false,
            "stickied": false,
            "title": "My (24F) best friend ended a friendship with me after he discovered that I am bisexual and he has feelings for me",
            "upvote_ratio": 0.85,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm14sr/my_24f_best_friend_ended_a_friendship_with_me/"
        },
        {
            "author": "u/muslimgirl6",
            "created_utc": "03-24-2022 09:54:16",
            "distinguished": null,
            "edited": "03-24-2022 12:04:28",
            "id": "tm1i1i",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm1i1i",
            "nsfw": false,
            "num_comments": 68,
            "permalink": "/r/relationship_advice/comments/tm1i1i/i_want_to_leave_islam_and_heres_why/",
            "score": 9,
            "selftext": "I want non Muslims to also share their opinion on this adbsurdness. There's nothing wrong with the religion but the people who believe in it. There might be a few things I don't believe in that's in the religion that just angers me. Here's my story. \n\nStrike 1: My parents never married and because of this I am not respected and not seen as wife material because I'm a ba**rd.  Nobody said that, but people lose interest and respect,  only my ex always said I'm a bastard and that God will give me nothing because of it.i was born in an ugly way. My father who is of Muslim descent used my mother for money and sex while seeing other women. As soon as she was pregnant, he bounced. He never sent money or even asked how I am.\n\nStrike 2: I am not a virgin. I grew up Christian since my father discarded me but had a Muslim granny who raised me so I didn't feel weird when I decided to be a full Muslim. I lost my virginity when I use to be Christian because Christian moms don't teach their kids that you should abstain from sex before marriage. They actually encourage it by saying \" just use condoms\" or \" go on the pill and be safe\". \n\nTook my oath to be a full Muslim in 2017 and have been struggling to get married since then. Muslim people don't tell you it directly but they judge you for being born out of marriage. They ask me if my parents were married because a husband won't just leave his wife and kid like that without a good reason or unless he could do it because he wasn't married. Men starts thinking less of me. They don't want to even pay mahr. It's a form of dowry paid to the father before marriage. They don't even think im worth that and it's my right to receive it. They want me to accept NOTHING, not even a ring, a dress...just marry with normal clothes. How dare they?  I did not accept this because I want a wedding. Why do they think I deserve nothing? We would argue over and over about it. I left the guy, then i spoke to another guy who refused to pay a decent amount of mahr because I was not a virgin. He didn't say so but it was quite obvious. So I might not be a virgin and I might be a bastard but I'm almost done graduating from law school and I'm pretty but this doesn't even make up for not being a bastard non virgin. You are still seen as beneath them. I'm not the type to pretend so ill never do a surgery to make myself a virgin again for a man to value me. \n\nThe only thing that will get you respected and wife worthy to Muslim men is if you are a virgin, born from married parents, religious and if you have a father around. Without a father he takes chances and takes advantage. Once they learn you're not a virgin then he will only want to talk about sex and try to use you for any kind of sexual pleasure. It's safer with a Christian man because a Muslim man will secretly marry another woman and he won't tell you. Because its his right to do. Some Muslim men really are that pathetic to do such a thing.\n\nI'm done with it all.",
            "spoiler": false,
            "stickied": false,
            "title": "I want to leave islam and here's why",
            "upvote_ratio": 0.68,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm1i1i/i_want_to_leave_islam_and_heres_why/"
        },
        {
            "author": "u/corgimomma98",
            "created_utc": "03-24-2022 05:15:00",
            "distinguished": null,
            "edited": "03-24-2022 05:54:22",
            "id": "tlxext",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlxext",
            "nsfw": true,
            "num_comments": 17,
            "permalink": "/r/relationship_advice/comments/tlxext/husband_refuses_to_help_himself_and_has_wrecked/",
            "score": 23,
            "selftext": "Rather new to Reddit, but I figured this is the best way to get an answer. My Husband(27M) and I(24F) have been married for a year and a half but have been together for 6 years overall. Since meeting sex has been limited to toy use mostly, due to his inability to keep an erection during sex. He's had this issue since we met and has continued to be a menace to our relationship. The problem lies in the fact that he can masturbate, self pleasure has never been an issue. At the start of our relationship he had made an attempt to have sex with me but in the last year we attempted twice and unsuccessful both times. At one point he went to his doctor and they did blood tests, all coming back normal, and he was told that there was nothing wrong with him. I've discussed this with my very sex positive mother and sister who suggested that it may be something mental causing him issues. I agreed as he and I both struggle with depression and anxiety that it may be due to that. When I broached the topic with him it was rather brutal. I let him know that I loved him no less but it was becoming an even more prominent issue. That was about two years ago. \n    Now we came to a head last night when I came home from the gynecologist, I spoke to her about our intimacy issues and my lack of sex drive due to the issues. She prescribed me a new anti-depressant to assist with my moods and my libido. She also encouraged me and my husband to possibly reach out to a counselor. I took her word and she sent me on my way with a list of recommendations and when I got home I had a discussion with my husband that was rather one-sided. I told him that I discussed everything with my doctor and what she had suggested and he completely shut down. He didn't yell or lose his temper. He just told me he wouldn't go to a therapist and stopped talking. We didn't talk for the rest of the evening. When we woke up today he acted like nothing was out of the ordinary and asked me when I'd like to leave to spend time out of the house. I accepted that he wasn't ready to talk yet and we spent a nice day out. But when we got home. I mentioned it again and the results were a little more cold. He said that he would go to the doctor and get something prescribed to him and said that he wouldn't go to a therapist again. Citing that he went to a therapist as a child and that it wouldn't help. Saying that therapists just get paid to pretend to listen. That it was too expensive and wasn't worth anything. I expressed that money isn't an issue as I have him on my insurance and even offered to pay for the copays but he turned over and went to sleep. Cutting the conversation off completely. \n    I'm officially at a loss for what to do. I've attempted every avenue that I've been suggested and can't figure out the next steps. I love this man with all my heart, and yet the intimacy that we lack is breaking down my self-esteem and leaving me emotionally distraught. If you have any suggestions, I'm willing to listen. Is there anything else I can possibly do to aid in fixing this before my marriage comes to an ultimatum?\nTLDR: My husband with erection issues isn't willing to get help to have sex with me.",
            "spoiler": false,
            "stickied": false,
            "title": "Husband refuses to help himself and has wrecked me emotionally.",
            "upvote_ratio": 0.83,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlxext/husband_refuses_to_help_himself_and_has_wrecked/"
        },
        {
            "author": "u/RoninGangster1219",
            "created_utc": "03-24-2022 00:35:58",
            "distinguished": null,
            "edited": "03-24-2022 01:12:15",
            "id": "tllkui",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tllkui",
            "nsfw": true,
            "num_comments": 44,
            "permalink": "/r/relationship_advice/comments/tllkui/found_racy_fb_messenger_texts_from_my_gf_of_5/",
            "score": 47,
            "selftext": "M37, FM 34.She was showing me something on uer phone, when an alert popped up from a guy I've never heard of. When I asked who he was, she freaked and tried to snatch the phone back. Ohhhhhhh noooooooon Ya don't! Off to the bathroom, locked the door, and atarted recording as I scrolled. I'm not proud of that, I just knew she'd never giv n me that look before, and the look... was horror. She's BEGGING me to give her her phone so ahe can \"leave,\" but it was hc she knew once I started digging, I'd be disgusted. She's telling one guy that I never sleep with her, another one she's saying she walks around without pants on, and I don't even notice. But the worst one was, she sent a picture of her in Lingerie, and he returned a photo of what I'm assuming is, his dick. This was a qeek ago. Since, she's deleted all SM. She's been leaving Post it notes all over the place saying please don't give up on me, and I'm so very sad that I hurt you. I think it would still be going on if I didn't catch her. She said she wouldn't have kept doing it but that she wouldn't have told me about it either. So I didn't particularly like that answer either. I trusted this girl and would tell my friends she's the first girl i trust with my whole heart, and she'd never fuck me over. Meanwhile, she's talking to multiple dudes about how I suck at being a BF. She has said from the very beginning that I am out of her league and she does not know what made me choose her. So, I have no idea what made her start taking me for granted and doing all this shit behind my back. It makes you wonder what she has done and I have not seen behind my back. B I told her we can try to work things out and possibly go to counseling. Where do you guys think? Is it even worth it, considering she admitted that she would have never told me about this?\n\nShe's told me to date others if I need to, to be sure about her, but that she is EXACTLY where she wants to be. SMH can't believe a word, now. She swears to God she only talked to these giys bc she knew she'd never see them.. They live in her hometown, you know, where her parents live!!",
            "spoiler": false,
            "stickied": false,
            "title": "Found racy FB messenger texts from my GF of 5 years to 4 guys, over 6 months straight.",
            "upvote_ratio": 0.89,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tllkui/found_racy_fb_messenger_texts_from_my_gf_of_5/"
        },
        {
            "author": "u/irlbunnygirl_",
            "created_utc": "03-23-2022 15:13:41",
            "distinguished": null,
            "edited": "03-23-2022 23:31:03",
            "id": "tkuuz5",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tkuuz5",
            "nsfw": true,
            "num_comments": 149,
            "permalink": "/r/relationship_advice/comments/tkuuz5/my_boyfriend_is_insecure_thinking_about_me/",
            "score": 265,
            "selftext": "[UPDATED] \n\nsmall deets : this is what i sum up, every-time we have a argument we both sit separately for a time to keep everything new & calm, this was in real life & not over text so i was a little afraid lol i don’t like confrontation, but here! \n\ni'm just uncomfortable, [bfs name]. i'm bisexual. you know this. you can say all you want, because we're together, i'm “straight”, or in this relationship i'm heterosexual. at the end of the day i'm not. my attraction to women, it won’t just disappear but just like when i’m in a relationship, currently, like now, and let’s just say i’m straight, i literally wouldn’t be able to find other guys attractive. am i straight in this situation? yes. and just because they're the opposite sex doesn't make me any less loyal to you. i DO NOT find anyone else attractive aside from you. i'm not attracted to anyone else, girl or guy. and the more you express that i'm \"straight\" just gives me this sense of being rejected. my sexuality isn't a hobby, it's not a personality trait, it's quite literally apart of my person. i don't just lose it when i meet someone. its one thing if you don't understand, and you're insecure and afraid i'll cheat on you with a girl, but it's something else entirely like if you KNOW i wont cheat on you and you're just being insecure. \nand it has me worried because if i was straight, maybe you’d be over cautious of me looking at other dudes but because i’m not, you’re like this. \n\nhis response went something like this: \n\n\nand i hear you and i’m sorry for making you believe like i’m rejecting you, i accept all of who you are and i think i feel comfortable to tell you i’m just insecure about it, not about you being interested in girls inherently but just the fact there’s more people out there that can do what i can’t for you, emotionally or mentally, and that bugs me even though i try my hardest in other ways to figure it out whether it’s my trauma alone or something else, and i never expected you to really say anything honestly i’m sorry. \n\nand i got irritated because he thought i would just let it slide, he talked about it twice before i asked if he could stop and he ignored it -.- \n\nso, yes, not the greatest but here we are. \n\n\n——————————————————\n\nmy boyfriend (17M) and i (17F) have been together for a little over 5 months. I am bisexual, with my attraction to people unlimited but my ability to actually have anything sexual involved EXTREMELY limited. i feel as though i HAVE to have some sort of emotional connection with them, and a lot of non-sexual intimacy. he understands that, and respects it, somewhat. i expressed these things didn’t just apply to my heterosexual relationships, like mine and his but also in my homosexual relationships, hence why i’ve yet to actually do the deed with anyone. and a million times over this man is CONSTANTLY telling me “yes well, you aren’t gay anymore because you’re with me.” and i expressed to him that it doesn’t matter that i’m with him or not, my attraction is to him, and i love him, and there’s no reason for you to feel like because i’m bisexual, and i’m with you, i’m “straight now.” and i asked him if he was insecure & believed if i would leave him for a girl, and he didn’t bother answering. \n\nit’s just mentally exhausting. i love him, and he’s amazing in other ways. i’m not hitting on girls, i don’t talk to girls in that way, i don’t actually feel any attraction for anyone else but him. i feel like i’m being pushed back into the closet, honestly. i just want to be myself and knowing he rejects a part of me is very tiring. \n\nplease, any advice could help. It’s becoming annoying if every two seconds he’s constantly wondering about my homosexuality or how he asked me if i was staring at a girls ass.\n\n\nanother update !! (2)\n\ni brought up to him how this all made me feel, in more detail and that itself got a slight rise out of him, he pulled the “so im not trying enough, i can never be enough” shit and i said that was it, if he keeps acting like a actual child at his VERY functioning age, (by that, i mean the basics of consideration and owning your bullshit when you pull it.) then there’s no reason for me to waste my time, im not raising a child and i refuse to be some kind of educator for shit he already knows and refuses to put into our relationship. it’s one thing if he’s asking and wants more feedback or help on his mental health but this is literal manipulation and he’s failing terribly. He has his head stuck up his ass, so i said that to kind of pull him off his pedestal and now he’s embarrassed and sitting alone, so i don’t know if i should feel bad or not, honestly. not for telling him about himself, i think i could’ve said it less vulgarly. i didn’t call him any names but just describing it now on reddit i definitely changed some of the words to less.. rude ones.",
            "spoiler": false,
            "stickied": false,
            "title": "my boyfriend is insecure thinking about me *actually* being my sexual orientation",
            "upvote_ratio": 0.83,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tkuuz5/my_boyfriend_is_insecure_thinking_about_me/"
        },
        {
            "author": "u/Saul509",
            "created_utc": "03-24-2022 02:46:13",
            "distinguished": null,
            "edited": false,
            "id": "tlt2us",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlt2us",
            "nsfw": false,
            "num_comments": 192,
            "permalink": "/r/relationship_advice/comments/tlt2us/i_dont_want_my_daughters_girlfriend_to_move_into/",
            "score": 29,
            "selftext": "I (50M) and my wife (38F) have an 18 year old lesbian daughter. My daughter has a two year daughter herself, which of course requires lots of time and work taking care of. I don’t know who the father is, but my daughter said her pregnancy was planned and she always wanted to be a mother. I actually respected this, even if having a baby at that age is way too young. \n\nBut whatever, the baby was born, and my daughter was excited to be a mother. At this time, I assumed she was straight (for obvious reasons) but my daughter started hanging out with other girls at her high school, and I realized she didn’t want to be with men.\n\nAt first I wasn’t as accepting, but my wife convinced me there is nothing to worry about. But my daughter started to openly date a girl, which I also didn’t approve of at first (my daughter was still underage). Even at this time, I still wasn’t sure my daughter was lesbian, but after I went on her social media, I saw that she posts a lot of LGBT stuff. I then realized her friend was actually her girlfriend too.\n\nThis girlfriend is the same age as my daughter, and I think she’s nice, but I find it weird she wants to be with someone who has a kid. I also never met a lesbian couple before, and I never expected the first to be my daughter and her girlfriend. \n\nWell now that both of them are in college, (which I pay for), my daughter wants the girlfriend to move in, but I’m not sure. They mostly want to live together to take care of the baby, but I’m not sure that’s a good idea. My wife said it’s not a problem, but I don’t think she understands. Right now, my daughter thinks her girlfriend is moving in, but I’m not sure how to tell her I don’t exactly approve of that. I rather my daughter focus on school, than a relationship right now. My wife disagrees with me.",
            "spoiler": false,
            "stickied": false,
            "title": "I don’t want my daughter’s girlfriend to move into our house, but my wife insists she moves in anyway.",
            "upvote_ratio": 0.7,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlt2us/i_dont_want_my_daughters_girlfriend_to_move_into/"
        },
        {
            "author": "u/morganu101",
            "created_utc": "03-24-2022 06:35:47",
            "distinguished": null,
            "edited": false,
            "id": "tlyp69",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlyp69",
            "nsfw": false,
            "num_comments": 16,
            "permalink": "/r/relationship_advice/comments/tlyp69/how_do_i_stop_forming_a_crush_on_every_guy_who/",
            "score": 15,
            "selftext": "19F if that counts. Been this way all my life.",
            "spoiler": false,
            "stickied": false,
            "title": "How do I stop forming a crush on every guy who gives me attention?",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlyp69/how_do_i_stop_forming_a_crush_on_every_guy_who/"
        },
        {
            "author": "u/IamMagicarpe",
            "created_utc": "03-24-2022 07:34:15",
            "distinguished": null,
            "edited": "03-24-2022 07:58:51",
            "id": "tlzkbz",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlzkbz",
            "nsfw": false,
            "num_comments": 15,
            "permalink": "/r/relationship_advice/comments/tlzkbz/what_would_you_do_25_year_old_mooching_adult/",
            "score": 13,
            "selftext": "My girlfriend’s 25 year old stepsister still lives with her parents (which in and of itself is not bad). \n\nShe dropped out of high school. She also has an 8 year old and a 2 year old, works just part time, and smokes weed every day and goes out partying. She brags about getting “faded” and always hangs out with super loser people (like herself) who have nothing going for them. \n\nShe helps a little bit with rent (like $200 a month) but doesn’t do anything to try to actually be independent. I saw her win money on a scratcher and immediately go buy a bong with the winnings. It’s so frustrating. The fathers of the two kids don’t help at all. She absolutely cannot afford to live on her own and honestly, is about as mature as a high schooler when you talk to her. I wouldn’t be surprised if she’d end up homeless. \n\nI feel that the parents enable her by allowing this. Apparently they’ve threatened to kick her out, and then she says she’ll take the kids and they’ll never see them again, so they give in and let her stay. What the hell does someone do in this situation? I feel so terrible for my girlfriend’s mom and stepmom because they are older and should be enjoying being empty nesters, but instead they just had to get a bigger house to hold the daughter and her 2 kids. I can’t even fathom what the right move here is for the parents stuck with this mooching child. What would you do if this was your kid mooching off you but with these circumstances.",
            "spoiler": false,
            "stickied": false,
            "title": "What would you do? 25 year old mooching adult daughter with 2 kids.",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlzkbz/what_would_you_do_25_year_old_mooching_adult/"
        },
        {
            "author": "u/brew2you",
            "created_utc": "03-24-2022 05:33:57",
            "distinguished": null,
            "edited": false,
            "id": "tlxq84",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlxq84",
            "nsfw": false,
            "num_comments": 8,
            "permalink": "/r/relationship_advice/comments/tlxq84/ive_been_single_for_a_year_now_i_think_ive_grown/",
            "score": 13,
            "selftext": "Anyone else feel like they just aren’t motivated to go out and date? Like…ugh…it’s so much effort. I know I need to ‘put myself out there’ and ‘meet new people’ but I just can’t get myself excited to go out anymore. My girlfriends all have boyfriends so maybe it’s just me being the token single friend, but whatever happened to “you’ll fall in love when you least expect it”. Like…I’d like to cash that in now please…",
            "spoiler": false,
            "stickied": false,
            "title": "I’ve been single for a year now. I think I’ve grown complacent.",
            "upvote_ratio": 0.89,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlxq84/ive_been_single_for_a_year_now_i_think_ive_grown/"
        },
        {
            "author": "u/Gorilla-smegma",
            "created_utc": "03-24-2022 07:57:49",
            "distinguished": null,
            "edited": false,
            "id": "tlzvzr",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlzvzr",
            "nsfw": false,
            "num_comments": 13,
            "permalink": "/r/relationship_advice/comments/tlzvzr/i_24m_told_my_girlfriend_24_i_dont_want_to_live/",
            "score": 7,
            "selftext": "When we got together our sex drives matched perfectly and, if anything, I was having a hard time keeping up with her. Nowadays though she rarely if ever wants to do anything sexual at all and it’s honestly killing my sex drive even when I’m not with her. Like before I could at least pleasure myself but now I don’t even want to do that. I’ve talked with her about this several times and she usually improves for like a month before going back to the same thing. I told her today that I felt like this was a dead bedroom, and she agreed, and then told her I don’t want to live out the rest of my life like this to which she responded that maybe I should go find someone else. This obviously bothered me and I just hung up and I’m completely not even sure what to think at this point",
            "spoiler": false,
            "stickied": false,
            "title": "I [24m] told my girlfriend [24] I don’t want to live in a dead bedroom for the rest of my life and she told me to find someone else",
            "upvote_ratio": 0.74,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlzvzr/i_24m_told_my_girlfriend_24_i_dont_want_to_live/"
        },
        {
            "author": "u/Cuppycake191219",
            "created_utc": "03-23-2022 17:30:11",
            "distinguished": null,
            "edited": "03-23-2022 17:33:38",
            "id": "tkzjwf",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tkzjwf",
            "nsfw": true,
            "num_comments": 349,
            "permalink": "/r/relationship_advice/comments/tkzjwf/my_bf_watches_porn_behind_my_back/",
            "score": 115,
            "selftext": "I really need any advice possible. Me (20f) and my boyfriend (23f) have been dating for 2 years. And for all this time I thought we had the most perfect and amazing relationship. Yes, we’ve had our ups and downs but it’s been good. He spoils me so much and sends me sweet good night messages every night. \n\nYesterday i was using his phone to google something and i noticed that he logged out of his google account again. He does this all the time and although i was suspicious of this, i didn’t think much of it. But from yesterday, I wasn’t able to shake this feeling off that maybe he watches porn. \n\nAt the beginning of our relationship we came to the agreement that porn is a no-go for both of us because it counts as “emotional cheating”. Honestly, I don’t really care if he does, but I’d wanna know that. \n\nToday we had a small argument because i asked him why he always logs out. He got really defensive and started to tell me that i was trying to accuse him of watching porn although he hasn’t for 2 years. So i told him to prove it. I asked him if i can get his gmail and password to log in and he gave it to me and called me psycho. \n\nI logged in only to see that this past week he watched porn on 3 different days. Most days were when we actually had sex. One of those days he watched, we were getting intimate and ended up recording a video of him going down on me (with my consent, although he asks me if he cab record because he “doesn’t ever watch porn and needs something to get off to”). \n\nIt honestly feels disgusting to me that he has been getting off of other women behind my back and honestly makes me wonder what else he lies to me about. I genuinely wouldn’t have minded this if he had told me that he does on the occasion. He has a history of lying till he gets caught and I really thought that he stopped lying too. I honestly feel so stupid.\n\nI need advice on what i should do. I don’t feel like breaking up with him but i keep thinking about how he’d do something behind my back that i thought wasn’t okay, and then would send me his stupid goodnight texts. He could be literally cheating on me and I’m f*cking stupid but i swear i am not. It’s just that he makes me feel like he’s the best boyfriend ever and then does sh*t like this which makes me feel guilty to even break up with him.\n\nDoes anyone have any experience on something like this? I honestly don’t have anyone to talk to and i feel so shaken up. I can’t think straight. I really do love him and i think he does too. But idk anymore… I’m literally crying about this as i type so I’m sorry if there’s any typos (english isn’t my mother tongue).",
            "spoiler": false,
            "stickied": false,
            "title": "My bf watches porn behind my back",
            "upvote_ratio": 0.64,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tkzjwf/my_bf_watches_porn_behind_my_back/"
        },
        {
            "author": "u/Cosmo_paws",
            "created_utc": "03-24-2022 09:12:35",
            "distinguished": null,
            "edited": false,
            "id": "tm0y33",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm0y33",
            "nsfw": false,
            "num_comments": 3,
            "permalink": "/r/relationship_advice/comments/tm0y33/i_32f_am_engaged_to_marry_my_partner_36m_this/",
            "score": 6,
            "selftext": "So the title pretty much conveys a lot of what this is about. \n\nMy partner has problems with mental health, feelings of inadequacy, self confidence issues, anxiety, borderline depression. We've been together 3 years and he popped the question 2 years ago. Where I think the issues stem from my family's side is down to our finances. He has struggled to secure permanent reliable pay since day 1. We are reliant on my wages and support from his family with our outgoings. Naturally, I appreciate where my folk's concerns stem from.\n\nMy argument to continue with the relationship is because of our feelings for each other. Finances are crap, but we are genuinely happy together! Yes, having him in employment would relieve some stresses, but being with someone who loves me in return, accepts my flaws and compliments them, doesn't undermine, belittle, hurt, abuse... as I have had in the past from partners... is such an incredible feeling. I know I want to spend the rest of my life with this person!\n\nYesterday, I had a conversation (via messenger) from a long time friend of my family (college friend of my mum's). Who informed me that he had heard only their side of the story but believed I deserved better. That my partner would never change. That I had more class than my partner and his family. You get the general idea. \n\nNaturally, this screamed to me that my parents have been slating my choice in partner from the offset to this close friend of the family and hadn't shared a single good thing about them. I've updated my dad on this conversation and he has contradicted what this friend has said by indicating he believes there's so much more to my partner than  my partner realises. That if I'm happy, they're happy. \n\nMy sister is insistent on getting to know my partner better, so much so we are planning excursions so she can get a better idea of who my partner is and act as a go between for my folks and him! I have received so many mixed messages that I am now reluctant to encourage my partner to go over to my parent's place, because why should I? Why should I put him through this rigmarole of judgment? He's already judging himself 24/7, why should I add to that with my parents judgment? The worst of this is that in turn, I am accused of vilifying my parents who are only trying to help - which again, I get!\n\nI'm hurting right now, as I don't know what to think. I want my parents to see me happy, as I am. To see the partner I'm with the same way that I see him. They just cannot seem to get past the financial strife. Each time I talk with them, there's always that moment in the conversation where tones change and sincere concern takes over \"how's the job situation? Or do I daren't ask?\" I'm exhausted, and right now the irony is, this exhaustion is stemming from their concern, not from my partner's financial woes.\n\nApologies for unloading, I just needed to get it off my chest.",
            "spoiler": false,
            "stickied": false,
            "title": "I (32F) am engaged to marry my partner (36M) this year - I don't think family approve...",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm0y33/i_32f_am_engaged_to_marry_my_partner_36m_this/"
        },
        {
            "author": "u/cobrakaidye",
            "created_utc": "03-23-2022 20:53:08",
            "distinguished": null,
            "edited": false,
            "id": "tlar40",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlar40",
            "nsfw": false,
            "num_comments": 48,
            "permalink": "/r/relationship_advice/comments/tlar40/wife_and_my_bf_initiating_an_opportunity_for_an/",
            "score": 57,
            "selftext": "First time posting here and looking for advice and unbiased views.  Quite a long story so will try to be as brief as possible.\n\n\nJanuary 2021 I was working away from home training for my new job and coming home at weekends.  My wife started to watch a show on Netflix where some of the couples were indulging in threesomes.  She said she found this a turn on and suggested that it should be something we could maybe try.  Me, her and another female.  I wasn't too keen in the idea but said I'd think about it.  We never really discussed this in great detail as unfortunately she became poorly with depression and seizures from her epilepsy so was spending time in and out of hospital. \n\n\nWhen she became better we never raised the possibility of a threesome again until she mentioned that she'd spoken to her friend about sleeping with me and her watching.  I thought this to be quite strange as my wife has always been quite the possessive and jealous type.  She asked if I'd like to and again I said I'd think about it.  One night I came home from work and she told me she had sent a dick pic to her friend on snapchat.  I was quite surprised that she had done this and quite mortified and slightly embarrassed. The thing that got me thinking was that her friend asked of it was a picture of me.  My wife told me this.\n\n\nAs I thought more about what her friend had said I started to wonder why she would query if it was me.  I knew my wife was talking a lot on snapchat with my 'best friend' as she would tell me.  This started to make me feel really paranoid as I started to notice her presence on there in the early hours and late at night.  Not letting her phone out of her sight which was unusual behaviour for her.  This continued for a number of months and she kept pushing at the possibility of me and her friend getting it on.  I kept saying I didn't feel like it.  She then said about maybe joining a swinging club or maybe explore the possibility of having an open relationship. I just couldn't help but think that she was urging me to sleep with someone else so she could use it as an excuse to get with my friend.\n\n\nThere has been a history between them from 2015 when I found out they were sharing intimate chat and some images.  She insisted it was banter on her part and agreed that it would stop.  We managed to rebuild a friendship with him and his wife a number of years later.\n\n\nAnyway in October this year my wife and her friend had a fall out over a trivial matter about them meeting up for a meal and her friend wanted to bring another friend along.  My wife got really upset at this and decided not to meet.  My wife tried to rekindle their friendship and they got into an argument via whatsapp whilst I was at work.  I only knew of this when my wife sent me a number of messages pleading for me to call her when I got a chance.  I thought this was an emergency so called her back.  All she wanted was to tell me about her argument and asked me to block her friend on all channels as she's worried that she may stir things up.\n\n\nA month later in early November my curiosity got the better of me and my gut instincts were telling me that I should talk to her friend.  Basically her friend confirmed what I was thinking.  She told me that my wife only wanted to sleep with her so it could be used against me in the future so she could go with him, that when we've stayed over they've both been downstairs whilst me and his wife were still sleeping and touched each other.  She said my wife didn't love me anymore and loved him and even spoke to him about whether they could work.  He said no but he would like to have a physical relationship to which she apparently got excited about.\n\n\nI challenged my wife about how I was feeling, what her old friend had said and also how it looks.  She denied it but I'm struggling to believe her.  We've not had much opportunity to discuss as this has bought her depression and seizures back.  The depression and seizures have been continuously cycling through since this revelation and I am struggling to get into a position where we can seek a resolution.",
            "spoiler": false,
            "stickied": false,
            "title": "Wife and my BF initiating an opportunity for an intimate relationship.",
            "upvote_ratio": 0.83,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlar40/wife_and_my_bf_initiating_an_opportunity_for_an/"
        },
        {
            "author": "u/hansanisbae",
            "created_utc": "03-24-2022 07:25:48",
            "distinguished": null,
            "edited": false,
            "id": "tlzfwq",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlzfwq",
            "nsfw": false,
            "num_comments": 11,
            "permalink": "/r/relationship_advice/comments/tlzfwq/ever_get_a_gut_feeling_your_partner_isnt_the_one/",
            "score": 9,
            "selftext": "Lately I've been feeling like maybe my boyfriend isn't the one for me. My boyfriend (27) and I (25) have been dating for 2 years now. I get this gut feeling every once in a while telling me that maybe my bf isn't the one but then I end up stopping myself from thinking that way cause I can't see myself without him in my future. We talk about kids and marriage and see it in the future for the both of us. I really want him to be the one but I also can't help but be afraid that I might be making a mistake. \n\nI remember how great he treats me and how he accepts me for who I am but then I keep getting this nagging feeling in my stomach that tells me he might not be the one. I then start feeling guilty for feeling this way and I honestly don't want to feel this way. Is it really a gut feeling or more anxiety? Anyone else feel like this before? Any advice?\n\nTldr; I get a gut feeling that my boyfriend isn't the one even though he treats me wonderfully.",
            "spoiler": false,
            "stickied": false,
            "title": "Ever get a gut feeling your partner isn't the one?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlzfwq/ever_get_a_gut_feeling_your_partner_isnt_the_one/"
        },
        {
            "author": "u/idkwhat2d021",
            "created_utc": "03-24-2022 00:25:50",
            "distinguished": null,
            "edited": false,
            "id": "tlkvxy",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlkvxy",
            "nsfw": false,
            "num_comments": 24,
            "permalink": "/r/relationship_advice/comments/tlkvxy/my_20f_boyfriend_21m_cheated_and_thinks_its_okay/",
            "score": 28,
            "selftext": "TL;DR: I suggested an open relationship at the beginning of our relationship, boyfriend said no. He just slept with another girl and is now saying that we should have an open relationship. \n\nI’ve been with my boyfriend for 8 months at this point. We don’t live together or anything but do spend a lot of nights with each other. \n\nA little over a month into our relationship, we had the exclusivity talk. I said that I would be okay if he preferred an open relationship. I had a couple reasons for that. First of all, I have a much lower sex drive than him and so he usually initiates. I care more about our emotional investment so as long as he didn’t begin an emotional affair, I was fine with him having his needs met with other girls. I didn’t want him to come to resent me just because I wasn’t always in the mood for sex. Second, open relationships just make sense to me. Growing up, I saw a ton of relationships end because of cheating and at this point it just seems inevitable to me. I would rather not stress about being cheated on and figured that I wouldn’t have to worry if I just let him sleep with other people. Basically, I wouldn’t have to worry about him having an affair because we would have clear boundaries and he wouldn’t have to be nervous about “slipping up.” \n\nHe shut down the idea of an open relationship. He said monogamy was very important to him. He even went on to say he would have difficulty trusting me after I suggested an open relationship because he worried I would cheat. I assured him that wouldn’t happen, I just wanted to make sure his needs were fulfilled. Things settled down and we decided to be exclusive. \n\nI thought that was the end of that until yesterday. He came over for the first time in a week (he had said he was really busy with classes). He told me he changed his mind and wanted an open relationship. I immediately asked him what had changed. He said he thought more about it and it seemed like a good idea. This was literally months after we talked about it so I was sus. I pressed and he eventually admitted he met a girl while at the bar with his friends and she ended up spending the night with him after he told her he was in an open relationship. \n\nI started crying and he became defensive. He said that he didn’t think it was that big of a deal since it was what I wanted. I said it’s what I wanted because I wanted to prevent this from happening! Now my trust is broken and I feel terrible. \n\nI kicked him out but he was calling me all night and leaving voicemails. He kept saying it wasn’t that big of a deal and I don’t care about monogamy so I shouldn’t be upset. He even said I could “go sleep around like I always wanted.”\n\nI feel like trash and can’t decide what to do now. Do I talk it out with him? Do I just open up the relationship? Is this my fault for suggesting an open relationship in the first place?",
            "spoiler": false,
            "stickied": false,
            "title": "My (20f) boyfriend (21m) cheated and thinks it’s okay because I once said I would be fine with an open relationship",
            "upvote_ratio": 0.82,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlkvxy/my_20f_boyfriend_21m_cheated_and_thinks_its_okay/"
        },
        {
            "author": "u/dappernutcrusher_",
            "created_utc": "03-24-2022 09:36:07",
            "distinguished": null,
            "edited": false,
            "id": "tm19dh",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm19dh",
            "nsfw": false,
            "num_comments": 1,
            "permalink": "/r/relationship_advice/comments/tm19dh/i_think_ive_been_a_toxic_friend_and_i_need_advice/",
            "score": 5,
            "selftext": "I’ve been friends with my friend (19M) for essentially my whole life- but we had a period where we got very close as friends this past year. Then he sort of withdrew and I freaked out because I didn’t understand what was happening- there were a lot of reasons the distance happened that weren’t related to me at all- but it lead me to reflect on some of my behaviors as a friend, which is what this post is about.\n\nI had (have) a tendency to be narcissistic once I’ve found someone I really like- in the sense that I am that friend that’s always sad/upset about something/sensitive. I do my best to keep it balanced when I catch myself- not rely on my friend to comfort me, and make sure I’m asking about his life and if he’s okay. He’s not the type to share. Maybe he didn’t feel comfortable? Or maybe it’s just his personality. Likely both, but either way it lead to me over sharing/dumping and him listening.\n\nAlso I have a huge fear of change. I’m actively going to therapy now, but I wasn’t at the beginning and looking back I see how a lot of times when my friend brought up new ideas I would react oddly/tensely/somewhat negatively. Im ashamed to look back and see how negative (and somewhat possessive) I was.\n\n\nThings between us are starting to go back to normal, but I want to make up for how I was. I want to be a good, healthy friend and support system for him. I don’t want him to have to walk on eggshells around me because my feelings are easily hurt, and I don’t want my immediate stress reaction to things to stop me from full heartedly supporting his new plans and ideas.\n\nI also, more selfishly, want to go back to feeling like I’m important to him and like we are close friends again. But more than that, I want him to be happy\n\nI don’t know how to tangibly work through my stress in the moment without him picking up on it. I don’t know how to build up that trust that I can be reliable- or if in his mind I’m permanently going to be who I was a year ago. I could really use some advice.\n\nTLDR: I have a good friend and I have been draining to be around. I’m trying to change, and I want to be close to my friend again. I need tangible advice on how to change, and also how to make my friend feel supported.",
            "spoiler": false,
            "stickied": false,
            "title": "I think I’ve been a toxic friend and I need advice on what to do",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm19dh/i_think_ive_been_a_toxic_friend_and_i_need_advice/"
        },
        {
            "author": "u/butterflysofi",
            "created_utc": "03-24-2022 03:56:45",
            "distinguished": null,
            "edited": false,
            "id": "tlw01u",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlw01u",
            "nsfw": false,
            "num_comments": 23,
            "permalink": "/r/relationship_advice/comments/tlw01u/my_gf_hates_people_for_no_reason_and_i_dont_know/",
            "score": 15,
            "selftext": "Throwaway because she knows my real account. I [26M] have been dating my gf [24F] for 4 years, we met when she was still in college. My gf has a lot of anxiety and self confidence issues and she’s, she is also very introverted. I on the other hand am very extroverted and will talk to anyone and try making friends. \n\nI have had the same group of best friends since the 3rd grade, these people are like family to me. Now that we’re all older & have significant others, we’ve always talked about group outings, double dates and even getting together with our girls and us.  But whenever this happens my gf is always against it,  I get it she has bad anxiety, but it’s ruining our relationship for me. My friends have been nothing but nice to her & she doesn’t give them a chance, recently my best friend started dating this girl, the other day was her birthday so we were all invited to dinner & my gf didn’t want to go. When I asked why, she said it’s cause she doesn’t like my friends gf, mind you she has no reason to dislike her. They have never met or interacted, she only hates her cause she’s outgoing & would be considered attractive to most ppl. \n\nI feel situations like that aren’t fair to me.    She can’t just randomly decide to hate ppl especially people that are gonna be around, it’s weird being the guy who’s gf never comes to hang or I always have to make an excuse for. People are starting to think she doesn’t like them & I keep having to miss out on stuff cause she gets mad when I go without her. I would be a little okay with it if it was just one person but she does it for multiple people, countless times she’s hated my friends partners without ever saying a word to them, same with co workers and even my guy friends. Idk what to do here anymore I like to go out, be social, hang with my friends and their gfs too and I’d like for my gf to be there but she’s just always against it & idk. Now I worry about marrying her, if she’s just gonna randomly hate people. Is there anything I can do to get her to open up more? I love her but this is killing me \n\n\nTl;dr My Gf hates most people that are friends with me or dating my friends and it’s starting to ruin our relationship, what should I do so she’s more open to interacting and giving people a chance",
            "spoiler": false,
            "stickied": false,
            "title": "My gf hates people for no reason and I don’t know what to do anymore",
            "upvote_ratio": 0.94,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlw01u/my_gf_hates_people_for_no_reason_and_i_dont_know/"
        },
        {
            "author": "u/threwnawaychild",
            "created_utc": "03-24-2022 10:37:31",
            "distinguished": null,
            "edited": false,
            "id": "tm23io",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm23io",
            "nsfw": false,
            "num_comments": 12,
            "permalink": "/r/relationship_advice/comments/tm23io/anyway_to_find_a_new_family_as_an_adult_f/",
            "score": 4,
            "selftext": "My dad admitted to me he basicley loves his new \"Due over family\" more than having me as a child. He didnt say it but its painfully obvious i am just here for his reputation and my family wont believe me whenever i tell them what he tells me. I wanna find a new family I can join in, laugh, give gifts and such. I am already out of the house and living by myself. He never once helped me after I moved out for college and basicly only gloats about his new wife and new family\n\nI want to join in on a new family. \n\nI have issues with trust cause of my old family.\n\nMy mom is not in the picture she abandoned me when I was young. \n\nThrow away account because i overheard my father and step mom both use reddit",
            "spoiler": false,
            "stickied": false,
            "title": "Anyway to find a new family as an adult (F)",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm23io/anyway_to_find_a_new_family_as_an_adult_f/"
        },
        {
            "author": "u/alearias94",
            "created_utc": "03-23-2022 17:31:52",
            "distinguished": null,
            "edited": false,
            "id": "tkzp75",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tkzp75",
            "nsfw": true,
            "num_comments": 81,
            "permalink": "/r/relationship_advice/comments/tkzp75/should_i_stay_with_husband_or_leave_him/",
            "score": 89,
            "selftext": "My husband (26) and I (27) have been married for a year now. We have 7 week old baby. He is an officer in the military and I am teacher. It is important to note that he is miserable in the military and if he could he would get out today but end date isn’t until 2025. \n\nHere’s my problem the other day I looked thru his phone because I could feel something was off with him & naturally I’m noisy (just keeping it real lol)\n\nWell I was right because he was talking to a girl who is also in the military in a very flirtatious and disrespectful manner. They even exchanged a few selfies. My husband went on to tell her that he wants to see her in a thong walking towards him and that he is single. DID I MENTION WE HAVE A 7 WEEK OLD!!!! \n\nWhen I asked him about it he gave me the most bullshit explanation… he said he's miserable and that he talks to people including women to know where the best nails and fashion stores are for me to shop at. 😑  he said that talking to other women keeps our relationship fresh because he is able to bring new topics of conversations after conversing with them. \n\nAfter talking more he mentioned that he was never a marriage type of person but that he loves me and he needed to be married to me. 🤢 \n\nThe argument “ended” by him apologizing and telling me that I shouldn’t worry about anything because I have never been cheated on and he said that he's going to continue to do what he needs to do to get himself through life and that I shouldn't worry or ask him about it. I’m not sure what that means. \n\nI don’t know what to do everything he said was bullshit and I don’t trust me anymore but I do have love for him and we have a 7 week old…\n \nShould I leave him or try to work it out? \n\n\nI am going to start individual therapy he didn’t want to try couple counseling.",
            "spoiler": false,
            "stickied": false,
            "title": "Should I stay with husband or leave him?",
            "upvote_ratio": 0.85,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tkzp75/should_i_stay_with_husband_or_leave_him/"
        },
        {
            "author": "u/Future_Respect_4040",
            "created_utc": "03-24-2022 09:05:39",
            "distinguished": null,
            "edited": false,
            "id": "tm0um7",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm0um7",
            "nsfw": false,
            "num_comments": 8,
            "permalink": "/r/relationship_advice/comments/tm0um7/is_it_ok_to_break_up_with_my_long_distance_gf/",
            "score": 5,
            "selftext": "I (19M) really need to break up with my current gf (19F). She SA me about 8 months ago, and I guess I’ve finally realized that the only way to heal is to not have her in my life. She’s of course apologized for it, and I know she didn’t mean to hurt me. But she did hurt me. \n\nWe live almost 4 hours apart and both have busy schedules so meeting in person soon would be a nightmare. I’m worried about leaving, especially on the phone, because she’s super depressed. She’s really in love with me and emotionally dependent on me. I feel like explaining why I’m leaving will ruin her. How should I handle this? Thanks.",
            "spoiler": false,
            "stickied": false,
            "title": "Is it ok to break up with my long distance gf over the phone?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm0um7/is_it_ok_to_break_up_with_my_long_distance_gf/"
        },
        {
            "author": "u/Busy_Construction_39",
            "created_utc": "03-24-2022 11:47:23",
            "distinguished": null,
            "edited": false,
            "id": "tm33pp",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm33pp",
            "nsfw": false,
            "num_comments": 9,
            "permalink": "/r/relationship_advice/comments/tm33pp/my_gf_have_made_a_dating_profil_behind_my_back/",
            "score": 3,
            "selftext": "I have been with My gf for 3 years now, at the end of last year we had a rough time, with a lot of bad communication and no sex. Last month i found out, she made a dating profil, where she days the she is single, it really hurt me, and made me feel unsecure. When i confronted her with it, she said that she have never meet anyone from there, and she only made it cuz she needed to feel like she was attractive and desirable. But it still hurts and make me feel like in not enough for her. Sorry for the english, not My native tounge.",
            "spoiler": false,
            "stickied": false,
            "title": "My gf have made a dating profil behind my back.",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm33pp/my_gf_have_made_a_dating_profil_behind_my_back/"
        },
        {
            "author": "u/Connect-Dentist-2410",
            "created_utc": "03-24-2022 09:46:33",
            "distinguished": null,
            "edited": false,
            "id": "tm1ect",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm1ect",
            "nsfw": false,
            "num_comments": 10,
            "permalink": "/r/relationship_advice/comments/tm1ect/how_do_i_break_up_with_my_boyfriend_whilst_i_have/",
            "score": 4,
            "selftext": "\nI feel like it’s important for me to build a stable sense of self, figure out how I want my career to go, focus on myself and my mental health before I ever can romantically be linked to anyone.\n\n\nI don’t know how to break up with him. Oftentimes we enter a cycle of me getting enraged when he denies something (for eg, he denies crossing my sexual boundaries) or when I feel like he’s lying about some things I clearly remember happening yet he says didn’t. \n\n\nHe’s really tried to support me through all this. Unfortunately I have chronic anxiety and depersonalize and lose memory a lot. I repay him by getting angry and feel like he’s a stranger who’s out to hurt me. \n\nSome part of me wants to break free from this relationship (despite the soul connection he claims we have) so I can focus on DBT and getting better. \n\n\nAny advice on what I should do?",
            "spoiler": false,
            "stickied": false,
            "title": "How do I break up with my boyfriend whilst I have BPD?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm1ect/how_do_i_break_up_with_my_boyfriend_whilst_i_have/"
        },
        {
            "author": "u/theclarence7",
            "created_utc": "03-24-2022 04:44:13",
            "distinguished": null,
            "edited": false,
            "id": "tlwv7u",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlwv7u",
            "nsfw": false,
            "num_comments": 40,
            "permalink": "/r/relationship_advice/comments/tlwv7u/would_you_stay_with_someone_who_asks_you_to/",
            "score": 10,
            "selftext": "My(f) SO(m) needs whoever he is with to convert to his religion before they marry. In my head I think if someone is your person then why let something like different religions stop that? Im conflicted because it’s a big deal for me and a big sacrifice, but for him it’s end game. No conversion, no marriage, end of relationship. Would you convert for someone or expect them to convert for you? Is this too much of a big ask and a red flag?",
            "spoiler": false,
            "stickied": false,
            "title": "Would you stay with someone who asks you to convert religions for them?",
            "upvote_ratio": 0.78,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlwv7u/would_you_stay_with_someone_who_asks_you_to/"
        },
        {
            "author": "u/AgreeableLake7122",
            "created_utc": "03-24-2022 09:33:53",
            "distinguished": null,
            "edited": false,
            "id": "tm189y",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm189y",
            "nsfw": false,
            "num_comments": 3,
            "permalink": "/r/relationship_advice/comments/tm189y/i_m24_am_in_love_with_my_best_friend_f25_and_i/",
            "score": 4,
            "selftext": "We've been friends for just over 6 years now and for the majority of that time it was fun and entirely platonic. \n\n\nBut 2 years ago we had a night where we essentially did everything you could do without having sex. It was one of the best nights I can remember having but it made things uncomfortable for a little while afterwards. \n\n\nSince then I haven't been able to shake how I feel about her and in myself go back to how I felt before it. But we spend time together on nights out just me and her but I know she doesn't feel the same way because on these nights out she often finds guys she likes, gets to know them and sleeps with them. \n\n\nThere's nothing wrong with that at all and the issue is entirely mine. \n\n\n I feel jealous but put on a brave face and get through it as if I'm happy for her. But I can't do that anymore, it's killing me. \n\n\nI'm not introverted, I'm not unconfident in a lot of ways but when it comes to looking for a relationship the anxiety I feel is crippling. The most straight forward way get beyond it would be to find someone else but I'm anxious all the time and that's now extended to my friendship. \n\n\nIf I told her only one thing would happen. She'd feel uncomfortable and while I believe we'd still be friends, the best part of out dynamic would change. There'd be many parts of her life that she'd no longer talk to me about and want my advice on and we'd both lose people we regularly confide in. \n\n\nI 100% think I need space from her for my own sake but I don't know if that would take the form of a few months or longer and I being close for so long I don't want to hurt her. \n\n\nI would like advice on the most productive way to handle the situation that hurts as little as possible for me and her. \n\nTL;DR: Fell in love with my best friend and God knows it sucks",
            "spoiler": false,
            "stickied": false,
            "title": "I (m24) am in love with my best friend (f25) and I absolutely hate it.",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm189y/i_m24_am_in_love_with_my_best_friend_f25_and_i/"
        },
        {
            "author": "u/ResolutionHot73",
            "created_utc": "03-23-2022 22:27:32",
            "distinguished": null,
            "edited": "03-23-2022 22:37:38",
            "id": "tlg318",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlg318",
            "nsfw": false,
            "num_comments": 49,
            "permalink": "/r/relationship_advice/comments/tlg318/i_want_to_break_up_with_my_bf_but_he_wont_let_me/",
            "score": 29,
            "selftext": "I honestly don't know how to explain this. I feel like I've reached a point where he is very irritating. I feel like I'm settling. I don't feel happy around him, he is not affectionate, and I don't even like spending time with him anymore. The point is, I think I need to end this. But whenever I try he tries  a bunch of strategies that end up making it impossible for me to follow through. Either he makes false promises of change, never changes and the cycle continues. He also sometimes just doesn't really respond and we never reach a conclusion in the break up talk so it.. Doesn't end up happening. He has also tried to guilt me into staying. I can go on. But I don't know what to do. We need to resolve it together in order to break up semi amicably. He's not a bad guy and I care about him and his family. I just don't want to date anymore.\n\nEdit : We live together, have a 3 month cancelation period and it's extremely difficult to find housing in the city where we live. We share many things such as a car. We are also engaged.. Have been together for many years.",
            "spoiler": false,
            "stickied": false,
            "title": "I want to break up with my bf but he won't let me?",
            "upvote_ratio": 0.89,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlg318/i_want_to_break_up_with_my_bf_but_he_wont_let_me/"
        },
        {
            "author": "u/ThrowRAlastname4",
            "created_utc": "03-23-2022 09:42:28",
            "distinguished": null,
            "edited": "03-23-2022 10:49:06",
            "id": "tkph86",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tkph86",
            "nsfw": false,
            "num_comments": 199,
            "permalink": "/r/relationship_advice/comments/tkph86/my_family_shames_me_and_sees_me_as_a_traitor/",
            "score": 295,
            "selftext": "When my fiancé and I get married, I plan on taking his last name. My family is furious with me and don't want me to take his name and keep our family name. I'm an only child so according to them Is should want to keep my last name as a mark that I'm part of the family. But I don't need that..\n\nI will be building my own family with my husband and want to be fully apart of that. I want to have the same last name as him and our future children. Having the same identity as them  is important to me. So I'm definitely taking his last name because I want to do that for myself.\n\nI just don't know how to navigate this with my own family now. They will probably resent me for this. How should I best approach this situation with my famiily best?",
            "spoiler": false,
            "stickied": false,
            "title": "My family shames me and sees me as a traitor because I (26F) want to take my fiancé's (32M) last name when we get married.",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tkph86/my_family_shames_me_and_sees_me_as_a_traitor/"
        },
        {
            "author": "u/throwraaway88888",
            "created_utc": "03-23-2022 22:04:54",
            "distinguished": null,
            "edited": "03-23-2022 22:07:56",
            "id": "tlesj0",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlesj0",
            "nsfw": false,
            "num_comments": 10,
            "permalink": "/r/relationship_advice/comments/tlesj0/found_out_my_boyfriend_of_one_year_was_unfaithful/",
            "score": 28,
            "selftext": "My (22F) boyfriend (25M) had this ex FWB, “Kelly” back in college he was seeing for about 6 or 7 months a year before meeting me. They really only met up once every few months and only had sex 6-7 times during that entire period. When he was moving back in with his parents due to the pandemic, he tried to meet with her to say goodbye and she ghosted him.\n\nWhen we first got together, I had never had sex with anyone, but I had one ex boyfriend. He has had sex with many girls, which I felt insecure about. He said he was more insecure about my past relationship because even though he had sex with all these girls, none were ever his girlfriend and were just FWBs or ONSs, whereas I had an emotional connection to someone else. We made an agreement when we got together that we would delete all exes and that if one reached out, we would tell each other and not respond. \n\nFast forward to a year, we are so happy together. We travel, talk about our future, live together, and we are so in love. I am laying on his chest one day and he sends a Snapchat to his mom. He rarely uses Snapchat, so you can easily see almost every person he’s talked to and when without scrolling. I see he’s talked to Kelly within the year. I asked him why she was there, and he says he doesn’t remember. He opens up the messages, and I see that they are exchanging texts reminiscing on their time together. I immediately got upset and reminded him of our agreement. He let me read the rest of the messages and they were incredibly flirty. Calling her beautiful, saying he missed her, offering to visit, all while we had just made our relationship official. \n\nHe immediately got defensive. Told me she was just a friend, it would have been like texting any old friend from college. Told me the messages weren’t flirty at all. Told me I was being unfair. Said I wasn’t giving him enough credit for the fact that he hasn’t texted her in a year, even though when I asked he admitted if she had texted him again he would have responded. This was about six months ago, and it’s been trickle-truths the whole time. Four months ago, he finally admitted he was flirting with her. Only two weeks ago did he finally let go of the idea that he deserves credit for not texting her.\n\nHe allowed me to go through his phone (he never deletes anything) and to his credit, he never did anything like this again. But he still kept her on his friends list along with all his other ex flings.\n\nI am so hurt, and it just won’t go away. I feel stupid, like I should have just left and I’m a fool for staying. I feel anger towards Kelly (because he told her about me and sent her pictures) even though I suppose it isn’t her fault, only his. We have been in counseling the past six months, why can’t I move past this??",
            "spoiler": false,
            "stickied": false,
            "title": "Found out my boyfriend of one year was unfaithful during the first few months of our relationship",
            "upvote_ratio": 0.84,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlesj0/found_out_my_boyfriend_of_one_year_was_unfaithful/"
        },
        {
            "author": "u/styhjjjgdf",
            "created_utc": "03-24-2022 10:19:32",
            "distinguished": null,
            "edited": false,
            "id": "tm1uk5",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm1uk5",
            "nsfw": false,
            "num_comments": 2,
            "permalink": "/r/relationship_advice/comments/tm1uk5/im_so_happy_to_finally_have_a_crush_again/",
            "score": 3,
            "selftext": "I don’t even care if it’s one sided, or that we live so far apart I’m just SO happy and relieved to be feeling romantic feelings again. It’s been fucking YEARS.",
            "spoiler": false,
            "stickied": false,
            "title": "I’m so happy to finally have a crush again",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm1uk5/im_so_happy_to_finally_have_a_crush_again/"
        },
        {
            "author": "u/kawaii-ashi",
            "created_utc": "03-24-2022 03:19:34",
            "distinguished": null,
            "edited": false,
            "id": "tlv549",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlv549",
            "nsfw": false,
            "num_comments": 7,
            "permalink": "/r/relationship_advice/comments/tlv549/how_to_tell_if_you_still_have_feelings_in_a_long/",
            "score": 11,
            "selftext": "I've been with my partner for 7 years and this is the only relationship I've been in. I'm at a point where I can't tell if I still love her in a romantic sense. Her responses are always dry and boring like she's never paying attention to what I'm saying, which is understandable as she works a lot and is constantly exhausted. So I never really have fun or interesting interactions or conversations with her anymore, but there are still aspects about her that I am drawn to. I know these things logically, but I'm not sure what I actually feel. \n\nHow does it feel to still love a partner romantically after 7 years?",
            "spoiler": false,
            "stickied": false,
            "title": "How to tell if you still have feelings in a long term relationship?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlv549/how_to_tell_if_you_still_have_feelings_in_a_long/"
        },
        {
            "author": "u/Proper_Flower_7459",
            "created_utc": "03-23-2022 22:12:27",
            "distinguished": null,
            "edited": false,
            "id": "tlfa6r",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlfa6r",
            "nsfw": false,
            "num_comments": 17,
            "permalink": "/r/relationship_advice/comments/tlfa6r/how_do_i_forgive_my_husband_move_on/",
            "score": 26,
            "selftext": "Backstory: I [29F] told my husband [31M] in passing recently that I wish I had more close friends. I have plenty of friends/acquaintances, but not a ton of really close ones & sometimes it weighs on me & I feel lonely (husband is well aware of this). While he, on the other hand, has probably 12-14 guys who he considers his family & sees weekly, if not every day. \n\nSo the other day my husband & I are in a little quarrel (nothing big, more like bickering) when he suddenly says to me “sorry you have no friends.” \n\nRight when he said that it’s like the world paused. It was the lowest, most painful jab & he knew it. He apologized almost immediately but I haven’t been able to let it go. It’s been 3 days & I’m still so hurt/mad that he would take something so personal to me & use it as a weapon. I realize we all say things we don’t mean, especially in the heat of the moment, but I’m having a really difficult time moving on & forgiving him for it. Additionally I’m afraid to tell him anything in confidence anymore. \n\nHow do I move on from that hurtful comment & fully forgive him? I can barely be in the same room as him right now.",
            "spoiler": false,
            "stickied": false,
            "title": "How do I forgive my husband & move on?",
            "upvote_ratio": 0.94,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlfa6r/how_do_i_forgive_my_husband_move_on/"
        },
        {
            "author": "u/AgeRude8631",
            "created_utc": "03-23-2022 23:23:20",
            "distinguished": null,
            "edited": false,
            "id": "tlitur",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlitur",
            "nsfw": false,
            "num_comments": 73,
            "permalink": "/r/relationship_advice/comments/tlitur/a_guy_at_work_asked_me_out_on_a_date_and_i_said/",
            "score": 20,
            "selftext": "A guy from work two weeks ago asked me out for lunch and I said “no” because I suffer from anxiety (something I have suffered from for years now) and then he said “okay, take care” and then he walked away. But since that day he hasn’t spoken to me and openly avoids me at work and I feel so terrible because I know that I’ve made a big mistake. He and I had been talking to each other for about 2 months every day and we exchanged numbers but sometimes I didn’t reply to him straightaway and I know that he didn’t like it because a couple of times he asked me how I could talk to him in person but not reply to his messages (he never sent many messages in one go) but I am scared to get close to another man because I was hurt three years ago and so I struggle to trust people. He’s good looking and has a really good heart and I just wish that he would at least acknowledge me but instead these days he doesn’t work near me anymore or approach me anymore. What should I do? I feel so bad. He deserves better.",
            "spoiler": false,
            "stickied": false,
            "title": "A guy at work asked me out on a date and I said “no” and now he doesn’t talk to me and I know that I’ve made a mistake. Help!",
            "upvote_ratio": 0.76,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlitur/a_guy_at_work_asked_me_out_on_a_date_and_i_said/"
        },
        {
            "author": "u/Blueartbird",
            "created_utc": "03-24-2022 09:37:41",
            "distinguished": null,
            "edited": "03-24-2022 09:40:50",
            "id": "tm1a3z",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm1a3z",
            "nsfw": false,
            "num_comments": 4,
            "permalink": "/r/relationship_advice/comments/tm1a3z/should_i_ask_my_crush_what_he_wants_or_wait_until/",
            "score": 3,
            "selftext": "I need advice about a guy i like. Im 25 and he is 28.\n\n6 years ago i dated a guy. He was a fantastic guy but I had so many issues that i couldt deal with it, so i ran away and broke his heart. Later same year i texted him and said sorry and told him that i liked him still. He said that he was hurt and didnt want to start things again. I respected that and we stopped talking.\n\nTwo years later, he asked me out, we went on a date but it didn't turn into anything. I dont think either of us was in the right place.\n\nThe thing is, I have always had this feeling that we would be right for each other. I just know in my gut that this could be fantastic and im finally in the right place to start it for real. So i texted him and basicly told him that i think about him a lot and I really want to talk. I said that it could be a date or just a friendly talk.\n\nI thought he would shut me down again so i prepared to leave it alone for good if he wasnt up for it. But he responded that he have been thinking about me a lot too and that he wanted to meet up. It made me so happy!\n\nOur lives are busy. Im studying for a masters degree and he just finished his degree. He is looking for jobs in his field and working hard at his current job. We had been texting for a few weeks when he said that he wasnt ready to meet up again. He wanted to wait a while because he had so much going on, but he was still interested in me. And I completely respect that!\n\nWe text a few times a week still and have been for 3 months after i sent the first message. He is so kind. He even asked for updates on my bird when she was sick. But im getting impatient.\n\nHe told me that he got a job in another town and I said that this was great and that it doesnt change anything for me if he is moving away. I still want to go on a date. I have been very careful not to pressure him so this was the first time i mentioned the date after he told me that he wanted to wait.\n\nHe said that I was so sweet for waiting and that it was so refreshing that i didn't push him. But he didn't say anything else.\n\nHe never mentions the meet up and he is rarely the first one to start a conversation, but at the same time, he shows so much care for me and interest in the things i do. Im really confused about what he wants.\n\nI know this might be messy but I guess i just want to know if i should ask him to lay the cards out and be real or if i should stick a sock in it and wait for him to take the next step. I really dont want to ruin it and im trying to show him the respect that i would want him to show me if i was the one who needed time.\n\nEdit: ask if you need me to explain something 😊",
            "spoiler": false,
            "stickied": false,
            "title": "Should i ask my crush what he wants or wait until he makes a move?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm1a3z/should_i_ask_my_crush_what_he_wants_or_wait_until/"
        },
        {
            "author": "u/ThrowAwayAccoount2",
            "created_utc": "03-24-2022 09:35:48",
            "distinguished": null,
            "edited": false,
            "id": "tm197z",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm197z",
            "nsfw": false,
            "num_comments": 4,
            "permalink": "/r/relationship_advice/comments/tm197z/long_distance_dating_advice/",
            "score": 3,
            "selftext": "Sorry if this doesn't really fit here. Also posted this in r/askmen\n\nHi everyone, first off this is a throwaway account and I'll be deleting this post at some stage in the next few days. Details regarding places and names will be kept pretty vague. \n\nSo I met this woman (let's call her Stephanie for the purpose of this story) on Saint Patrick's day while on holiday in another country. We met at an Irish bar so we were both celebrating the holiday, we would have been pretty buzzed at this point and decided to continue on for another few places for drinks. After talking to her for a few hours we found out that we both happened to be from the same country. At some point after we met I think it was just after we had been dancing together that we added each other on Snapchat we had just met up maybe two hours (? Not too sure) before this. \n\nFast forward a few hours and we were walking home to our hostel (we had a 4 person private room and two of us guys were bringing back women, one of which was with Stephanie's friend while the other two were not) so that we could smoke some weed together. The other two guys that were with us would have already gone back to the hostel an hour before this, one of which was the babysitter for the other as the other was fucked at this point. It was Stephanie and her friend's first time smoking weed and they wanted to try. Stephanie was pretty cold on the way home so I gave her my jacket to wear, my circulation is a bit fucked especially after drinks so I was pretty warm even though it would have been about 2 or 3 degrees Celsius out so about 36 fahrenheit. While we were walking home she had both arms wrapped around one of mine with both hands clasped around my hand trying to keep warm. So we got back to the room to get some smoke and the other two guys were in bed  at this point. We must have been fairly loud because the guy that was drunk had woken up and wanted to join us for a smoke for a bit. So we went outside to smoke and it was pretty clear that Stephanie hadn't smoked before. I would only be a novice myself so I taught her a few bits to try and help out. We ended up going back inside to play some pool and just chill for a bit. Eventually we went back up to the room and from there myself, Stephanie and my drunk friend went back outside for another quick smoke. We had our smoke and went back towards the room but on the way my drunk friend had managed to get himself lost. We had to go on a little adventure trying to find where he went so we could guide him back to the room and eventually we found him. When we got back to the room my drunk friend went to bed, myself and my other friend let Stephanie and her friend decide what they wanted to do. They asked us if it would be okay if they stayed for the night and of course we were happy to let them stay over. So lights out and myself and Stephanie were trying to get each other off, as I was pretty drunk at this stage I wasn't able to get hard (no shame in that) so told her we could do more in the morning if she wanted to. In the meantime we made out and I got her off as best I could in my drunken state. Eventually when we finished up we tried going to sleep with Stephanie being the little spoon. In the early hours of the morning we had both woken up at some point and started teasing each other, I think we were teasing each other for maybe two hours before we decided to do anything. In the next five minutes after we finished up the rest of the room started to wake up. After about another 10 minutes Stephanie and her friend decided to leave to go back to their hotel.\n\nA few days later both my group and Stephanie were still on holiday in the same country. I decided to send her a quick text asking if she wanted to join us for a few drinks. She got back to me saying that they were okay for drinks but asked if  myself and my other friend that was with Stephanie's friend (definitely should have chosen names to give them, haha sorry about that) that other night and sent on the post code for the hotel they were staying at. My other friend wasn't up for going over so I asked if just myself would be okay. Stephanie got back to me that it would and I told her I'll try and find a way over to their hotel. A few minutes later she sent me a text saying that they were actually flying home early the next morning and asked if I wanted to do anything together when we got back to our home country. I then told her that would be okay and asked if she would be up for going to a music festival back home together. She had sent another text but my phone had turned off at this point so wasn't able to read it.\n\nSnapchat messages expire after a certain time frame if you haven't opened them (or at least it can be set up in settings that way anyway), think it was more than 36 hours later when I text her that I completely missed her last text. She responded saying that she couldn't really remember what the last thing she replied with was. So I messaged again if she'd be up for going to a music festival together (probably should have mentioned earlier that we had both been talking about us missing out on buying tickets when we met up the first night). She replied saying she would but didn't have a ticket as they are sold out. I told her that I would keep an eye out for tickets for us so that we could go. She said that would be perfect thanks.\n\n\nFinally into the question, sorry if this was a long read also sorry if there are any formatting issues typing this on mobile.\nSo I should be able to pick up tickets for the festival at some point when they pop up. Problem is that the festival is like 5 months away. Not really certain how we could meet up in the meantime between then and now. We live about 2 hours away by drive but neither of us drive at the moment and the quickest way by public transport is about 3 hours. Last time I texted her was just over a day ago. \nAny advice on what to say if we wanted to meet up in? To me getting a 3 hour bus journey to meet up seems a bit desperate. Should I just move on for now and see if she would still be up for going to the festival in a few months time (I should have tickets by then)?\n\nAny advice would help, thanks.\n\nTLDR: met a cute woman while abroad on saint Patrick's day and we hooked up. Turns out we are both from the same country and also interested in going to a music festival back home but it is months away. Looking at getting tickets for us in the meantime (sold out but should be able to get my hands on some).\nWe live about 2 hour drive and 3 hour bus away from each other. Neither drive. Any advice on what to say if we wanted to meet up? Any advice would help, thanks",
            "spoiler": false,
            "stickied": false,
            "title": "Long Distance Dating Advice?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm197z/long_distance_dating_advice/"
        },
        {
            "author": "u/crescentallen",
            "created_utc": "03-24-2022 11:44:50",
            "distinguished": null,
            "edited": "03-24-2022 11:59:26",
            "id": "tm32ci",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm32ci",
            "nsfw": false,
            "num_comments": 4,
            "permalink": "/r/relationship_advice/comments/tm32ci/i_28f_caught_my_husband_27m_looking_through_his/",
            "score": 2,
            "selftext": "My husband and I met online gaming (he's from Canada and I live in the US) and have known each other for almost 12 years now and have been together (collectively) for 5 years, married and living together for almost 2 years. There was a break in our relationship for a couple of years where I later found out he got back together with his ex-girlfriend, but I'll elaborate a bit more on this below.\n\nFirst, I wanna get this previous incident with my husband out of the way so you guys can understand the full scope of what I'm dealing with here as far as trust goes. I also can't promise this isn't going to be a jumbled mess of words because this is my stream of consciousness, so sorry if the timeline sounds weird or it doesn't make sense.\n\nI mentioned we had broken up for a couple of years and I ended up finding out he had gotten back together with his ex-girlfriend in that time. He didn't tell me this, but while we were back together for several months, I found photos on his ex-girlfriend's Facebook at the time that were uploaded during the time we were broken up. I was fine with this and really didn't think anything about the fact that he hadn't told me. I would classify him as a good, kind-hearted person and is the type of guy that just doesn't want to hurt anyone's feelings if it's unnecessary so I understand why he decided it was better not to tell me and make me upset for no reason as I can be a bit of a jealous person at times.\n\nYears later though, I found out that that he was actually still with her when we had gotten back together. My close friend and I had been talking about that situation randomly and she ended up finding his ex-girlfriend's Instagram (I didn't tell her to do this, she's just a bit of a nosy person and has always been a detective in her own relationships - which I don't condone) and finding photos of them together during the time we had gotten back together. Specifically, we had found a photo where he was was clearly on a ziplining date with her and I remembered him telling me just weeks before that he had never gone ziplining before and that we should go. I ended up confronting him about this and he had nothing to say. This really hurt because soon after we got back together, we met up for the first time and had sex. All the while, I had no idea he was still with her. I then realized it made sense, because he would always go offline unexpectedly and come back with the excuse that he just needed time away from his computer or that he just wanted to go for a walk, when in reality, he was meeting up with her for dates. We ended up breaking up over this for about three months before getting back together. I wrote it off as him being young and dumb at the time (keep in mind, us getting back together happened a couple years before I found out) and I don't know if I was just blind, but I missed him and wanted to work things out. I really couldn't imagine being with anyone else and starting a new relationship where I could be as comfortable as I was with him.\n\nOur relationship had been good since getting back together. We continued to meet up a couple times a year and he ended up getting a K1 Visa and moved to the US where we got married and he moved into my studio apartment shortly after. When he obtained his green card, he got a work from home job almost immediately as a graphic designer and I was so proud of him.\n\nA couple of months into his new job though, I noticed one of his (single) female co-workers would always put fire emojis under the graphic designs that he would post in their work's chat platform, Slack. I half-jokingly told him that she seemed to have a crush on him. I find my husband to be quite attractive and his profile picture on Slack was reflective of that. He told me to stop messing around (for good reason - as I mentioned, I can get jealous), and I did stop. Later on though, I saw on his work laptop that she had private messaged him asking him about what he used to do and asked him for his Instagram, which he doesn't use. He mentioned to her that he doesn't use Instagram, but gave it to her anyway. They followed each other and from what I've seen, she only posts her artwork on her feed (she's also a graphic designer as well as digital artist), but posts seevvverall stories of herself in the mirror. She's attractive, skinny, and confident and I don't find myself to be any of those things. I'm not fat, but I'm not skinny. My body type is average, but I have always had low confidence, which is probably why I get jealous easily. Also, (not that it's that important but just to give you a better picture) my husband, who's caucasian, has always been into asian girls. I'm asian, his ex-girlfriend is asian, and this co-worker is asian.\n\nAnyway, I have always had my husband's Instagram connected to mine. But not to keep tabs on him as he's aware I have access to his account. As I said, he doesn't use Instagram, but I would sometimes go on his account to follow private meme accounts I follow so that he can see the posts I tag him in. He only ever went on Instagram to look at those tagged posts, but never went through his feed or looked at anyone's stories.\n\nA couple of weeks after they exchanged Instagram profiles, their company held a lunch where the operations teams were meeting up for the first time. For context, he was the graphic designer for one of the subsidiary companies, and she was the graphic designer for another. The parent company decided to merge the two subsidiaries so this lunch was meant for both operations teams to meet in person. When he came home from this lunch, he told me that it was just their team and the two leaders from the other operations team that were there, insinuating that she had not been there. He already knew at this point that I was insecure about her because of the simple joke I made early on about how she was very reactive to his posts in Slack. I had also seen the way she talked to him in their private chat where she asked for his IG and she was extremely over the top friendly with him and him with her. The reason I got so insecure just based on their chat is because he's never typed or acted that way with anyone else before. Like I mentioned, she's extremely over the top in the way that she types and she's CONSTANTLY praising him on his work (i.e. OMG THAT'S SOO AMAZING! YOU DID THAT ALL BY YOURSELF? FROM SCRATCH?! WHAT THE F!!\" and he'll respond in a braggy fashion, like \"Yep, 100% from scratch... I used to do this type of art all the time so it's nice to be able to utilize it here.\" The most annoying interaction I saw between them was when she said, out of NOWHERE \"I really enjoy working with you.\" and he said \"Me too \\*smiley face emoji\\* I don't usually collaborate well with others, but it's always nice working with you.\" First of all, he collaborates and gets along well with everyone so I don't know why he would say that. To make her feel special? He also always reacts with emojis under her work as well. He's never been an excitable person so to see him acting this way with this girl is really messing with me. I also forgot to mention, he's never mentioned to her that he's married. He told me the reason for that was because they've just never had a personal conversation for him to be able to bring it up. But I feel like you could bring your wife up in pretty much any conversation if you really wanted to. If she says something about his amazing work, he could say \"Oh yeah, my wife helped me out a lot\", which I did. I helped him with his graphic designs a lot when he first started. I'm not saying it's something he should do - I don't want to control him, but it's something he could've taken upon himself to do if he wanted to right? Or am I just expecting too much from him?\n\nLately, I had begun noticing he was looking through her stories quite often. She posts stories several times a day - yes, I admit I let curiosity get the better of me and I looked through her stories while I was on his profile (and only when it indicated he had already looked through them). She posts mostly stories of herself showing off her body. I don't want to give you the wrong idea - she's not scantily clad or anything. She's usually in a dress or posting OOTDs, along with other random stuff she's doing throughout the day. There were also videos where she would post parts of her body, like her bare shoulder or back, but it was more in an \"artsy\" way, not a hoe-y way. I noticed she had liked a lot of his photos as well, including photos of him that were posted several years earlier. Granted, he has a couple photos of the two of us on his Instagram, so he wasn't trying to hide our relationship from her (though she still thinks we're just boyfriend and girlfriend), but I think he was willing to exchange Instagrams because he was curious about her (which he later admitted to), not to show her that he was in a committed relationship. I then went on her account and noticed he had liked a couple of her posts too, including the only photo that had her face in it, smoking a cigarette. One night, I caught him looking through her stories while we were in the same bed. He had his back turned to me, but I saw over his shoulder. This was confirmed when I went on his account and saw he had looked at her stories and even the stories of all his friends as to not look suspicious if I were to check his account.\n\nI ended up confronting him about it all and asked him if he had really not seen her at the lunch, as it seemed strange that they would be working so closely together as graphic designers at the same company for them to not meet. He finally admitted he did meet her there and my heart shattered. Withholding information is the same as lying in my eyes and that's what he did. He lied to me. I asked him to tell me what else happened during that lunch that he knew I would want to know and he said nothing else happened. That they literally didn't even talk to each other during that lunch other than meeting and saying bye. I just can't bring myself to believe this.\n\nWe had gotten into several fights since that whole situation happened and about a week later, I asked him again to be honest with me about what happened at that lunch. I asked him if he had a hug with her because she just seemed like the super friendly type that would want to hug when meeting or saying goodbye to anyone. He then admitted to that too. That when he left, she got up to give him a hug. Which is fine, some people are huggers and I get that. I just wanted to know the truth about what happened. He admitted he didn't tell me because he didn't want me to get jealous. I ended up asking him if he was attracted to her or had feelings for her and he admitted that he was attracted to her, but there were no feelings there. I asked him what was attractive about her and he said he likes how confident she is and how she puts a lot of effort into her art. I've voiced to him in the past that I don't really know what I want to pursue career/hobby wise so that really made me feel like shit. And I hated that he was only giving me answers when I was asking the right questions, instead of being forthcoming in the first place. He assured me that he would never be with her because she smokes cigarettes and has two kids and he's not ready to take care of children. What?\n\nAfter breaking down and letting him know how much this whole situation had been affecting me (for months), he apologized to me profusely for lying and letting his curiosity and interest in her go so far. He admitted it was wrong of him and he said that he only continued because he felt like he was in control of the situation. That he knew he would never let it get too far so he didn't stop himself and that he should have considered my feelings. I found out later though, that after this breakdown is when they had the conversation on Slack talking about how they really enjoyed working with each other, so was he really sorry?\n\nHe's since backed off being as friendly with her and keeps it strictly professional in their chats. He's also changed his photo on his Slack to a photo of the two of us. This was after I asked why on all his other chat platforms like Skype and Discord, he always uses photos of us together as his profile picture, but not on his work profile to which his answer was that he wanted to keep his work profile professional.\n\nWe've since been going to couples counseling so that I can stop thinking about this every single day. The most intrusive thought I've been having? I can't help but think that if she didn't smoke or have kids, he might try and pursue things more seriously with her. Or that if I had never caught him looking at her Instagram or read their work chats, they'd be much closer than they are now. Even though he's made these changes and I appreciate it, it still effects me so much because of what he's done to his ex-girlfriend and I in the past. I can't imagine what things would be like between him and this co-worker if this wasn't a work from home job and they saw each other every day. Or what he might do in the future with someone else where I didn't find out what was going on.\n\nI guess my question is.. am I overthinking this whole situation? Is he just a guy that enjoys the ego boost and looking at a pretty face? In that case, I'd rather he go watch porn (which I've voiced to him I'm 100% fine with) or a sexy actress, rather than looking at his co-worker whom he has access to. Is there something more going on here? Is there something missing in our relationship? Is this way of thinking just due to my combination of low self confidence and habitual overthinking? Is he just trying to keep me from getting overly jealous and that's why he's not being forthcoming?\n\n&#x200B;\n\ntl;dr: My husband is constantly looking at his attractive co-workers Instagram stories when he never used to check Instagram and has been actively hiding it from me. As well as lying to me about meeting her at a company lunch. When confronted, he admitted to being attracted to her but said he would never leave me. Due to his past cheating, I can't help but think he's going to do the same to me or has at least thought about it. Am I overthinking things? Is it just a harmless attraction or should I be worried?",
            "spoiler": false,
            "stickied": false,
            "title": "I (28F) caught my husband (27M) looking through his attractive female co-worker's Instagram stories almost every day when he never used to use social media. Should I be worried?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm32ci/i_28f_caught_my_husband_27m_looking_through_his/"
        },
        {
            "author": "u/Traditional_Trash514",
            "created_utc": "03-24-2022 11:43:54",
            "distinguished": null,
            "edited": false,
            "id": "tm31ty",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm31ty",
            "nsfw": false,
            "num_comments": 1,
            "permalink": "/r/relationship_advice/comments/tm31ty/still_kinda_hung_up_about_toxic_relationship_and/",
            "score": 2,
            "selftext": "So, three years ago I (f25) broke it off with my gf (f25) that I had been together with for five years. We got together when we were both 17, moved in together by the time we were 20.\nTL;DR at the bottom, text itself is kinda rambly. \n\nBefore moving in together, I would've considered our relationship to be kinda healthy. I was struggling with some mental health issues that I was addressing in therapy at the time and successfully got over before we moved in together. There were definitely some toxic elements going on from my side at that time, but we actually managed to adress it in a healthy manner and solve the offending behaviors from my side.\n\nAs soon as we moved in together, things got sour in many ways though. We'd fight a lot around household chores, and she would turn very controlling and manipulative in so many aspects that I still have trouble listing them all out. No matter how hard I tried, it was never enough. I was never enough.\n\nA few months after moving together, our bedroom died as well. I tried working through it with her, but whenever I'd bring up the topic in a calm manner, she would flip and turn it into a huge shouting match until one of us cried. Often times, I would bring up an issue that I had in the relationship, and it would end with her crying and me consoling her, while she'd always promise to work on making a change but never tried. \n\nOur break up was pretty messy as well. I spoke to her about a lot of things bother me, about the fact that she wouldn't even do the smallest favour for me if I'd ask her (e.g., I'm an artist. At that time I was traveling between workplaces. I needed a picture of a drawing that was still at our shared home, sitting right on top of my desk. I asked her to take a picture of it for three days in a row, as the date where I needed the picture was coming up. She promised she'd do it, but she never did it, even though I reminded her ultiple times. She always had an excuse for why it was too much to just put the drawing on the floor and take a picture of it, which takes less than a minute). \n\nWhen I told her that I felt like this wasn't right for either of us, that we're both not happy in this relationship and I don't see any steps towards improvement from her side, she would always start crying, saying that she is working on changing, and that I am an abusive and toxic person if I demand certain changes in a certain time, as she can't force herself to be ready. I would tell her that yes, I can't force her to be ready, however I can't change the fact that I'm unhappy with the relationship and feel myself withdrawing emotionally and psychologically because of the empty promises and that I might not be around when she's ready.\n\nOf course, nothing happened, which is also my fault in a way, because I never was able to set a hard boundary with her, as she would always drag the situation out until she was crying and I was consoling her. I would've needed to be more firm with my limits, but let her get away with it. \n\nWhile we got towards the end of the relationship, she turned explicitly verbaly abusive. She'd tell me that I'm a coward and a wimp, that I'd never cheat in her because I'd never find someone better than her. That I only got my career and everything else because of her, etc. \nWe were fighting daily, and again, I was pleading with her to accept that our relationship was over, because I was not assertive enough to break up with her.\n\nIn the end, we broke things off because I developed feelings for someone else. I didn't cheat on her and felt horrible about it, however I decided that I'd still be honest and upfront about it with her because it would be way more hurtful for her to find out after we broke up that I started to see this person that I was already interacting with openly in front of my ex. \n\nNow, three years later, I'm in a different place both mentally and physically. However, I still find myself ruminating on this really fucked up relationship and have the urge to speak with my ex about all of this to find some closure. \nI don't want to be part of her life. I don't want her to be part of mine. But I have this desire for her to acknowledge the pain and hurt that she caused me and to see her faults in this situation. \nI know that it's never gonna happen because she doesn't see it that way. To her, I'm an asshole who lied about not cheating and who abandoned a completely salvageable relationship, even though I was telling her over the course of two years that I wasn't happy and we needed to work things out. \n\nI want to find a way to move on and find closure without wishing for something to happen that just never is going to happen. But I don't know how.\n\nIf you have any specific questions regarding this rambling post, feel free to ask.\n\nTL;DR: I was in a toxic relationship for five years. Three years later, I still struggle with not finding closure because my partner didn't acknowledge any of it. I know that I shouldn't care what she things and that I cannot control her viewpoint, so I'm looking for a way to find closure for myself without having to interact with her.",
            "spoiler": false,
            "stickied": false,
            "title": "Still kinda hung up about toxic relationship and Ex",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm31ty/still_kinda_hung_up_about_toxic_relationship_and/"
        },
        {
            "author": "u/ColdBuyer1777",
            "created_utc": "03-24-2022 11:35:47",
            "distinguished": null,
            "edited": false,
            "id": "tm2xh8",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm2xh8",
            "nsfw": false,
            "num_comments": 12,
            "permalink": "/r/relationship_advice/comments/tm2xh8/im_not_interested_in_the_girl_im_dating_and_i/",
            "score": 2,
            "selftext": "I have been dating this girl for over a month now, but I'm least interested in her. I purposefully delay texts, give uninteresting replies, react only with emojis all in the hope that she would understand that I'm not interested and leave. But she keeps on texting and calling no matter what. I have thought about it many times but I really don't want tell it straight to her face because she is super nice and I don't want to hurt her feelings.\nThe problem is she asked me for another date and i said yes. I'm thinking of telling it when we meet. Any advice would be helpful.",
            "spoiler": false,
            "stickied": false,
            "title": "I'm not interested in the girl I'm dating and i don't know how to tell her",
            "upvote_ratio": 0.75,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm2xh8/im_not_interested_in_the_girl_im_dating_and_i/"
        },
        {
            "author": "u/Ok-Avocado9286",
            "created_utc": "03-24-2022 11:34:32",
            "distinguished": null,
            "edited": false,
            "id": "tm2wsn",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm2wsn",
            "nsfw": false,
            "num_comments": 4,
            "permalink": "/r/relationship_advice/comments/tm2wsn/i_15m_have_an_ethical_dilemma/",
            "score": 2,
            "selftext": "My girlfriend (15f) is depressed and doesn't want to live anymore. She said she'll probably end it if I leave. She causes me major anxiety though since she constantly says she's sad and gonna kill herself but doesn't tell me why. She also won't let me hang out with friends and whenever I'm with them guilt trips me into hiding away and calling with her. What do I do? If I leave I'll be responsible for a death but by staying I'm basically dooming my mental health.",
            "spoiler": false,
            "stickied": false,
            "title": "I (15m) have an ethical dilemma",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm2wsn/i_15m_have_an_ethical_dilemma/"
        },
        {
            "author": "u/ThrowRAAland",
            "created_utc": "03-24-2022 11:30:56",
            "distinguished": null,
            "edited": false,
            "id": "tm2uux",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm2uux",
            "nsfw": false,
            "num_comments": 2,
            "permalink": "/r/relationship_advice/comments/tm2uux/my_23f_boyfriend_25m_says_the_spark_is_gonethe/",
            "score": 2,
            "selftext": "This is a very delicate situation. We have been together for 2+ years. He is now abroad for a study exchange that will last for two more months. We were long distance at the beginning of our relationship for 10 months, then I moved to his country and we were together (lived in separate apartments, though) for 1.5 years.\n\nFor the last month, I've been going through a rough mental spot as a combination of pre-existing problems that have been exacerbated from me being in a new country and other family problems. \n\nToday, he told me that he is not feeling as excited as before when it comes to talking to me, or even having sexual conversations or jokes. We have talked about it and tried to dig in together. He basically stills cares for me, likes to imagine us doing things together, even in the future, and our friendship \"sphere\" is as good as ever (we were best friends before getting together), but that the romantic one is the object of our concern. \n\nHe says that 1) he feels like the spark is gone, suddenly, and that he doesn't feel as excited as before; that 2) he likes me a lot and cares for me, but that he doesn't feel much love for me right now and that this has exacerbated once he left to go abroad (he left 2 months ago); and that 3) he still believes the relationship is salvageable but that he needs to think about many things, among which are the things we discussed about today. \n\nThis is our first relationship (23F & 25M). \n\nI asked him many questions, while we were trying to tackle this together, but it seems that I have not done anything wrong, and that my current mental health status is not problematic. However, something that emerged, which I agree on, is that I've not been doing much by myself (without him) which has made him feel slowly more and more suffocated and that now he's abroad he notices this discrepancy. This was something I had been struggling with for a long time ever since moving to his country, and in the last few weeks I've started to make actual steps towards being more my own person here (new activities, which I told him about today and he was very happy to hear it). So that's something I'm working on fixing, even for my own sake. \n\nHe's said that he believes I love him more than he loves me, which I believe is because I was suffocating, possibly, giving him a false perception because I was pouring all my time and attention on him. \n\nThis conversation happened while his thoughts were not sorted through yet, so some things were confusing to the both of us. We've decided to give him more time so he can think better; my trip to go visit him so that we could tour the country together in 5 weeks (nothing booked yet) will probably not happen. When I asked him whether it might be good for me not to come, he agreed. \n\nHe says that his feelings have been fading now that he's there (which was not the case when we long distance more than 1 year ago), and he's scared of it; but he also says that being physically with me had - since the end of this autumn, apparently - made him feel like he was \"faking\" certain things, mainly being \"excited about things\". So certain things need to be sorted in his head. \n\nSometimes, he said, in the last few months, he felt like the spark was dying and that he felt like faking saying things such as \"I want you\" or \"love/care for you\" which were rare anyway. He still enjoyed those things, just not as fully, and that he noticed only recently that things to start change then and that's why we had this conversation. Communication is very important to the both of us. \n\nHe didn't say anything until now because he didn't want to hurt me and because he's still scared of his feelings which he still processing. In a way, he's said he is a \"people pleaser\". We are very similar and he has admitted that he feels the most comfortable and closest with me, so he doesn't know how to make these feelings work together. He says he's confused and feels bad about these contrasting feelings, and that he needs to go through them more.\n\nWe did many things together, and spent a lot of time together, so maybe the spark started fading because I was TOO much (on the internet, I've seen the opposite, when there's a lack of effort). He's also briefly brought up the fact that he wants to focus more on his experience abroad (he's an exchange student in a technical school). \n\nHe believes the relationship can be salvaged and said that we will focus even more on it once he returns (when we are supposed to move in together), but that he's afraid that if things in the end don't work out he will feel guilty for making me \"wait\", which I didn't see that way as in the meantime I'll be focusing more on myself, too. \n\nI've also suggested couple therapy but we both agree that before that it's good for him to sort his thoughts out first, and that a therapist may be a bit too much for this situation. \n\nWhat else can I do? \n\nThis is what I know I must do for him and for myself: give him space and time (although he told me I don't need to change anything, and that he knows and feels that what I do is fine), and focus on building myself as a person here again, by participating more in activities and so on. \n\nWhat else can I do that I may have forgot?\n\nAdditional info:\n\n- I felt the excitement slowly wane off from my side, too, since this autumn and it also worried me, but I have also noticed the excitement has been substituted by a sense of calm, comfort and familiarity on my part. I doubled-down on being closer to him because I had these feelings and because I was/am going through a rough mental period, which has nothing to do with him, and which he has assured me is not a problem. I now know that I love him but the sparks come and go, and the fact that I had around 6 months to elaborate them calmly has helped me, which is something he couldn't do because I was slowly suffocating him or he was so busy he couldn't reflect on his feelings and relationship (something that is happening now).\n\n- I therefore believe that, whereas I was and have been capable of elaborating my feelings through the last months, he was not, and this sort of \"blew up\" now that he has more time for himself abroad, hence why he felt scared because it felt \"sudden\"\n\n- I asked him this morning whether he wanted to break up and he said: \"I don't think I can take such decision yet. Even though it may help [by allowing me to see whether I love you or not] I still like you alott ://. It's hard to think.\". When I suggested that I give him more space and distance, he said \"Yeah, but I have to think about it\". We have not spoken since and I'll let him reach out or text first. \n\n- He's said that he doesn't want me to change my behaviour towards him (sending texts, memes, videos etc), but that he wants me to more things without him (which was my suspicion).\n\n- He doesn't know how to reconcile these feelings and how he feels now that he's basically felt the full impact of the spark/honeymoon phase ending.\n\n- Since it was suggested in another thread: the university and the circle of friends he hangs out with is 80+% men, and the women who are in said circles are all taken (as other men). The fact that I'm his (and he is my) only sexual partner has emerged before and he's said several times that he doesn't want more women in his life for several reasons, even some personal that I don't want to list here; and the last time it was after a deep and heartfelt conversation.\n\nI shall give him more space and time while I work myself up to where I once was. Does that make sense to you?",
            "spoiler": false,
            "stickied": false,
            "title": "My (23F) boyfriend (25M) says the spark is gone/the honeymoon phase has ended and has contrasting feelings. We had a delicate and thorough conversation. [long, but please read]",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm2uux/my_23f_boyfriend_25m_says_the_spark_is_gonethe/"
        },
        {
            "author": "u/PriorSecurity9784",
            "created_utc": "03-24-2022 11:29:41",
            "distinguished": null,
            "edited": false,
            "id": "tm2u25",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm2u25",
            "nsfw": false,
            "num_comments": 4,
            "permalink": "/r/relationship_advice/comments/tm2u25/going_out_while_gf_works/",
            "score": 2,
            "selftext": "I have been dating my gf for several years.  We are both divorced with kids from first marriages.  We don’t live together or want to get married, but we have a lot of fun going out together.\n\nHer work has gotten very busy in the last year, and there are often 3-4 nights a week that she drinks or dinner with groups of clients.  \n\nSometimes we’ll go out after that, or sometimes I’ll meet her at her house to catch up on our days, etc.  I usually spend the night there 2-3 times a week.\n\nIn my work I have a lot of clients that are in the restaurant/bar industry.\n\nIf I have my kids, I’m home with the kids after work.  If gf doesn’t have plans we usually go out to dinner or something.\n\nAnd sometimes, if I don’t have my kids, and if she has something else going on, I’ll go have a few drinks or get food at one of the places I do business with, because I know the staff, it can be relaxing, and sometimes I just don’t want to go home by myself and watch Netflix.\n\nLately, gf has been saying she doesn’t like me “going out to the bars” as if I’m out prowling for women or something.  If I invite her to meet me there when she finishes her stuff, she usually doesn’t want to, or is tired (understandable).\n\nBut to me, we are basically doing the same thing: having work-related drinks after work.  \n\nTo her it’s different, because her meetings are much more scheduled and have a client purpose, rather than just hanging out, which is true.\n\nBut it also seems unreasonable that she would expect me to just stay home.\n\nI think this fight is about to come to a head, and I can’t tell who the unreasonable one is here.",
            "spoiler": false,
            "stickied": false,
            "title": "Going out while gf works",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm2u25/going_out_while_gf_works/"
        },
        {
            "author": "u/Difficult-Bag-6258",
            "created_utc": "03-24-2022 05:07:57",
            "distinguished": null,
            "edited": false,
            "id": "tlxala",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlxala",
            "nsfw": false,
            "num_comments": 3,
            "permalink": "/r/relationship_advice/comments/tlxala/my_girlfriend_asked_me_to_move_in_a_year_ago_and/",
            "score": 6,
            "selftext": "I moved in with my girlfriend a year ago and at first I didn’t have many of my own belongings in the flat we now share as I had only just moved in and was still settling. (for further background info I contribute towards food, household chores and have moved into a brand new city away from all friends and family. I don’t pay rent as legally the flat is hers as she inherited it). I had a big dilemma a while ago of not knowing where ‘home’ was meant to be as I didn’t have any personal belongings other than clothes in the flat. She told me to think of the flat as my home as that’s where ‘home’ is for me now. I started to move in some of my things, however she told me she didn’t like a lot of my stuff and also didn’t want my things ‘cluttering’ the flat. As a result of this i’ve massively cut down in things i own, for example, if i had 20 books that i wanted to bring with me, i was only allowed 3. this is the same for plants. i had around 22 plants (which i know is excessive) however i only brought 4 with me that were my favourites. despite having still barely any of my own belongings in the flat, and not being allowed anything except a small handful of things (approx. 5 items of mine) on display, she still frequently tells me how much she doesn’t like where my things are (even though she got to choose where they went) and even told me she gets upset and stressed about the idea of me ordering anything as it means she has to find a place for it. I told her if she genuinely didn’t like some of my things then they don’t have to be out as it is her flat, however she can’t expect me to live with her and not be allowed any of my own things without having to go through a huge argument first of what i’m allowed or where it’s allowed to go. It just doesn’t feel like a home to me and she doesn’t seem to understand my point of view. I’m not sure what i’m meant to do about this, or what i could do next? \n\nThere have even been instances where I have visited my parents house, and they’ve asked if I want to take something back to the flat with me (often sentimental things), and before I even have the chance to respond my girlfriend will often immediately reply ‘no’ and then continue to explain why she doesn’t want it in the flat, regardless of what it is.",
            "spoiler": false,
            "stickied": false,
            "title": "My girlfriend asked me to move in a year ago and still won’t let me have my own things in the flat. What am I meant to do about this?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlxala/my_girlfriend_asked_me_to_move_in_a_year_ago_and/"
        },
        {
            "author": "u/throwdohh",
            "created_utc": "03-24-2022 07:17:56",
            "distinguished": null,
            "edited": false,
            "id": "tlzbrz",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlzbrz",
            "nsfw": false,
            "num_comments": 7,
            "permalink": "/r/relationship_advice/comments/tlzbrz/i_think_my_boyfriend_lovedloves_his_ex_more/",
            "score": 3,
            "selftext": "REPOST as I didn't get many responses last time.\n\nI'll try to keep this as concise as possible. \n\nMy (25f) bf (26m) has been separated from his ex for about 3 and a half years. They dated for 4 years and met whilst still in school. We've been together for 1. We met online through an app (if that is at all relevant). He had dated a few other girls in between his ex and I but nothing serious. She broke up with him for reasons he didn't initially disclose. \n\nRight from the very start I found it strange how often she'd come up as a comparison point to measure me against (not cool). From her favourite sex position, to her menstrual cycle (yes, really) to her hobbies to her favourite movie etc. the list goes on. I found this especially strange/red flaggy because they had already been separated for a while and he had dated other girls, who he never compared me to despite them obviously being more recently involved in his life. Also, early days he accidentally called me by her name (again, odd when you consider how long they'd already been separated). \n\nHe has also made it very clear that his family and hers had a great bond (mine and his have never met). Obviously this can mainly be chalked up to the fact that they were dating as teens still living at home and very local to eachother (they were practically neighbours) so the parents had reason/opportunity to get to know one another. He has mentioned how his mum and her mum used to hang out regularly and how he'd go over for Sunday dinners all the time \"like one of the family\". He has also mentioned that his mum will still sometimes talk about her and say she misses her and wonders whats she's up to etc. Despite the circumstances of our relationship being very different, I feel at a disadvantage here. Like she already one ups me simply by virtue of the fact that they had this nice cosy family dynamic that my partner and me don't have. I also feel that he misses this family dynamic (because of the way he reminiscences about it) and will secretly always wish for this again in any relationship he's in.\n\nThe other, and perhaps biggest, indicator that he loved her more/may even still love her is the reason they broke up and his reaction to it. Me and him had been fighting on and off for about a month when suddenly he broke down and said I was upsetting him because I was reminding him of his ex before she broke up with him. According to him, her parting words to him were that he wasn't treating her the way she wanted to be treated. She also entered a new relationship very soon after they broke up (I think within a month or so) and apparently she said (about her now current partner) that \"he gives me what I need\". My bf seemed still really shaken up as he told me this. I wonder how many months or perhaps even years he has wrestled with feelings of guilt and inadequacy. I feel he may deeply regret not \"treating her right\" while he had the chance and subconsciously sees me as the lesser option who he'll try and make it work with but will never quite measure up to her. \n\nThere are other things also. He seems very disinterested in me, is very unaffectionate and never mentions a future together. For example, I have suggested going away together for a holiday but he doesn't seem bothered. For comparison, he and her spent a month travelling together on one occasion. On another, he took her to visit his family overseas. This is despite them being younger and having less finances than he does now.",
            "spoiler": false,
            "stickied": false,
            "title": "I think my boyfriend loved/loves his ex more",
            "upvote_ratio": 0.72,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlzbrz/i_think_my_boyfriend_lovedloves_his_ex_more/"
        },
        {
            "author": "u/Grand_Actuary_3409",
            "created_utc": "03-24-2022 08:50:58",
            "distinguished": null,
            "edited": false,
            "id": "tm0n3r",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm0n3r",
            "nsfw": false,
            "num_comments": 5,
            "permalink": "/r/relationship_advice/comments/tm0n3r/i_cant_initiate_sex_and_its_ruining_our/",
            "score": 3,
            "selftext": "TLDR: my low sex drive and a \"block\" on initiating sex is ruining our relationship\n\nMe (25F) and my boyfriend (26M) of almost 8 years have been having problems with sex for more than half of our relationship now. I've come to the realization that 1. I have a very lower sex drive than him and 2. I have some kind of \"block\" in initiating sex.\n\nI have tried everything. I've been on the pill since summer 2014, a few months after we got together. I have changed pill at least three times, talking to my gynecologist about this issue and thinking that maybe it was the pill that diminished my sex drive. Nothing changed.\nWe introduced toys, we tried new stuff, regular stuff, nothing changed.\nIt doesn't help that I'm still in university, with at least one more year ahead to get my degree, and that means I have lessons everyday all week; and in the weekend, where we see each other and I sleep at his place, we also meet with our friends (who also sleep at his place) so we actually only have a few hours of intimacy per week. In that few hours he often asks me for a second or third round, but I'm almost never in the mood to do it again and here come the discussions, \"we only have sex like once a week now\", \"we could have done more, now we have to wait another week\" etc - and I get him. I really do.\n\nAnother issue is related to initiating sex. I have no idea why, but I just can't bring myself to be the first one to ask for it, even if I'm thinking about it. He would like me to be more initiative, more \"active\" in general (and again, it's right for him to wish that, because he always makes me feel wanted and appreciated, it should be \"his turn\" sometimes..), but I just can't. I don't think it's something related to embarrassment or stuff like that, we've been together for so long, I don't think that's the case. And it's also not because I don't want to, because often times I'm thinking \"well we just had sex and I am not in the mood for another round, but we still have some time alone, I can do something else to please him that doesn't include penetration\" or \"we're finally alone, we both want sex so I'm going to do this/that\" but I just sit there, thinking about doing it, wanting to do it but not being able to bring myself to actually initiate doing it. The most I can manage to do - and still not often - is trying to hint about it, letting him initiate stuff.\n\nAll this of course makes him feel very bad. He feels unseen, uncared for and not appreciated. And I really understand him and I feel extremely bad, guilty and mortified about it, we talk about this all the time but we have never managed to find a solution.\n\nWe both agree that everything else in our relationship is going pretty well, but this aspect is ruining everything else for us. I don't know what else to do.\n\nP.S. To clarify something that maybe isn't clear from this long post: I love sex, i love sex with him, he really does attract me sexually, and he never forces me.",
            "spoiler": false,
            "stickied": false,
            "title": "I can't initiate sex and it's ruining our relationship",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm0n3r/i_cant_initiate_sex_and_its_ruining_our/"
        },
        {
            "author": "u/throwawayyy7348",
            "created_utc": "03-24-2022 11:01:13",
            "distinguished": null,
            "edited": false,
            "id": "tm2fub",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm2fub",
            "nsfw": false,
            "num_comments": 2,
            "permalink": "/r/relationship_advice/comments/tm2fub/me_18m_and_my_gf_19f_of_two_years_are_in_a_weird/",
            "score": 2,
            "selftext": "My girlfriend started acting strange like 3 weeks ago. She's been with her best friend (19f) every single day and prioritized her. She said she didnt have romantic feelings for me anymore, but the next day we agree that instead of breaking up. Were just on a break  \nwell, that lasts a week and then we agree to date, just keep it lowkey, because her friends doesnt like it. And today, she said it doesnt work and she wants a break again. And im not allowed to talk to her or anything, and tbh she doesnt seem bothered at all. To me it just sounds like she doesnt break up because she wants me as a backup. I dont really have any friends and shes the only one ive been close to for two years, and im having a hard time currently, because i really dont know what to do.   \nWe made rules for eachother for the break, which include things like \"dont flirt w others\". Which is fine because she made the rule and i dont have feelings towards anyone else. Im just scared she's using me as a backup in a way. So yes, i know i sound erratic, but im just very scared and lonely at the moment and i dont know what to do.   \n\n\n(NOTE) we have been together every single day for 2 years since we're in the same small class. We see eachother every day and its clear to me that she has kinda replaced me w her friend. Which she denies.",
            "spoiler": false,
            "stickied": false,
            "title": "Me (18m) and my gf (19f) of two years are in a weird spot",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm2fub/me_18m_and_my_gf_19f_of_two_years_are_in_a_weird/"
        },
        {
            "author": "u/west47june",
            "created_utc": "03-24-2022 04:11:02",
            "distinguished": null,
            "edited": false,
            "id": "tlw9pg",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlw9pg",
            "nsfw": false,
            "num_comments": 15,
            "permalink": "/r/relationship_advice/comments/tlw9pg/my_21f_dads_38m_fiancé_34f_has_pushed_me_out_of/",
            "score": 8,
            "selftext": "It's always been me and Dad. Him and my mum were teen parents and she left when I was a couple of weeks old. I've never had a relationship with her or either of my grandparents. Dad was kicked out at 17 and my mother's parents supported her and didn't want anything to do with me either. When I say that it's always been me and Dad, I mean it.\n\nHe has had two other girlfriends that I know of and I've never had any issues with either of them. In fact, I still have a relationship with his most recent ex as I work for her in her salon and I socialise with her. I was part of the bridal shower for her wedding. Dad and her didn't end on bad terms so it's not awkward and they're still really friendly with each other. She was a little younger than my dad so she really felt more of an older sister to me. I wouldn't say she was like a mother figure but she definitely helped me through my teenage years with all the \"girly things\" that Dad couldn't help with. I have such a good relationship with her and loved her when she was with my Dad.\n\nHonestly, I don't have an issue with my Dad dating or finding someone else, my issue is with this particular woman. So Dad and the fiancé had been dating for a year before he introduced me to her when I was 18. I instantly hated her. She made me feel so uncomfortable in my own home and made me feel like an inconvenience to her. I could tell from the very beginning she wanted me gone and that I didn't fit into whatever plan she had for my Dad. And I made it clear to my Dad that I didn't like her, and made it clear to her also. She made me feel like I didn't belong in my own home that I'd grown up in and made me feel like an alien. She wasn't warm and loving, she wasn't fun and exciting, or kind in any way.\n\nShe's also a liar and a cheat. I'm positive that she cheated on her previous husband with my Dad and she's cheated on my Dad multiple times also. So they met through work. My Dad has worked for this company for a long time and during my high school years, I was allowed to sit at a spare desk after school for the last half an hour of my Dad's work hours and do my homework. I know a lot of the people that work there very well because of this and bumped into one of the ladies that worked there. She knows the fiancé's ex husband and had found out that she had used my Dad to get back at her husband when they first got together. The husband found out and filed for divorce.\n\nMy Dad was and still is under the impression that they were already going through the divorce when they started dating. Even if this wasn't the case, me and my Dad have the kind of relationship where if I had gone to him with what I had found out, he would have told me the truth. He is adamant that the fiancé and her husband were going through the divorce proceedings when they got together because that's what she tells him. I tried reaching out to her ex husband for confirmation but he blocked me. Understandable but annoying at the same time.\n\nIt was also around this time that I did some real digging on her. I found two active dating profiles and a second facebook account that she'd blocked my Dad from seeing. However, I stupidly didn't screenshot anything so after I took this information to my Dad, they were deleted and I couldn't find them again. She denies everything and tells him I'm making things up to cause trouble and does the whole manipulative fake crying routine, plays the victim, etc and so me and Dad have an argument.\n\nThen he drops she's moving in. I literally could not believe it. I told him that if she moved in then I would move out. He asked me to try and get along with her and the day after she moved in, I moved out with my boyfriend into a place of our own. I cannot tolerate her or the way she manipulates my Dad and I have no interest in getting to know her. She's full of lies and manipulation. I refused to go back to my childhood home as I was never welcome there once she moved in, and extended the same courtesy to her. She was not welcome at my house either and only got to see my Dad maybe once or twice a week after this. So she's already managed to half shove me out already.\n\nSo in 2020 they were supposed to get married. Dad asked me to be a bridesmaid and I refused. I also declined my invitation to the wedding and told him that I refused to accept that he was marrying her and wanted no part of it. She wanted to reschedule for when they opened up weddings to small parties again she insisted that they get married then. I maintained my position on him marrying her and Dad said no because he wanted to work things out between us all before they married and she threw a huge hissy fit.\n\nSo she got herself pregnant to force him into marrying her. She knew that he would do the right thing by her and marry her if she was pregnant and had a kid \"by him\". Honestly, you can tell at first glance that the kid isn't his. It looks nothing like either parent and I worked out the date that she \"conceived\" was when she was on a \"girls trip\" which I'm positive wasn't even on a \"girls trip\" and she was cheating on him again. But he's stupid and insists that it's his kid. He won't listen to me when I talk to him about this and she's so manipulative that he believes everything she says.\n\nAnyway, I take the same stance to the kid that I do her. It's not related to me, I don't accept it and it's not welcome in my house. I've never met it and have no interest in doing so. Made this explicitly clear to my Dad.\n\nI then found out that I was pregnant and was so excited to tell my Dad. I made a huge deal out of telling him and got balloons with presents that say Grandad on them. He was so excited about it and so supportive of me and my partner. But obviously she had to ruin that special moment for me. Literally five minutes after he made the announcement on facebook about being a Grandad, she called him and made up some bullshit story about something being wrong with \"their\" kid. There was nothing wrong with the kid at all and she just says it was \"first time mum nerves\". No she wanted to ruin my moment with my Dad.\n\nMy Dad's been great about my pregnancy. Him and my partner already get on well but it's brought them so much closer. We found out the gender early and found out I was having a girl so he's been helping my boyfriend redecorate and transform the spare room into a nursery and he's bought so many things for the baby. He really is so excited.\n\nRecently, whilst pregnant, the fiancé cornered me in a car park and intimidated me. She told me that I had to give my Dad my blessing and be happy for him and threatened me. I felt so intimidated as I was alone and she was really aggressive. Apparently my Dad had mentioned about postponing the wedding again and she wasn't happy about it. She has to get what she wants. I told my Dad about this but she pulled the classic manipulation tactic of fake crying and told him it was the other way around and that I cornered and intimidated her. I'm 5'2 and have to pee every 5 minutes, I couldn't initmidate anyone. So he believed her and it caused a huge argument between me and my Dad. Just what she wanted.\n\nSo obviously the wedding is on again and due to go ahead in May. I still maintain that I will have no part of it, I don't accept it and I don't give him my blessings. I won't be attending and made that very clear. But I then told my Dad that if he married her, then it would mean that we're no longer family. He knows exactly what she's like, what she's done to him and what she's done to me. I'm his daughter and he shouldn't tolerate her pushing me out in the way which she is and has always planned to do. He's tried to persaude me to come and asked me to do it for him, but I told him that if he wouldn't leave her after what she's done to all of us then I have no interest in having anything to do with her or their wedding for him. I told him that marrying her meant that he would no longer be in mine or my daughter's life and that it is him choosing to believe her over me.\n\nToday he came around after work and told me that we \"need to take some time apart\" and \"we need time to think about things\" and \"assess our relationship\". It's all a load of bullshit. My Dad doesn't speak like that. Those are her words coming out of his mouth. He's chosen her over me. Obviously I'm upset and hurt. She's completely managed to push me out of my Dad's life by manipulating him. She got exactly what she wanted from the beginning. I told him straight that if he chooses to walk away and leave me now then he leaves me for good; there's no second chance at us having a relationship. I didn't give my mother one when she came crawling back so he doesn't get one either. He knows exactly how much trauma I was put through by my mother and now wants to do it to me all over again. And this hurts a lot more than my mum because it has always been me and my Dad.\n\nI want my Dad back and I want my daughter to know and have her Grandad around. She needs all the family she can get around her. But, part of me doesn't know if I do want him back after this. I want this to have never happened. Having your mum disown you and not want you leaves you with a fuck ton of abandonment issues and as the single parent that raised me all my life he should know this. He knows how much trauma this causes. He knows how much something like this affects me. It's even worse him doing it knowing what I went through with my mum. I don't know if I can forgive him for this, or even if I should. I just know that if we do somehow have a relationship after this, which right now I can't see at all, it will never ever be the same way again.\n\nI can't stop crying. I'm so upset and hurt. I feel like I've been abandoned all over again. I'm so sad for my little girl. My partner is working away for a couple of days and won't be back until Friday night so I feel like I don't even have someone to talk to about all of this right now. I feel sick to my stomach. i don't even know what I hoped to get out of this. I didn't really know where else to turn about this. Maybe I'm hoping for advice? Or if people have similar stories to this? Or maybe just some kinds words? I don't really know. I just know that I'm upset and can't sleep.",
            "spoiler": false,
            "stickied": false,
            "title": "My [21F] Dad's [38M] fiancé [34F] has pushed me out of my family",
            "upvote_ratio": 0.84,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlw9pg/my_21f_dads_38m_fiancé_34f_has_pushed_me_out_of/"
        },
        {
            "author": "u/sulaimanxo",
            "created_utc": "03-24-2022 10:52:29",
            "distinguished": null,
            "edited": false,
            "id": "tm2b3s",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm2b3s",
            "nsfw": false,
            "num_comments": 10,
            "permalink": "/r/relationship_advice/comments/tm2b3s/did_i_cheat/",
            "score": 2,
            "selftext": "Ive been in a long distance relationship for over 3 years.\nWe never met but I love her so much but today I saw a massage number. \n\nSo I booked a session, I had little idea that she is a prostitute.\n\nSo she gave me a massage and then gave me a handjob in the event while I kissed her neck and lips imagining my gf \n\n\nI feel so so so shit right now, literally want to cry but what should I do!\nI carve for her touch and love \n\nTell me please\nDid I cheat on her and what should I do next",
            "spoiler": false,
            "stickied": false,
            "title": "Did I cheat",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm2b3s/did_i_cheat/"
        },
        {
            "author": "u/FabulousWillingness9",
            "created_utc": "03-24-2022 10:50:45",
            "distinguished": null,
            "edited": false,
            "id": "tm2a8c",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm2a8c",
            "nsfw": false,
            "num_comments": 3,
            "permalink": "/r/relationship_advice/comments/tm2a8c/when_do_you_know_when_to_say_i_love_you/",
            "score": 2,
            "selftext": "I have been dating a guy for 4 months and we just made it official this week, I am otterly in love and have never been so happy in my entire life\n\nOur chemistry is off the chart to the point we stare into each other's eyes for seconds on end from across the room in complete silence\nIt's insane\n\nSometimes it accidentally almost rolls off my tongue, when he want to leave I almost say it and hold back, \"like wtf control yourself\"\n\nI almost said it when we are getting physically intimate, it's like it's forcing to come out and I don't know why \nShould I wait for him first, is it too soon?\nI'll be crushed if he doesn't say it back\n\nAny input would mean alot :)",
            "spoiler": false,
            "stickied": false,
            "title": "When do you know when to say \"I love you\"?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm2a8c/when_do_you_know_when_to_say_i_love_you/"
        },
        {
            "author": "u/sooooojel",
            "created_utc": "03-24-2022 07:04:58",
            "distinguished": null,
            "edited": false,
            "id": "tlz528",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlz528",
            "nsfw": false,
            "num_comments": 17,
            "permalink": "/r/relationship_advice/comments/tlz528/my_f30_ex_m30_threatened_to_kill_me_and_anyone_i/",
            "score": 3,
            "selftext": "We have a 1 year old together. He has serious mental issues and owns guns. He told me today he’d shoot my next bf and myself if he found out about us. I have no interest in a relationship of any kind because of how toxic the one I had with him was… but I’m considering calling the police.\n\nThis threat went on for 2-3 hours in person in front of our child. He is seriously scary. I don’t think he’d actually kill me but I also don’t think I should have to deal with the constant psychological abuse.\n\nHe’s threatened to kill people in my family before and even the police if they got involved.\n\nIf I do call the police I don’t want him arrested or to have a protective order because I want to see my child with him without some kind of mediator. I think there needs to be some record of this though…",
            "spoiler": false,
            "stickied": false,
            "title": "My (f30) ex (m30) threatened to kill me and anyone I get involved with. What should I do?",
            "upvote_ratio": 0.81,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlz528/my_f30_ex_m30_threatened_to_kill_me_and_anyone_i/"
        },
        {
            "author": "u/Karatenone95",
            "created_utc": "03-24-2022 10:49:47",
            "distinguished": null,
            "edited": false,
            "id": "tm29q7",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm29q7",
            "nsfw": false,
            "num_comments": 2,
            "permalink": "/r/relationship_advice/comments/tm29q7/relationship_mental_health/",
            "score": 2,
            "selftext": "Hi reddit, i need your advice, I'm 27f and he's 28m. We met each other through online games last six months, we really had a really good connection with each other and we both fell in love. It's been so long since i ever felt loved and seen, and so do him. And then we already met each other in real life. Here's the thing: in real life we live a different life. For example: I have a really good job/career while he's still unemployed. I really don't mind about that. But sometimes these circumstances always bring him down. He always saying things like \"i'm out of your league\" and \"I'm worthless\" i know that there is a sign of depression from him. I always tell him that it doesn't matter and that we can get through it but he always pushes me away every now and then. I don't want him to think that i'd rather be with other men than him or that i should move on from him because i love him. January was my birthday and i kinda hoped that he gave me a little present it doesn't have to be something big or extravagant but i just want something he gave me. I waited until late January and then playfully asked him about my present and he said sorry for not able give me anything and to be honest i was upset a little because i was hoping for it but then we brush it off and nothing happened the next day and i wasn't upset with him anymore about it. But then the more we talk after that things gotten more awkward, I felt that he's not responding like how he used to be anymore and then I was emotional and left him on read for a week because i need some space. A week later (before valentine's day) when i was in clear mind i texted him and said things like we should work this out together because i felt that he's been acting different but he said that it's probably just in my head but then he won't answer my calls on valentine's day, after that i felt insecure and he just read my text without saying anything on his behalf. I couldn't bear if he did that because he thought that i'm better off without him or because he thought that he is worthless so a month later i tried texting him again asking if we should just meet because i want to give him some reassurance and trying to fix things with him again. Long story short, we did phone call instead and he said to me that he likes to push people away and he's scared that if he'll do that to me over and over again, then i said things like it's okay we'll work this out together and he only said that i was so sweet and then we texted again, of course things were not the same after that and then days later he proceeds doesn't want to meet me anymore and stop replying my text last Saturday then i told him to take care of himself and if he ever need someone to talk to he can always hit me up. Please tell me what I should do because now I don't know if it's because his mental health or that he doesn't love me anymore\n\nNote: sorry for bad english because it's not my first language",
            "spoiler": false,
            "stickied": false,
            "title": "Relationship & mental health",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm29q7/relationship_mental_health/"
        },
        {
            "author": "u/AggressiveRat",
            "created_utc": "03-24-2022 10:46:33",
            "distinguished": null,
            "edited": false,
            "id": "tm2847",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm2847",
            "nsfw": false,
            "num_comments": 21,
            "permalink": "/r/relationship_advice/comments/tm2847/m25_and_f25_taking_a_break_after_10_years_and/",
            "score": 2,
            "selftext": "So here I am at 4 am pouring my soul to whoever sees this on the internet. To put it plainly, I have been in a relationship with my girlfriend since we were 16. We moved out at 18 and made bad financial decisions/ got animals (2 dogs/2 cats) and a plethora of fights swept under the rug leading to us being 25. I am deeply in love with this woman but she stated recently she wasn’t happy and felt like she was wasting her 20s. We decided on a break, where we still of course talk and see each other but move out into our respective parents home to work save money and work on ourselves.\n\nShe stated this break was to work on herself so that some day we can be together stronger (she was right, we actually needed something to change cause our relationship was just surviving cause it was easier without the pain of not being there)\n\nAnyways she did state she wants to hang out with her girlfriends and live life and that I should to, learn to be adults solo so we can come together as a strong couple since we grew up so fast and been together since 16. \n\nSo we both still have our locations on our phones and have talked about it before how we both constantly check up on each other and how that may not be healthy but I can’t let go. Knowing where she is and if she’s safe brings me peace of mind.\n\nWell today was the first day she was out with her friend from work I’m familiar with, but my stupid self continued to check the location every few minutes. She spent quite some time at her friends then drove to a spot I was unfamiliar for 10 minutes or so then to a spot for drinks. She was out for hours before going back home and I just have this odd feeling of negativity of where was she? Was it just maps showing them stop for gas and a little off. I know this sounds pitiful. She is all I know, and I want us to return back to each other. I’m at my moms in a tiny bed cause I took over my brothers room for a little and I’m just not in a good headspace. \n\nI trust her and know she wouldn’t be out with any guys, but that little what if is always there.\n\nShould I bring these concerns up to her, or just play it cool and talk like we have been. \nWe text everyday and last Sunday I spent the night because she asked me too (she is scared of the thunderstorm) and we decided weekends I can spend the night. \n\nA two days ago we ramped up to texting each other all day and she stated maybe we should tone down on that since it defeats the purpose of the break so the day she went out was a day we barely spoke. \n\nPlease, truthfully I need advice. (I’m very / or trying to be / very in tune with religion and my faith if that helps but sometimes it’s hard to trust god) religious advice is welcome but not required  \n\n\nTLDR:\n10 year relationship and just hurting and needing advice. I’m the male in the relationship if that matters",
            "spoiler": false,
            "stickied": false,
            "title": "M(25) and F(25) Taking a break after 10 years and need help",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm2847/m25_and_f25_taking_a_break_after_10_years_and/"
        },
        {
            "author": "u/GetAwayFromMe355",
            "created_utc": "03-24-2022 10:34:08",
            "distinguished": null,
            "edited": false,
            "id": "tm21u2",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm21u2",
            "nsfw": false,
            "num_comments": 16,
            "permalink": "/r/relationship_advice/comments/tm21u2/if_a_guy_shows_interest_in_me_f25_i_assume_he/",
            "score": 2,
            "selftext": "I can't date or let any guy near me. I have really bad experiences from dating where usually I fall for someone and it turns out they don't really care about me, they just wanted sex. I usually have guys fake interest in me for several months just to get laid. Its become stale to the point I don't even engage with men on that level anymore.\n\nMy most recent experience was with a male friend I've known for 3 years. He pursued me for almost a year, I started liking him and in the end it came out that he wasn't really interested in me he just wanted sex and then bail. If I can't even trust men I've known for years, then who can I trust?\n\nI'm average looking, don't stand out, have been told I'm nice and a bit funny. I get along well with folks in college and with coworkers. At the same time almost every woman around me is getting into a relationship whereas I struggle so much with this and I wonder why.\n\nIs anyone else struggling with this?\n\nTLDR: If a guy shows interest in me (F25) I assume he just wants sex and shut down after only having bad experiences in the past. Anyone else feeling the same?",
            "spoiler": false,
            "stickied": false,
            "title": "If a guy shows interest in me (F25) I assume he just wants sex and shut down after only having bad experiences in the past. Anyone else feeling the same?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm21u2/if_a_guy_shows_interest_in_me_f25_i_assume_he/"
        },
        {
            "author": "u/Rough_Tea_3428",
            "created_utc": "03-24-2022 10:28:52",
            "distinguished": null,
            "edited": false,
            "id": "tm1z82",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm1z82",
            "nsfw": false,
            "num_comments": 6,
            "permalink": "/r/relationship_advice/comments/tm1z82/i_do_not_know_if_this_is_the_right_thing_to_do/",
            "score": 2,
            "selftext": " Me (20M) and my girlfriend (18F) have been together for almost 6 months. Since the beginning of our relationship we always text eachother goodnight. my girlfriend has also mentioned that she really likes this. A little while back i fell asleep on accident, this happend twice i said sorry to her and she said no problem can happen.\n\nYesterday night i was having trouble with my internet. At 1 am she sends me goodnight love you, but since my internet was not working i got the message at 1:27 am. I tried to reply but none of my messages would send. I was already really tired and started to panick, so i tried to call her. She always has her phone on silent, so my reasoning was if she stayed up a bit she will see that i am calling her but if she sleeps i will not wake her up. Well aparently for some reason she woke up from it. And got mad, i tried to explain that i just didn't want to let her down and that i did not want to make it seem like i fell asleep again. she said \"i don't care, just let me sleep. now i won't be able to sleep cause you made me stressed by calling and making me feel like something is wrong\".\n\nright now she won't reply to any of my messages and is completely ignoring me, i am seriously thinking about going to her house tommorow is she keeps ignoring me even tho it is a 2 hour journey.",
            "spoiler": false,
            "stickied": false,
            "title": "I do not know if this is the right thing to do",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm1z82/i_do_not_know_if_this_is_the_right_thing_to_do/"
        },
        {
            "author": "u/iwasamistake02",
            "created_utc": "03-24-2022 10:27:28",
            "distinguished": null,
            "edited": false,
            "id": "tm1yk7",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm1yk7",
            "nsfw": false,
            "num_comments": 6,
            "permalink": "/r/relationship_advice/comments/tm1yk7/my_boyfriend_jokes_about_flirting_w_others_or/",
            "score": 2,
            "selftext": "Me (20F) and my boyfriend (18M)  have been in a committed relationship for the past three years. Recently he moved to a different city for college. So this whole LDR thing has kinda been hard on us but we're making it work. \n\n He jokingly talks about cheating or flirting with other girls for fun..\n\nwhen i get upset he says he's just joking and that he's sorry. But he has done this soo many times which makes me wonder if that is what he really wants.  \n\nIt bothers me a lot and I've talked to him about it but he just brushes it off saying \"i love you the most, I'm just messing w you\" \n\ni completely trust him and i never doubted his loyalty the past 3 yrs but hearing his stupid \"jokes\" or whatever really pisses me off and he doesnt seem to take my frustration seriously... \n\nidk what to do y'all. \n\nhow do i get to know his true intentions? what do i do? i could really use some advice.",
            "spoiler": false,
            "stickied": false,
            "title": "My boyfriend jokes about \"flirting w others\" or \"cheating\"",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm1yk7/my_boyfriend_jokes_about_flirting_w_others_or/"
        },
        {
            "author": "u/ExcitementDisastrous",
            "created_utc": "03-24-2022 08:12:09",
            "distinguished": null,
            "edited": false,
            "id": "tm03qm",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm03qm",
            "nsfw": false,
            "num_comments": 5,
            "permalink": "/r/relationship_advice/comments/tm03qm/feeling_tormented/",
            "score": 4,
            "selftext": "What is your reaction to a loved one hurting and feeling very sad. What do you do physically, or verbally?  Recent events have me questioning the love my husband has for me. This will help me see how others react.",
            "spoiler": false,
            "stickied": false,
            "title": "Feeling Tormented",
            "upvote_ratio": 0.83,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm03qm/feeling_tormented/"
        },
        {
            "author": "u/zoey3013",
            "created_utc": "03-24-2022 10:19:34",
            "distinguished": null,
            "edited": false,
            "id": "tm1ul0",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm1ul0",
            "nsfw": false,
            "num_comments": 15,
            "permalink": "/r/relationship_advice/comments/tm1ul0/telling_my_ex_i_cheated/",
            "score": 2,
            "selftext": "Me (24f) and him (24m) had a 3 year relationship. 5 months after the pandemic started, our relationship wasn't good because of the lack of communication while on quarantine. I cheated (had phone spicy time with someone I had met 3 days before). Because I knew he would break up with me, and I had tough of breaking up with him before, I decided to break things up that same day, without telling him what happened, only the reasons I already wanted to do it. I though I was saving him from the pain.\n\nNow, a year and a half from that, we started talking again and became best friends. Then friends with benefits. Before this, I never thought there was any reason to tell him, as it would only make him feel bad. But now, I constantly feel like I'm deceiving him by having this relationship while he doesn't know, specially since I don't know if he would want to have it if he knew.\n\nAfter talking with my best friend I decided to tell him. But now I'm not so sure about it. He knows I had a thing with someone about the same time we broke up. He once even 'jokingly' asked and I denied cheating (by that time I didn't think out relationship would be what it now is).\n\nSo... What should I do? Would knowing now be any good for him?\n\nTL;DR: i cheated on my bf a year and a half ago, right now we're best friends and FWB, should I tell him?",
            "spoiler": false,
            "stickied": false,
            "title": "Telling my ex I cheated?",
            "upvote_ratio": 0.75,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm1ul0/telling_my_ex_i_cheated/"
        },
        {
            "author": "u/Adventurous_Air3291",
            "created_utc": "03-24-2022 06:33:11",
            "distinguished": null,
            "edited": false,
            "id": "tlynq0",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlynq0",
            "nsfw": false,
            "num_comments": 11,
            "permalink": "/r/relationship_advice/comments/tlynq0/im_20_and_i_dont_wanna_settle_down_but_i_think_i/",
            "score": 5,
            "selftext": "Hello, I am needing some guidance in terms of morals and ethics, I want to handle this situation as well as I can to benefit myself and my partner. I have been in a relationship with my partner for over 2 years now and we are planning on moving in together. Initially this was exciting but as time goes on I am starting to fear the commitment of the relationship. If I had to say, I could die happy with this person by my side, but I want to explore myself more sexually and live more of life before I decide to commit to a long term love. What should I do? I don’t want to end up regretting letting the love of my life go, but how do I even know if they’re the love of my life if I haven’t really explored myself? Is it superficial to want these things?",
            "spoiler": false,
            "stickied": false,
            "title": "I’m 20 and I don’t wanna settle down but I think I met the girl of my life. What do I do?",
            "upvote_ratio": 0.78,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlynq0/im_20_and_i_dont_wanna_settle_down_but_i_think_i/"
        },
        {
            "author": "u/justanobody2278",
            "created_utc": "03-24-2022 10:16:33",
            "distinguished": null,
            "edited": false,
            "id": "tm1t5k",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm1t5k",
            "nsfw": false,
            "num_comments": 8,
            "permalink": "/r/relationship_advice/comments/tm1t5k/why_am_i_verbally_abusive_to_my_bf/",
            "score": 2,
            "selftext": "hello, I am a 20f whose been in a relationship for almost 4 months now. i got out of an unhealthy 3 year relationship this time last year and hadnt had any interest in dating anyone until this guy. he is sweet and seems genuine but I find myself getting so frustrated over small things and I start name calling. i have never been like this before, even when my ex consistently lied to me I wouldnt name call him like I do my new boyfriend who has treated me good. i dont know how to explain how I’m feeling without being mean and I hate myself for it. I try and tell myself I’ll calm down before I say stuff but whenever I’m mad I dont think and they just come out. i am on meds and have a lot of childhood trauma as well. ive tried explaining to my boyfriend that im clearly mean and depressed and need to work on things before dating again but he says we’re already in this and he’s here for me and we’ll work on these things together but im not getting any better. name calling and anger is never okay and im unsure how to work on it without me ending the relationship. any advice without being rude is appreciated, I know im a big problem here.",
            "spoiler": false,
            "stickied": false,
            "title": "why am I verbally abusive to my bf?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm1t5k/why_am_i_verbally_abusive_to_my_bf/"
        },
        {
            "author": "u/CJPageMusic",
            "created_utc": "03-24-2022 08:02:51",
            "distinguished": null,
            "edited": false,
            "id": "tlzyto",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlzyto",
            "nsfw": false,
            "num_comments": 2,
            "permalink": "/r/relationship_advice/comments/tlzyto/feeling_inadequate_almost_picked_on/",
            "score": 3,
            "selftext": "For a while now I’ve felt like I’ve been exiled from receiving or giving love. There’s been many people around me given chances to have genuine love, but cheat, lie, and borderline abuse their SO’s. It’s comical as to how they are in a relationship. It hurts to know that they mooch and leach, but I will remain alone with my thoughts, and will continue too for the foreseeable future. \n\nSocial interaction was scary for me, and I don’t think I’m intimidating or unapproachable. I’ve been told by many that I’m a sweet human, and am respectable. I have lots of love to give, and morals set in the right place. I’m building a business, I’m focused and very in tune with whats my life direction is. I don’t really party or even get messed up. I play in bands and do music fulltime as well as run a venue and etc.\n\nI find the lack of connection to love beginning to weigh on me. It’s been years, and even then There wasn’t any love. In fact, any past relationship was filled with trauma and abuse, with lasting effects. I have been able to find love within myself to love myself, and try to begin being happy with who I am. That has been a process I have finally began to peak, and haven’t been more in touch with who I am. But it doesn’t change the sadness of not having someone to love with myself. \n\nWhy is it shitty humans have incredible partners, but I am still alone after everything else? \n\nWhy am I used physically after every sort of connection gets intimate? Why the mental games? Why the anguish?\n\nInb4 cry me a River you lonely fuck…\n\nIt is very demoralizing to see all the work you do and the genuine and authenticity nature behind it fall on deaf ears, and to be reminded that people far worse off, moral and situation wise, have the most love given to them. A hug man, would it kill someone to hug me?\n \nWould it hurt someone to love me? There I said it.",
            "spoiler": false,
            "stickied": false,
            "title": "Feeling inadequate, almost picked on",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlzyto/feeling_inadequate_almost_picked_on/"
        },
        {
            "author": "u/CJ_Flowers",
            "created_utc": "03-24-2022 02:03:40",
            "distinguished": null,
            "edited": false,
            "id": "tlqbxs",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlqbxs",
            "nsfw": true,
            "num_comments": 42,
            "permalink": "/r/relationship_advice/comments/tlqbxs/i_cant_do_this_anymore/",
            "score": 9,
            "selftext": "I'm so tired of being alive and I'm tired of not doing anything about it. But I've been in a relationship for almost a year now. Do I break up with him first? How would I do that? I'm so sick of living for the sake of the people around me but I don't want to traumatize him either.",
            "spoiler": false,
            "stickied": false,
            "title": "I can't do this anymore",
            "upvote_ratio": 0.7,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlqbxs/i_cant_do_this_anymore/"
        },
        {
            "author": "u/LogicalFix4093",
            "created_utc": "03-24-2022 07:56:06",
            "distinguished": null,
            "edited": false,
            "id": "tlzv5b",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlzv5b",
            "nsfw": false,
            "num_comments": 4,
            "permalink": "/r/relationship_advice/comments/tlzv5b/living_with_parents_to_save_money_or_move_out_and/",
            "score": 3,
            "selftext": "Hey all, I’m going back and forth between living at home with my parents for the next 2 ish years to save enough money to buy a home, or moving out and renting. I currently am working and tbf I am saving quite a bit, but part of me REALLY wants my own space again. (I moved back in from my college apartment in January after graduating).\n\nA couple months ago I was committed to living at home until I can afford to purchase my own home, but I’m not sure if I can do it anymore lmao. I love my parents, but they are so traditional and I have almost no privacy, there’s no such thing as locks. They’re also quite strict so I can’t see my boyfriend very often (a couple times a month if I’m lucky), when I do see him or go with him overnight I have to pretend like I’m going with my friends. My parents have my location as well so.. yeah. \n\nI’d just like some opinions here. I am really sick of renting, I rented for 2 years in college. I know these seem like such surface level things that I can suck up (I was fully planning on doing that), but now that I’m actually living it I’m not so sure anymore. I want to be able to live without tip toeing around, sneaking out like I’m a teenager, getting phone calls if I’m out past a certain time. I’m almost 23 and while I am very grateful and appreciative of my parents, I just want to live anxiety free and live my life without feeling like my every move is examined under a microscope. But on the flip side, dealing with this and saving for a couple years and being a homeowner before I’m 30 would be a huge reward. Also I get that I’m lucky for having the option of living rent free, it’s a blessing not everyone has that option. \n\nI know it’s much more financially smart to stay at home and save that $1-2k every month towards a down payment instead of spending it on rent. Please let me know your opinions!\n\nTL;DR: I’m going back and forth between living at home with my strict parents to save enough money for a down payment on a house, or moving out and paying rent to live my life without dealing with all of the rules and anxiety that comes with living with my parents.",
            "spoiler": false,
            "stickied": false,
            "title": "Living with parents to save money, or move out and pay rent?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlzv5b/living_with_parents_to_save_money_or_move_out_and/"
        },
        {
            "author": "u/sunshin3hippi3",
            "created_utc": "03-24-2022 07:50:54",
            "distinguished": null,
            "edited": false,
            "id": "tlzsm5",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlzsm5",
            "nsfw": false,
            "num_comments": 1,
            "permalink": "/r/relationship_advice/comments/tlzsm5/my_23f_so_25m_talked_badly_about_me_to_his/",
            "score": 3,
            "selftext": "I’ve been through a lot with this person and the more I reflect on it the more I just don’t know how to move forward or what to do. We’ve been together for almost 4 years, live together, and barely scrape by as it is. I don’t have family I can move in with, and I’m supposed to be starting school soon. I need to figure out how to make this work and move past it. Looking for some advice. Please be kind.  \n\nA little background: recently I found out I have autism on top of my ADHD (if anyone’s going to be ableist, I’ll immediately block you). It’s been great because I finally have a name and something concrete to explain my brain to me. However, it’s also been extremely challenging because my world has basically fallen apart and I’ve had to build it all back up. Especially when I was first diagnosed (about 2 months ago), I had an extremely hard time. That’s when I realized it was because I was still constantly putting other people’s needs before my own in every scenario. So I started taking care of me a little bit more. Not in every scenario, it’s not like I was just completely giving up. But I’ll admit, it’s been hard and I’ve really been struggling.\n\nWell, we had a really big fight last week where he basically told me he’s been talking to his best friend (who I was previously close with) and his mom about me, and they all agree that I “don’t care about anyone but myself” and “only ever think of myself”. This absolutely broke my heart because all I ever do every single day is worry about other people, how they feel, and how I can make them more comfortable. When I asked him what he meant, he said it’s because I “don’t stand up to kiss him when he comes home”, as well as “other little things like that”. He wouldn’t provide further details. I’m at a loss you guys. \n\nMy biggest issue with this is when we first met, he was a totally different person. A very mean person, who I had to basically teach how to properly communicate. And then, just when things were turning around for us, he changed jobs to overnights, and circumstances (COVID) caused us to become long-distance. It was again a dark time. He was not a nice person all of the time. But I stuck by him. And now the second I’m the one whose truly struggling, he can’t deal? And for his friend and mom to say that about me… I just know he didn’t tell them about the autism aspect, and even if he did, they wouldn’t completely understand because they don’t view mental health as something that’s pertinent. \n\nI also know he told me that they said those things simply to hurt me. He admitted that as well. The thing is though, he knew something like this would be extremely hard for me to get over. Social situations have always been hard for me, and now I can’t even imagine going to visit his friend or mom. I don’t know. How can I get past this?",
            "spoiler": false,
            "stickied": false,
            "title": "My (23F) SO (25M) talked badly about me to his friends/family and I don’t know how to get past it",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlzsm5/my_23f_so_25m_talked_badly_about_me_to_his/"
        },
        {
            "author": "u/annoymous9",
            "created_utc": "03-24-2022 07:43:27",
            "distinguished": null,
            "edited": false,
            "id": "tlzox5",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlzox5",
            "nsfw": false,
            "num_comments": 28,
            "permalink": "/r/relationship_advice/comments/tlzox5/whats_my_boyfriend_up_too/",
            "score": 3,
            "selftext": "This morning I woke up (F21) and my bf (M21) was under the covers I was a bit surprised cause he never does that but then I saw the light from his phone and noticed his phone wasn’t on his bedside table. Usually when he goes on his phone he just lays there and uses it he doesn’t go under the covers and hide and he seems really off with me this morning now, what’s he doing? Could really do with some advice thank you",
            "spoiler": false,
            "stickied": false,
            "title": "What’s my boyfriend up too?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlzox5/whats_my_boyfriend_up_too/"
        },
        {
            "author": "u/Instant_Reply",
            "created_utc": "03-24-2022 03:55:10",
            "distinguished": null,
            "edited": "03-24-2022 04:18:52",
            "id": "tlvz19",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlvz19",
            "nsfw": true,
            "num_comments": 11,
            "permalink": "/r/relationship_advice/comments/tlvz19/i_want_to_break_up_with_my_boyfriend_is_this/",
            "score": 7,
            "selftext": "I want to break up with my boyfriend but very nicely and I need to know if this script I wrote good. Our relationship is a secret and I don’t want people Ik irl to know\n(This is my first relationship and the first time I’ve ever broken up with someone so I want to do it nicely)\n \nSo here it is\n\nHey…\nSo look, Idrk how to do this type of stuff so don’t take this to personal or harsh but I don’t really feel like dating is for me. I really do like you and you didn’t do anything wrong it’s just I feel kinda trapped. I’m so sorry I hope we can still be cool cause I’m not tryna make you my enemy I also don’t want you to hate me or anything and I would appreciate if we could still keep this on the dl.",
            "spoiler": false,
            "stickied": false,
            "title": "I want to break up with my boyfriend is this paragraph good?",
            "upvote_ratio": 0.82,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlvz19/i_want_to_break_up_with_my_boyfriend_is_this/"
        },
        {
            "author": "u/Grouchy_Use_1449",
            "created_utc": "03-23-2022 15:46:26",
            "distinguished": null,
            "edited": false,
            "id": "tkvk43",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tkvk43",
            "nsfw": false,
            "num_comments": 160,
            "permalink": "/r/relationship_advice/comments/tkvk43/i_dont_want_2_kids/",
            "score": 57,
            "selftext": "Hello. I have come here because I don’t have anybody I trust enough to talk to about this. \n\nI’m recently married to the woman I’ve been with for 6 years now got married in October of 21 we have already had a kid and have been living together for 4 years. \n\nMe and my wife have been talking and she keeps bringing up the fact that she wants another kid. Im not sure sure that I want another kid being that I am completely content with having just my little boy. As of last night we got into the discussion of the “what if I really don’t want another kid?” She then laid it down on the table that if I truly do not want another kid that this marriage will NOT work. So now I feel obligated to give her another baby soon or lose everything. \n\nI asked the question “what if I don’t give you another baby?” I was then told that she would go get a sperm donor and I have the choice to stay or gtfo. I’m not ready for a second kid and I don’t think I ever will be. The fact that she would be willing to go impregnate herself and expect me to be there for the second child seems kind of selfish? \n\nWhat do I do if she inseminates herself for another kid without my permission? Do I have to be there for the kid? Do I have a choice? Or is it really all up to her? I feel like I am being pressured to impregnate my wife. What should I do?",
            "spoiler": false,
            "stickied": false,
            "title": "I don’t want 2 kids",
            "upvote_ratio": 0.82,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tkvk43/i_dont_want_2_kids/"
        },
        {
            "author": "u/Guytobeknown",
            "created_utc": "03-24-2022 07:37:38",
            "distinguished": null,
            "edited": false,
            "id": "tlzm3v",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlzm3v",
            "nsfw": false,
            "num_comments": 22,
            "permalink": "/r/relationship_advice/comments/tlzm3v/am_i_overthinking/",
            "score": 3,
            "selftext": "\n\nHey first time really posting anything like this , I M21 and gf 21 have been dating for 5.5 years. I really don’t like being the controlling type so I try to be chill most of the time when it comes to her going out and stuff which is not an issue. So awhile back maybe 3 months ago I hung out with a guy that me and my gf know since me and the guy (let’s call him Alex) both have the same cars and like going to car meets. I have really open communication with my gf and I tell her it’s okay if she has guy friends as long as there is nothing going on. She’s more of the “let me go through your phone type of gf” which I don’t care because i really am not doing anything shady. I’ll get straight to the point , I had been getting a really weird gut feeling that she wasn’t being honest with me and yea ik this will sound bad but she slept over one time and I decided to go through her phone. I noticed her and Alex had been talking more constantly and actually talking to him more than she does to me. I seen they were planning to meet up and catch up and I tried not to think much of it. The next few days idk I felt off and just wasn’t all there with her just because I feel like she’s going behind my back to meet with a guy at night and not letting me know about it. So basically she slept over again and I went on the chat and she tells him “im scared I think he saw our chat :( im scared for the meetup”. Maybe im overthinking but I don’t get why she would hide it if there is nothing bad going on and I’ve clearly mentioned to her that I don’t mind her hanging out with friends as long as she gives me a heads up. I’m in this place where idk if I should just get over it or confront her or what to say. I don’t want to be left looking dumb , no time for that ! Am I overthinking it? Hope someone can give their thoughts or opinions !",
            "spoiler": false,
            "stickied": false,
            "title": "Am I overthinking?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlzm3v/am_i_overthinking/"
        },
        {
            "author": "u/Working-Dinner6004",
            "created_utc": "03-24-2022 07:37:37",
            "distinguished": null,
            "edited": false,
            "id": "tlzm3o",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlzm3o",
            "nsfw": false,
            "num_comments": 5,
            "permalink": "/r/relationship_advice/comments/tlzm3o/advice_anyone/",
            "score": 3,
            "selftext": "I want to break up with my GF. It is just not working for me. It’s been over a year and we are complete opposites of each other. She has no get up about herself. Like, she puts no effort into her appearance. She complains about loosing weight but eats ridiculously amounts of food that sometimes, it makes me sick watching it. I feel as if she have no life outside of me. It’s smothering at times. I try talking to her about it but she says I am an A hole. I don’t get it. I am completely over it. I am holding on because I don’t want to carry the burden of guilt if I break up with her and she self harms herself. Which she have a long history of doing. Last thing I want to do is hurt her but I don’t want to stick around unhappy in the relationship. I just want to be with someone who is fun, who loves them self, someone who doesn’t depend on me for their happiness and not trying to live up to their family approval. What should I do?",
            "spoiler": false,
            "stickied": false,
            "title": "Advice anyone??",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlzm3o/advice_anyone/"
        },
        {
            "author": "u/ThrowRA_needsleep",
            "created_utc": "03-24-2022 09:48:16",
            "distinguished": null,
            "edited": false,
            "id": "tm1f5t",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm1f5t",
            "nsfw": false,
            "num_comments": 13,
            "permalink": "/r/relationship_advice/comments/tm1f5t/my_bfs_snoring_has_suddenly_started_keeping_me_up/",
            "score": 2,
            "selftext": "Throwaway bc he's a redditor and I'm honestly so embarrassed by this. Sorry for the formatting, it's 4:30 and and I'm on mobile. \n\nBackstory: my (24f) and my bf (25m) have been together for 7.5 years, 8 come July. We were long distance for most of that, and he recently moved in like ten months ago or sm.\n\nNow, we've visited each other throughout of college years God knows how many times. And let me tell you, this man snores. So loudly. Like a chainsaw. And while loud snoring like this in the past from family or friends has sent me into sensory overload that leaves me stressed, anxious, and either crying hysterically or irrationally angry, his has never done this. EVER. I cannot stress this enough. I've never had a problem with it up until now. \n\nNow, fast forward to about three months ago. My isnomnia has flared up because of some stressful school stuff, and I'm having issues falling back to sleep, both due to the insomnia and due to the snoring. The high stress situation eventually went away, and I thought all would be well and I could go back to a normal sleep schedule.\n\nI was so, so wrong. \n\nI haven't slept a full night since January. My bf's snoring has gotten either worse, or my stress over not being able to sleep has made it seem like it's so much worse. After a couple weeks of finding me out on the couch trying to just catch a couple hours of rest, we finally talk about why I'm having issues sleeping and I mention his snoring. \n\nHe's so understanding. He wants me to wake him up whenever it gets too bad. But he sleeps like a log and immediately falls back asleep, so this isn't working nor is it sustainable. He usually spends a couple hours gaming after I go to sleep, so I'm able to get a few hours in, but once his REM cycle kicks in I IMMEDIATELY wake back up. It's even worse because I just can't let the rhythm of it lull me back to sleep. The snoring is so irregular in it's pattern that I've had genuine concerns for his health in the past. \n\nI've tried melatonin before I go to bed. I've tried melatonin when I wake up. I've tried rolling him onto his side. I've tried ear plugs. I've tried white noise. I don't know what else I can do. He's so sympathetic to my stress but at the same time he's not taking many steps to remedy the situation on his end, at least not in my eyes. I've talked to him about this before and I don't know what else I can do. I don't know why it's so suddenly flipped a switch in me.\n\nThis seems like something so trivial in regards to other relationship problems people post here but I genuinely don't know what I can do anymore. Any advice is appreciated.\n\nTLDR: my boyfriend's snoring has been waking me up and keeping me awake and I haven't had a full night of sleep in three months.",
            "spoiler": false,
            "stickied": false,
            "title": "my bf's snoring has suddenly started keeping me up at night and I'm at my wits end",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm1f5t/my_bfs_snoring_has_suddenly_started_keeping_me_up/"
        },
        {
            "author": "u/Zerofunlvr",
            "created_utc": "03-24-2022 09:45:30",
            "distinguished": null,
            "edited": false,
            "id": "tm1duy",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm1duy",
            "nsfw": false,
            "num_comments": 2,
            "permalink": "/r/relationship_advice/comments/tm1duy/does_he_m40_want_to_get_to_know_me_f33/",
            "score": 2,
            "selftext": " \n\nI started talking to a guy online for about 5 months\n\nFor context I am 33 F and he is 40 M\n\nWe haven't met in person as we live in different states but I am planning to move to his state, not for him, because I have more opportunities there.\n\nWe met through a foreign language app and started talking.\n\nWe facetime so I know this guy is who he appears to be and not some scammer.\n\nI don't have much experience with men so I wonder if this is normal.\n\nWhen we facetime we can talk for hours without realizing it but when we text and I ask him questions but his replies are vague.\n\nIt feels like pulling teeth to get a straight answer out of him and it's a little frustrating.\n\nSo I wonder if he might just see us as friends?",
            "spoiler": false,
            "stickied": false,
            "title": "Does he (M,40) want to get to know me (F,33)?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm1duy/does_he_m40_want_to_get_to_know_me_f33/"
        },
        {
            "author": "u/TeresaTheWriter",
            "created_utc": "03-24-2022 09:44:59",
            "distinguished": null,
            "edited": false,
            "id": "tm1dl0",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm1dl0",
            "nsfw": true,
            "num_comments": 9,
            "permalink": "/r/relationship_advice/comments/tm1dl0/how_can_i_move_in_without_feeling_guilty/",
            "score": 2,
            "selftext": "I made the decision to leave my ten year relationship. I never thought I would actually be emotionally strong enough to do that because he’s all I ever known. We were hanging with one of his female friends whose\nIs about 45 years old. But she got into a argument with him because of the way he talks to me. She said she was tired of listening to it. He calls me stupid sometimes or picks a fight by criticizing every little thing l do. I can close the seatbelt in his car door by mistake n he will start attacking me. \n\nI felt so weak in front of her n I realized I needed to let our relationship go. He so toxic, you can’t tell him anybody himself because he views it as a personal attack. Lately I been thinking about what I have been thru n I think I have been emotionally abused. It’s been such a emotional roller coaster. I also feel bad for him he’s lost his mom, grandfather who was like his dad n he’s  homeless. \n\nLately he has been trying to get me back. Apologizing for how he talks to me. Wants us to get a place. I think he is a narcissist. Something about him is unsettling.  He started saying how I’ve been the only there for him for years. He even started crying. But what stood out to me is that he kept repeating his trauma in this sentence: “My mother died. My grandfather died. My little nephew fell out the window when he was a baby.” His nephew is 21 now so he survived it. It’s just the way he kept repeating the bad stuff that he went thru makes me feel like he is playing on the fact that he knows I worry about him, n I feel bad about the everything he’s been through. And he’s been thru a lot. \n\nI told him we could be friends but I didn’t want to have sex. But he’s been a little forceful. Sometimes he says “I’m going to just have to take control.” He tries to pull down my pants n I said no and got up from my sleep. Then he yelled. “Okay calm down. You act like I be beating you or like I’m abusive to you.” It’s hard to say no to him he doesn’t respect my boundaries. I have d one so much for him financially, emotionally yet he laughs n says I’ve done nothing when this dark side of him comes out.\n\nDo you guys think I was in a emotionally abusive relationship? How do I move on without feeling guilty about leaving him alone in this world?",
            "spoiler": false,
            "stickied": false,
            "title": "How can I move in without feeling guilty?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm1dl0/how_can_i_move_in_without_feeling_guilty/"
        },
        {
            "author": "u/Life_Shrimp",
            "created_utc": "03-24-2022 09:44:03",
            "distinguished": null,
            "edited": false,
            "id": "tm1d62",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm1d62",
            "nsfw": false,
            "num_comments": 5,
            "permalink": "/r/relationship_advice/comments/tm1d62/leaves_me_on_read_then_replies_hours_later/",
            "score": 2,
            "selftext": "Just looking for some advice. We matched on Hinge, started chatting. She was slow to respond, and I wasn’t getting notifications, so I asked for her number. She gave me it, along with her Facebook. 4 days later it’s been much the same, she’ll read my message, then reply hours later. Have noticed she’s unmatched with my on the app, as well. \n\nDo I take it she’s not interested?",
            "spoiler": false,
            "stickied": false,
            "title": "Leaves me on read then replies hours later, unmatched with me on app. Not interested?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm1d62/leaves_me_on_read_then_replies_hours_later/"
        },
        {
            "author": "u/Hot_Needleworker_153",
            "created_utc": "03-24-2022 03:45:49",
            "distinguished": null,
            "edited": false,
            "id": "tlvssl",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlvssl",
            "nsfw": false,
            "num_comments": 3,
            "permalink": "/r/relationship_advice/comments/tlvssl/best_friend_23m_leaves_me_24f_and_comes_back_like/",
            "score": 6,
            "selftext": "Me & my best friend have been friends for like 4-5 years. We always worked together until recently when he quit a few months ago and got a new successful-er job. We are super close and promised to stay consistent in each other’s lives and friendship and basically told each other how much we meant to each other and everything. But then, he quit and we haven’t hung out since. He’ll text me every now and then or call me but that’s about it. I’ve told him I miss him and wanna hang out and am sad that I feel like I’ve basically been dropped since he quit. He keeps saying we’ll hang out and then he don’t. He’s always kind of been in & out but I thought since he quit we would make each other a priority. I feel so sad without him in my life consistently because we are so close and I thought we felt the same way and it’s just hard to accept that we basically don’t. He goes months sometimes without wanting to hang out and then expects me to just drop everything to hang out with him. Although it hurts me I think I might have to exit out of his life because him being so in and out is super hard for me. I thought we meant what we said to each other. I just am so sad because he’s the first bestie I’ve had in so long… I just hate that for him it’s no big deal. He always is like “you’re just so scared of me leaving you” since he knows I have abandonment issues and then it feels like he exploits them and does this to me knowingly and idk what to do anymore.",
            "spoiler": false,
            "stickied": false,
            "title": "Best friend 23m leaves me 24f and comes back like nothing happened",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlvssl/best_friend_23m_leaves_me_24f_and_comes_back_like/"
        },
        {
            "author": "u/fighto_plankton",
            "created_utc": "03-24-2022 09:40:46",
            "distinguished": null,
            "edited": false,
            "id": "tm1bku",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm1bku",
            "nsfw": false,
            "num_comments": 7,
            "permalink": "/r/relationship_advice/comments/tm1bku/my_gf_wants_to_break_up_because_she_needs_time_to/",
            "score": 2,
            "selftext": "My (25m) gf (22f) says she wants to be alone to complete some soul searching and to find her own two feet. It hurts pretty bad since it came entirely out of the blue but I can support the notion. The problem is that she won't commit to breaking up and obviously I don't want to either but now I'm stuck in this weird limbo where I'm expecting to be broken up with every time I come home. How do we find a solution?",
            "spoiler": false,
            "stickied": false,
            "title": "my gf wants to break up because she needs time to find herself",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm1bku/my_gf_wants_to_break_up_because_she_needs_time_to/"
        },
        {
            "author": "u/Wild_Ad8231",
            "created_utc": "03-23-2022 16:58:28",
            "distinguished": null,
            "edited": false,
            "id": "tkxhzb",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tkxhzb",
            "nsfw": false,
            "num_comments": 45,
            "permalink": "/r/relationship_advice/comments/tkxhzb/husband_works_offshore_and_cheated_for_four_plus/",
            "score": 41,
            "selftext": "Okay so I am a mother of three children under 8 years old. I had my last child in 2021. My husband and I have had a fairly good marriage up until me finding out he was cheating. For our entire marriage he would be gone out of state working. He came home maybe every 2 weeks for about 6 days. I would always ask him if we wee okay and he would say yes. Looking back his communication skills were lacking but i just kind of brushed them aside. I never really took into consideration that i was in a long distance marriage it was just normal to me since it was all i have known. Over the years I did notice his obsession with his phone. He never wanted me to use it and would take it everywhere he went.....his favorite line was \"use your phone.\"  Fast forward to the summer of 2020. My husband came in for 2 weeks and we went on a family vacation. We had the best time. When he went back to work I started receiving messages on facebook from a fake page....the person behind the page would say stuff like T is messing with your man and you are living a fake life......etc. I started messaging the page back at first thinking that it was someone jealous looking to start problems but as i engaged further this person knew too much about my husband and I. I confronted my husband about it and he lied. He denied it and even got mad with me. Then I started baiting her to see if she had evidence and thats when the selfies and messages started coming in. it was definitely and affair. I am very close with his mother and she was very hurt literally in tears which got him to confess. He said it started in 2017 . He met her at a truck stop and things escalated. He wanted to end it but she and a male friend threatened to blackmail him if he did. They eventually stole his wallet and got his information to find me on facebook. i told him to end it and he said he did. He said they had trackers on him and knew where he was because they had access to his apple id. I want to believe this story so bad but there is a lot of things that dont make sense. First he couldn't prove to me he ended it. He never told me her real name. He wants me to leave it alone. I still dont know who she is because the profile pic was a girl from google image. Also, he lost his job in May of 2020 due to Covid and was home with me till the very end of 2020.....why did he start it back up with her when he went to the new company.....text messages proved he was with her on fathers day.....smh.....Post affair he has apologized many times...hes trying....he still works in Texas so its really hard to trust what he says.....to be honest I go back and forth from wanting to stay and wanting to go. Right before our wedding he cheated. 1 month prior to be exact....I was 22 and so young I felt pressured to marry him. I thought he was a great guy and the fact that he has cheated on me with 2 of my pregnancies that I know is really disgusting to me....what should I do???? He really is trying but I just dont look at him the same.",
            "spoiler": false,
            "stickied": false,
            "title": "Husband works offshore and cheated for four plus years",
            "upvote_ratio": 0.84,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tkxhzb/husband_works_offshore_and_cheated_for_four_plus/"
        },
        {
            "author": "u/smani786",
            "created_utc": "03-24-2022 09:19:26",
            "distinguished": null,
            "edited": false,
            "id": "tm11cm",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm11cm",
            "nsfw": false,
            "num_comments": 4,
            "permalink": "/r/relationship_advice/comments/tm11cm/i_keep_thinking_about_my_narcissistic_ex_how_to/",
            "score": 2,
            "selftext": "My ex gf and I broke up 5 months ago. I was glad as it was highly toxic and I was really unhappy, I know it was the right decision and that I deserve better but I just want some advice on how to stop missing her and keep myself motivated during the healing process. \n\nI was first with my ex 6 years ago but we broke up after 5 months when I found out she was engaged, i gave her another chance last year which I now regret as I thought she would have changed. When we were together 6 years ago I found out she was engaged to someone else so that's why I broke it off and cut her off. \n\nShe ended up getting divorced a year after her marriage, she did admit to having a few relationships afterwards. We got close and had some nice moments but I kept noticing how open she is with other guys and how she'd claim that every other guy was interested in her, she kept pushing me for marriage and kept blaming me for moving too slow just because I didn't want to rush in to marriage.  \n\nEverytime we'd argue about it, she would always say that it's my fault that things are moving slow and that she doesn't like being with someone who can't commit. She always used to say that she wanted me to open up to her and tell her how I feel and that I can talk to her about anything if I'm ever upset. So I did when I mentioned that I didn't like how open she is with other guys, she said that she didn't want to be with anyone that's insecure just like her ex husband was (even though she'd already cheated on her ex husband with me which was unknown to me at the time, so he had a reason to feel insecure). \n\nI don't get why she'd tell me to talk to her about anything then end up throwing it back in my face! I told her I'm not happy so we agreed to end it, I was confused at first cos she used to tell me that she misses me everyday and after that conversation she ended up blocking me off everything at the startwhich I thought was childish. \n\nWe had an argument a few weeks before the break up in which she said \"if we ever break up, it will be your loss\". At that moment in time, I actually felt worthless and believed her when she said it would be my loss because I thought I didnt deserve better but now I realise I do and that I rather stay single than to be involved with someone like her. I do miss her but I just want to heal and move on cos I know she's not good for me, and to help myself heal I am planning to stay away from relationships for a while and to do this I am planning on putting more focus on to my career (currently IT graduate, planning to advance my career by undertaking more software engineering certificates to enhance my career). I have also joined the gym now as another way to heal and improve mentally & physically and to keep myself busy. \n\nWe broke up 5 months ago but she messaged me on Christmas day saying: 'I just wanted to message you to say that I hope you’re okay and that I feel as though I’m ready to stay as friends with you if that’s what you wanted.. I didn’t think I would ever be able to say that we could stay as friends but I feel like I’m in a good place and I know everything has worked out for the best and I would be really happy to have you as a friend But if you don’t want to hear from me that’s okay too just let me know x' I did reply to her saying that I don't think it's a good idea and I wished her well. She just replied with a simple 'that's fine no worries x'. She hasn't messaged after that.\n\nI'm trying to not think about her messaging me, but I feel like I was really getting in to the healing process and was really focused on other aspects of my life such as my career. I know I deserve better but I see her quite often as we live near one another and I can't help but still feel hurt and a part of me still misses her. I know I won't probably move on straight away but I don't know why I'm still hurting over someone that is so toxic for me.\n\nI've recently finally managed to block her off every social media platform, I've accidentally deleted her number but if I end up finding it or if she messages me I will block that too. I do feel hurt still and keep thinking about her when I know she's not good for me, how can I move forward?",
            "spoiler": false,
            "stickied": false,
            "title": "I keep thinking about my narcissistic ex, how to forget about her?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm11cm/i_keep_thinking_about_my_narcissistic_ex_how_to/"
        },
        {
            "author": "u/asxhecx",
            "created_utc": "03-23-2022 10:54:10",
            "distinguished": null,
            "edited": false,
            "id": "tkqelx",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tkqelx",
            "nsfw": false,
            "num_comments": 20,
            "permalink": "/r/relationship_advice/comments/tkqelx/my_mom_cheated_on_my_dad_and_it_ruin_our/",
            "score": 123,
            "selftext": "8 years ago when I was 15 years old my mom cheated on my dad. And till this day I hold anger towards her. My dad never divorced and instead forgave her even though she never apologize for it .He was lying to himself that he did forgive her. My dad became an alcoholic over the years . He didn’t drink every day, but when he drank he couldn’t let go from drinking . When he drinks he is depressed , hurt and angry. He truly regrets marrying my mom , he regrets having a life with her and he says mean shit when he is drunk . He even becomes suicidal when he’s drunk . My dad has these random times when he decide to drink he loses control of who he is.  Yesterday was one of those days . And I’m honestly tired of it . Going through those random days where he decide to drink and his struggle to stop when he picks up a drink , made me hate him. Yesterday, I ask my mom why she did it for the first time. She ignore it . And I told her, dad just wants an apology that’s it. My mom won’t admit she cheated even though the evidence we found are clear as a day. She also considered social media dms isn’t consider cheating . Even though she was explicit with a guy she met from there . And had sex with more than a handful of times . I noticed I am bitter towards the idea of marriage now . In the past I wanted to get marry and have my own family one day,  because I wanted want my parents once had for each other. I never thought someone as caring and sweet as my mother would choose lust over love . I told her that she’s going to hell out of anger for committing adultery , and I told her that she’s dead to me and I don’t love her anymore . After I went to my room, I realize how hurt I was inside that I felt tears coming. My mother didn’t feel anything when I told her , she didn’t seem hurt by what I said to her , she seem not to care. I hate how i feel towards her and I hate going through this shit. I am 23 years old living at home , last year of college . And I realize my family will forever be broken because of the decision my dad decide to stay with my mom. And allow alcohol over the years to  control him when he drinks and become a total different identity from who he really is.  Years of them arguing and yelling ruined my love for them . I feel like my soul is becoming more cold because of the anger/ hatred I have towards both, but mainly my mother for breaking the family apart because of her actions. Deep down I want us to be a team again, and I want to have a loving relationship I once had with my mother, but I am so damn hurt that it’s not easy to do so.",
            "spoiler": false,
            "stickied": false,
            "title": "My mom cheated on my dad and it ruin our relationship",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tkqelx/my_mom_cheated_on_my_dad_and_it_ruin_our/"
        },
        {
            "author": "u/pukinginaka",
            "created_utc": "03-24-2022 09:13:47",
            "distinguished": null,
            "edited": false,
            "id": "tm0yoi",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm0yoi",
            "nsfw": false,
            "num_comments": 1,
            "permalink": "/r/relationship_advice/comments/tm0yoi/how_can_i_help_him_deal_with_his_feelings/",
            "score": 2,
            "selftext": "I (F19) am in a situationship with M20. Lately he's been experiencing so much shit in life-- losing a friend, heavy uni/work workload, etc. He needed space from everyone to figure out things but talked to me about how he still wants to talk and do something fun over the phone at least once a week (even if I told him he didn't need to; he could just focus on himself for that time. But he insisted). He told me he finds it difficult to express his feelings as he doesn't know them either. That's why I try to keep convos light as he likes to cope up by laughing and having fun convos. I couldn't physically be with him either bc we're countries away (but has plans on meeting/moving). \n\nHe feels very comfortable with me but again, struggles with recognizing his own feelings. How can I support him during these times? Is it possible for me to help him slowly recognize his feelings? I know this isn't my responsibility but I'd love to be there for him as a friend.",
            "spoiler": false,
            "stickied": false,
            "title": "how can I help him deal with his feelings?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm0yoi/how_can_i_help_him_deal_with_his_feelings/"
        },
        {
            "author": "u/ANALment",
            "created_utc": "03-24-2022 09:13:23",
            "distinguished": null,
            "edited": "03-24-2022 09:21:09",
            "id": "tm0yha",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm0yha",
            "nsfw": false,
            "num_comments": 29,
            "permalink": "/r/relationship_advice/comments/tm0yha/is_age_difference_really_matter/",
            "score": 3,
            "selftext": "Im talking to this girl for a month now and she learned that she is older than me (couple months older) and instantly says \"i dont date younger guys\". Should i keep or move on ?",
            "spoiler": false,
            "stickied": false,
            "title": "Is age difference really matter ?",
            "upvote_ratio": 0.71,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm0yha/is_age_difference_really_matter/"
        },
        {
            "author": "u/foreverxnever",
            "created_utc": "03-24-2022 07:01:11",
            "distinguished": null,
            "edited": false,
            "id": "tlz2z7",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlz2z7",
            "nsfw": false,
            "num_comments": 2,
            "permalink": "/r/relationship_advice/comments/tlz2z7/i_feel_like_im_in_a_one_sided_relationship/",
            "score": 3,
            "selftext": "Me (23F) and my boyfriend (27M) have been together 6 months now. He treats me well and he’s a very nice guy. But I feel like I’m putting everything I can into this relationship, with nothing in return. I don’t want a lot of things. I would just like simple things. The bare minimum.\n\nI do everything I can to make him feel happy, appreciated, and special. From actions to words to sex. I’m glad to do all these things for him, I like to see him happy. He seems to really enjoy it and has commented that it’s nice to finally have someone who truly cares for him. \n\nBut it just seems like he doesn’t care to do any of this for me. I tell myself he’s a nice guy and he’s just not great at showing me he cares. But I want reassurance, I want him to want me, I want occasional compliments, I would just like anything from him at this point.\n\nI have spoken to him about these things. Every time he seems to listen and understand, but nothing changes. I sometimes wonder if he even cares for me at all or he’s just waiting for someone better to come along.\n\nThis relationship is making me feel so bad about myself. I feel disgusting and generally unwanted. I know I should leave. But there’s things going on in my life right now and I can’t bring myself to be anymore alone than I already feel. I don’t want to be alone. I wish I could fix this.\n\nI’m not really sure what advice I’m looking for here. I just have nobody else to talk to.",
            "spoiler": false,
            "stickied": false,
            "title": "I feel like I’m in a one sided relationship.",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlz2z7/i_feel_like_im_in_a_one_sided_relationship/"
        },
        {
            "author": "u/Throw-rowrowyourboat",
            "created_utc": "03-23-2022 19:34:05",
            "distinguished": null,
            "edited": false,
            "id": "tl6pwo",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tl6pwo",
            "nsfw": true,
            "num_comments": 28,
            "permalink": "/r/relationship_advice/comments/tl6pwo/my_boyfriend_has_been_concerning_me_sexually/",
            "score": 27,
            "selftext": "So I (18F) live with my boyfriend (18M) of 3 years. We’ve done just about every sexual thing in the book. Recently we’ve had a rough patch, he’s been talking about hurting himself quite a lot and has been generally depressed, and told me I’m majority of the reason for it. He told me if he wants me to stay with him and for him to not be depressed I’d put in more effort and listen more. \nSo I tried that. I put it more effort sexually, and he wanted to do anal sex more. I’m open to it, so I told him yes. He wanted to do it a second time and I told him I didn’t really want to because it would hurt. He told me not to worry about it and proceeded to do it way tougher than he should’ve which caused me to bleed profusely. I confronted him about this and he told me he doesn’t really care because he hasn’t enjoyed it that much in a while and wants to do it like that again more often. I don’t even know where to start with this, it made me so uncomfortable that he wouldn’t even listen to my concerns, let alone causing me pain. How do I talk to him about this?",
            "spoiler": false,
            "stickied": false,
            "title": "My boyfriend has been concerning me sexually",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tl6pwo/my_boyfriend_has_been_concerning_me_sexually/"
        },
        {
            "author": "u/throwaway_Xmas_Gift",
            "created_utc": "03-23-2022 16:31:21",
            "distinguished": null,
            "edited": false,
            "id": "tkwjq8",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tkwjq8",
            "nsfw": false,
            "num_comments": 59,
            "permalink": "/r/relationship_advice/comments/tkwjq8/my_m25_girlfriend_f23_wants_to_go_clubbing_with_a/",
            "score": 44,
            "selftext": "Brief backstory:\n\n&#x200B;\n\nMy girlfriend (F23) and I (M25) have been together for a little over a month, but have been dating since late November (most of that time exclusively). We got to know each other on Tinder. During the initial period, she has met with others, I initially also, but then quickly let that be because I fell in love with her quite quickly. Since we were not together at that time, it is of course perfectly ok that she had other dates or had something with (a?) other guys.\n\n&#x200B;\n\nAfter we fell more and more in love with each other, she started to make excuses why she couldn't meet the other guy (let's call him S) at the beginning of January. It was hard for her to tell him clearly that she is with another man (doesn't want to hurt anyone). Then at the end of January she told him and he didn't take it so well. Was probably quite sad and she had to explain it to him in detail in a two-hour phone call. Both decided to stay friends.\n\n&#x200B;\n\nTwo weeks ago I asked her if there was anything new about S and if he was coping well with the rejection regarding anything beyond friendship. She then told me that she had brunch with him the week before and everything was normal so far. I was happy for her, and assured her that I have no problem with her meeting him on a friendly basis.\n\n&#x200B;\n\nNow to the topic:\n\n&#x200B;\n\nYesterday, while we are watching a movie a scene comes where the protagonists are partying in the club. She asked me if I would have a problem with her going out to celebrate without me. I answered truthfully that of course I would have no problem with it, because I trust her. She then told me that S had invited her to go partying with her. (Alternatively, he probably suggested badminton).\n\n&#x200B;\n\nMy first impulse was that yes, I trust her and therefore have no problem with it. I have also never seen myself as a boyfriend who wants to \"forbid\" or talk his girlfriend out of something. On the other hand, I now ask myself whether this constellation of her and S has to be in the club. She also offered that I could come along, but said that this will certainly be strange. To be honest, I can also imagine that.\n\n&#x200B;\n\nAm I reacting the wrong way? Should I just trust her? She says she loves me and I have nothing to worry about. I mean, it's not like I have a boyfriend or a longtime girlfriend with her, it's just S who wanted to be with her two months ago. On the other hand, of course, it could really be that the club visit is completely platonic, even from his side.",
            "spoiler": false,
            "stickied": false,
            "title": "My (M25) girlfriend (F23) wants to go clubbing with a guy she used to date.",
            "upvote_ratio": 0.8,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tkwjq8/my_m25_girlfriend_f23_wants_to_go_clubbing_with_a/"
        },
        {
            "author": "u/hulkthefrog",
            "created_utc": "03-24-2022 06:47:07",
            "distinguished": null,
            "edited": false,
            "id": "tlyvbu",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlyvbu",
            "nsfw": false,
            "num_comments": 18,
            "permalink": "/r/relationship_advice/comments/tlyvbu/my_ex_wants_his_dog_back_and_i_need_advice/",
            "score": 4,
            "selftext": "I’ll try to keep this as short as possible but I need advice. In February 2021 my ex got a 3 month old puppy - a Cane Corso & German Shepherd mix. We were in a relationship until August 2021 when I ended it. During the time we were together I bonded with the puppy (Yoshi) and watched him myself a handful of times. \n\nAt the end of 2021 my ex lost his job and was in a bad place. He was really depressed, couldn’t find work, and unable to care for Yoshi. He asked me if I wanted to keep him because he would be rehoming him otherwise. I took him because I love him and couldn’t bear to see him be rehomed or worse - end up in a shelter as my ex mentioned he might take him to one. He also said ideally he’d find someone to watch him until he got his life together but then would make jokes about not wanting Yoshi and often stated how he knew he couldn’t take care of his needs. \n\nWhen I took him he had just turned 13 months old. Since having him I have gotten him neutered and micro-chipped, I exercise him every morning at the park and started a training program that I’ve completed 2 out of 6 sessions so far and I work on training him every afternoon. I feel like I’ve done everything I could to acclimate him to my home and can’t imagine my life without him. He even sleeps on my bed. \n\nNow my ex is saying he only meant for me to take him and watch him “indefinitely” because at one point he mentioned needing someone to watch him while he got his life together but then would make jokes about not wanting him and, in more ways than one, explain how he was unable to care for him. He has a bit of a narcissist personality and I’m unsure if he’s just saying this to get to me because we were arguing about something unrelated, I told him I needed some time to disengage and process some difficult feelings because I’m trying my best to get over him but it’s really hard. He said I can’t not talk to him if I am going to be watching “his” dog - which is what started this whole mess of a conversation. \n\nBut either way, I’m lost about what to do. He’s telling me if I don’t bring him back soon that I’ll need to plan to part with him one day. I don’t want to give Yoshi back to him because he won’t take care of him like I am. He won’t train him and exercise him like I do. I can’t imagine my life without him. I would be devastated. I don’t know if there are any legal questions or issues here or if it’s just my word against his that it’s my dog now. I legitimately thought he was my dog and I just feel like I don’t know what to do. I can’t bear the thought of spending more time with him just to keep getting attached to have to give him back and be devastated. I’m wondering if anyone has any advice how I can handle this?",
            "spoiler": false,
            "stickied": false,
            "title": "My ex wants “his” dog back and I need advice.",
            "upvote_ratio": 0.75,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlyvbu/my_ex_wants_his_dog_back_and_i_need_advice/"
        },
        {
            "author": "u/Walnuthighboy",
            "created_utc": "03-23-2022 23:11:57",
            "distinguished": null,
            "edited": false,
            "id": "tlidah",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlidah",
            "nsfw": false,
            "num_comments": 12,
            "permalink": "/r/relationship_advice/comments/tlidah/sex_with_my_36f_new_boyfriend_44m_is_like_having/",
            "score": 12,
            "selftext": "We’ve been dating a few months.  Due to busy and conflicting schedules this month, we haven’t gotten to see each other as much as we did in January and February.\n\nWe clicked really well, have taken things semi-slow, and have just been enjoying this budding romance.  We started having sex at the very end of February, then our schedules went into overdrive for a few weeks.  We’ve only had a chance to see one another a couple of more times.\n\nDuring this busy month, we’ve been texting a lot more to keep our little romance going.  \n\nI couldn’t quite put my finger on it before, but through texting it has become very apparent he’s a pleaser and **only a pleaser**.\n\nSex has been all about me.  He was always putting me on top and would go down on me for extremely long periods of time.  Since it was so new, I figured he was just trying to show he wasn’t selfish.  But that was pretty much 90% of what we would do.  Even when I would move to another position, he would either move me back on top or start going down on me again after a very short period of time.\n\nSince we’ve been texting more, we’ve been talking about things we like and enjoy sexually.  Our turn ons, fantasies, you get it.  I’ll tell him mine but when it’s his turn his answers are:\n\n- whatever turns you on\n\n- I want to explore with my partner\n\n- we can do anything you like\n\n- I’m (him) desperate to know what you (me) desire\n\nAs great as all that is, I like it to be mutual.  I like pleasing, too.  I like hearing that there’s something more than just pleasing me.  That we can do and try things together.  It’s becoming boring fast because it really is, as I put it in the title, like having a one sided conversation.  How far can this actually go? \n\nI’ve gently mentioned this feels one sided.  That it would be nice to hear something other than, “pleasing you.” I don’t mind communicating more on the subject, I would just like advice on the best way to approach it.  \n\nI’m becoming concerned this is sexual incompatibility, even though it’s early in the game.  I haven’t liked a guy this much in years.  We have such a great time together, great chemistry, there’s a lot of respect for one another, our personalities and lives complement one another.  And then this.\n\nSo, here are my questions:\n\n- If you’ve dealt with this or something similar, what did you do?\n\n- Are there strategies (or whatever) to make this less all about me that I can try with him?\n\n- If your answer is “communicate with him,” okay, great, but what should I actually say?  Are there examples that I can give him, scenarios, or ideas where we can include both of us?\n\n- Also, does this kind of thing have a name that I can google? Fml",
            "spoiler": false,
            "stickied": false,
            "title": "Sex With My (36f) New Boyfriend (44m) is Like Having A One-Sided Conversation.",
            "upvote_ratio": 0.93,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlidah/sex_with_my_36f_new_boyfriend_44m_is_like_having/"
        },
        {
            "author": "u/JankyBoness",
            "created_utc": "03-24-2022 05:08:13",
            "distinguished": null,
            "edited": false,
            "id": "tlxar9",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlxar9",
            "nsfw": false,
            "num_comments": 2,
            "permalink": "/r/relationship_advice/comments/tlxar9/i_20f_believe_my_boyfriend_26m_are_moving_too_fast/",
            "score": 3,
            "selftext": "It pains me to say that as I am absolutely smitten over him, but I fear things between us are progressing too quickly and it makes me apprehensive due to how my last relationship had similar dynamics and we quickly became codependent. \n\nBasically we met at work, went on our first date on 2/13 and have been pretty much inseparable ever since. We see each other every day, take lunches together at work, then usually spend the night together at my place. \n\nDon’t get me wrong, I absolutely love spending time with him and I honestly do miss him when we’re apart, I just fear we are forming an unhealthy attachment. One thing I am sure of is that I am someone who needs alone time, even if I don’t want to be away from my partner I can still recognize when my social battery is drained and I need space to recharge. \n\nThis is his first “real” relationship as his longest relationship was only 3 months (he hasn’t dated anyone since 2016) and he’s spent most of his life single and focusing on his own aspirations. I on the other hand got out of a pretty serious relationship 6 months ago, and in retrospect my relationship with my ex was very codependent and similar in the way that from day 1, we were inseparable. \n\nI just fear I am repeating the pattern and I want a healthy, balanced relationship where boundaries are set and respected. We do communicate very well, and he is exceptional in the way of communicating and be receptive to my needs and his own. I just sometimes find myself overthinking and wondering if things are truly progressing too quickly or I still have wounds to mend from my last relationship that I’ve carried over into this one. \n\nAny advice is greatly appreciated as I feel at this point I am just thinking out loud and letting my anxieties speak.",
            "spoiler": false,
            "stickied": false,
            "title": "I (20F) believe my boyfriend (26M) are moving too fast",
            "upvote_ratio": 0.72,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlxar9/i_20f_believe_my_boyfriend_26m_are_moving_too_fast/"
        },
        {
            "author": "u/bunhead",
            "created_utc": "03-24-2022 06:39:41",
            "distinguished": null,
            "edited": false,
            "id": "tlyrbg",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlyrbg",
            "nsfw": false,
            "num_comments": 11,
            "permalink": "/r/relationship_advice/comments/tlyrbg/i_37f_found_my_bf_33m_texting_with_ex_is_it_over/",
            "score": 3,
            "selftext": "I’m still so hurt. I felt a gut feeling and went through my bf of 4 years phone, my marriage ended because I caught him cheating 6 years ago, and I know that’s on me to sort my shit out. I shouldn’t have done it, but fuck, unfortunately my gut was right. I found messages saying “wish you were here” and “when are you coming to visit?”. They are months apart and start and end abruptly. She lives far, and I believe him when he says it’s not physical. But fuck, that hurt to read, and I feel it is emotional cheating…I am open to the fact I might be too mad about too little, but that hurt so so much and I would never do that to him. Can I ask the jury here about some input\n\nTL;DR found bf texting flirty things with ex. It’s not physical but it’s inappropriate and feels like emotional cheating",
            "spoiler": false,
            "stickied": false,
            "title": "I (37F) found my bf (33M) texting with ex, is it over?",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlyrbg/i_37f_found_my_bf_33m_texting_with_ex_is_it_over/"
        },
        {
            "author": "u/Busted_Shovel",
            "created_utc": "03-24-2022 03:51:55",
            "distinguished": null,
            "edited": false,
            "id": "tlvwx5",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlvwx5",
            "nsfw": false,
            "num_comments": 16,
            "permalink": "/r/relationship_advice/comments/tlvwx5/my_girlfriend_f19_has_to_attend_family_meetings/",
            "score": 5,
            "selftext": "Me (M19) and my girlfriend (F19) have been dating for about 6 months. In that time she has gotten into this non denominational Christian church and I couldn't be happier, until today. We had a pretty bad fight a few days ago but we hung out yesterday and had a great time. Then today she told me, \"Ok I'm gonna tell you something but you can't get mad\" and I was bracing for something bad but I didn't know it was gonna hit me as hard as it did. \n\nHer church doesn't believe that people shouldn't be going out on dates one on one so they set up what she told me they call \"Family Bonding\" (which just sound like a group date to me). The way she describes the \"family bonding\" even sounds like a date. They will go to a restaurant or an arcade, and there will be equal amount of guys and girls. I feel kinda, betrayed that she wouldn't say that she can't go because she has a bf, or invite me to come with them.  I don't know how to react since I want to be supportive but also don't want her to go to these \"family bonding\" things that they put on if I'm not there.  I don't know what do do, should I make it clear that I don't want her going to those without me? Or should I just let her go to them and not worry about it?",
            "spoiler": false,
            "stickied": false,
            "title": "My girlfriend (F19) has to Attend \"Family Meetings\" at her Church and I (M19) Don't want her to",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlvwx5/my_girlfriend_f19_has_to_attend_family_meetings/"
        },
        {
            "author": "u/Lopsided-Sleep-4685",
            "created_utc": "03-24-2022 08:43:50",
            "distinguished": null,
            "edited": false,
            "id": "tm0jnx",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm0jnx",
            "nsfw": false,
            "num_comments": 11,
            "permalink": "/r/relationship_advice/comments/tm0jnx/please_tell_how_do_i_win_himmy_tinder_match_back/",
            "score": 2,
            "selftext": "\nI (28F) met this really nice, sensible, educated and polite guy. We instantly connected cause both of us are based out of remote locations and texting/call is only option we can resort to rn. It went super smoothly for a couple of weeks (he would record songs and send me, we had cute names for each other etc.). Both of us gave each other space until one day when I bombarded him with phone calls after getting drunk!!!!! I acted like one hell of a stage-5 clinger and as expected he started to maintain some distance. I sent a super long text saying goodbye only to text him back and he was courteous enough to reply! But I feel I have ruined whatever might have been possible as I looked super needy and desperate. Is there a way to get him back or should I just forget him?",
            "spoiler": false,
            "stickied": false,
            "title": "Please tell how do I win him(my tinder match) back",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm0jnx/please_tell_how_do_i_win_himmy_tinder_match_back/"
        },
        {
            "author": "u/No-One-2288",
            "created_utc": "03-24-2022 08:43:25",
            "distinguished": null,
            "edited": false,
            "id": "tm0jfr",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm0jfr",
            "nsfw": true,
            "num_comments": 8,
            "permalink": "/r/relationship_advice/comments/tm0jfr/seeking_awkward_nsfw_advice/",
            "score": 2,
            "selftext": "TW: sex mention \n\nTLDR: I don’t think he’s attracted to me anymore \n\nmy boyfriend and I have been together for awhile now and up until a few months ago he consistently got off from intercourse. It seems like it just doesn’t feel good to him anymore? He gets tired quick and we go for awhile. He uses the excuse that it’s desensitized from longer intercourse but we never had that problem before. We use lube when needed and that did help for awhile and now he hasn’t came in me during sex in a very long time. He’s very into oral so i do that all the time and he gets off fine, if not easier. Do you think he just isn’t attracted to my body anymore? Maybe he’s bored? What should I do? It feels like each time he gives me a reason it’s not true or it’s loaded….",
            "spoiler": false,
            "stickied": false,
            "title": "seeking awkward nsfw advice",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm0jfr/seeking_awkward_nsfw_advice/"
        },
        {
            "author": "u/Repulsive_Most_276",
            "created_utc": "03-24-2022 08:41:36",
            "distinguished": null,
            "edited": false,
            "id": "tm0iic",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm0iic",
            "nsfw": false,
            "num_comments": 7,
            "permalink": "/r/relationship_advice/comments/tm0iic/what_to_do_after_hooking_up/",
            "score": 2,
            "selftext": "If he hasn’t asked to chill again should I ask him to chill or does that mean he isn’t interested since he hasn’t said anything? I have a hard time with looking stupid (I know it’s an immature ego thing) but im bad at picking up on things. Really unsure if I should wait for him to ask again or ask myself if he’s interested in hanging out again or if it was just a one time thing. How are u supposed to know? Really need advice I don’t know why I’m stressing so much over this. I just started hanging out with guys after being in a relationship for the last 3 years ( 2 back to back). Down for honest direst answers thank you. ( both of us are in our early 20s)",
            "spoiler": false,
            "stickied": false,
            "title": "What to do after hooking up",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm0iic/what_to_do_after_hooking_up/"
        },
        {
            "author": "u/Unlucky_Fix8819",
            "created_utc": "03-24-2022 08:41:03",
            "distinguished": null,
            "edited": false,
            "id": "tm0i87",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tm0i87",
            "nsfw": false,
            "num_comments": 8,
            "permalink": "/r/relationship_advice/comments/tm0i87/my_boyfriend_23m_leaves_my_nudes_on_read/",
            "score": 2,
            "selftext": "Hi! This is my first time posting to Reddit so I’m not exactly sure what I’m doing but I guess I’m just coming on here to complain? \n\nMy “boyfriend” is a glorified FWB that we’ve been seeing and dating for a few months. We’ve had a few blowouts about the status of our relationship and our expectations of one another. In our last redefining of the relationship, we found something that both worked for us and things have been smoother sailing since. With that being said, we are really low contact; it will be days before one of us reaches out to the other. Again, part of the deal. \n\nSo last night I sent him a spicy picture and I got no response. I sent it to him at a reasonable time so unless he had his phone off before dinner, he would have received it. This isn’t the first time this has happened either. \n\nI think there is a lot of embarrassing parts in our relationship but this one really stings. I feel like a sexting picture of any kind would stop and should stop anyone in their tracks. I spent the majority of the night and now into the morning feeling so silly and embarrassed. I question wether the picture was any good or not and if that’s the reason why he didn’t respond. I’m not sure. It just makes me feel like shit especially because sending any type of picture is a very vulnerable thing. \n\nI don’t want to get upset with him about it because I know it will only turn into another argument about me “thinking too much”. Our relationship is not great and I’m sure there’s a ton of reg flags in the post and trust me I am not blind to them but sex is a huge part of our relationship and when shit like this happens I feel super rejected. \n\nGuess that’s it.",
            "spoiler": false,
            "stickied": false,
            "title": "My boyfriend (23M) leaves my nudes on read",
            "upvote_ratio": 1.0,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tm0i87/my_boyfriend_23m_leaves_my_nudes_on_read/"
        },
        {
            "author": "u/Ok-Necessary-9974",
            "created_utc": "03-24-2022 01:51:36",
            "distinguished": null,
            "edited": false,
            "id": "tlpshe",
            "is_original_content": false,
            "is_self": true,
            "link_flair_text": null,
            "locked": false,
            "name": "t3_tlpshe",
            "nsfw": false,
            "num_comments": 27,
            "permalink": "/r/relationship_advice/comments/tlpshe/my_28f_partner_32f_wants_our_sperm_donor_to_be/",
            "score": 6,
            "selftext": "I wish I was making that up but no, while looking into sperm donors since we plan on using IVF to get pregnant, my partner brings up how she’d prefer if the donor was blond with green or blue eyes and going on about how “unique” those features are and how cute that would be. The site we used had pictures of the donors and she’d talk about how cute the babies we’re and how our kids could be that cute. \n \nI’m a woman of color and having a child which features so far removed from mine will be alienating. I also don’t like the implication that having a baby that looks like that will be better if that makes sense? \n\nI still really want to be a mother and this is the only way I know of where we can have a baby naturally. We had a big argument about this and it’s a very sore spot. I’m not sure how to bring it up again without just going back and forth without solving anything.",
            "spoiler": false,
            "stickied": false,
            "title": "My (28f) partner (32f) wants our sperm donor to be “blonde with green or blue eyes”",
            "upvote_ratio": 0.63,
            "url": "https://www.reddit.com/r/relationship_advice/comments/tlpshe/my_28f_partner_32f_wants_our_sperm_donor_to_be/"
        }
    ]
}